///< CMSG_ACCOUNT_SET_CHEATS
struct AccountObjectSetCheats
{
    bool                         AutoBattle;                          ///< Offset 0x0000 Type _MJVTBL_BOOL
    JAM_ACCOUNTOBJECT_SET_CHEATS Type;                                ///< Offset 0x0004 Type _MJVTBL_JAM_ACCOUNTOBJECT_SET_CHEATS
    int8                         SlotLockCheat;                       ///< Offset 0x0008 Type _MJVTBL_INT8
};

///< CMSG_ACCOUNT_GET_PROFILE
struct AccountObjectGetProfile
{
    std::string Filename;           ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_ACCOUNT_SET_PROFILE
struct AccountObjectSetProfile
{
    uint8 * Profile;        ///< Offset 0x0000 Type _MJVTBL_NOT_IMPLEMENTED
};

///< CMSG_CHARACTER_OBJECT_TEST
struct CliCharacterObjectTest
{
    int32 Ping;         ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< CMSG_CHAT_JOIN_CHANNEL
struct CliChatJoinChannel
{
    std::string Password;                  ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string ChannelName;               ///< Offset 0x0080 Type _MJVTBL_STRING
    bool        CreateVoiceSession;        ///< Offset 0x0100 Type _MJVTBL_BOOL
    int32       ChatChannelId;             ///< Offset 0x0104 Type _MJVTBL_INT32
    bool        Internal;                  ///< Offset 0x0108 Type _MJVTBL_BOOL
};

///< CMSG_CHAT_LEAVE_CHANNEL
struct CliChatLeaveChannel
{
    int32       ZoneChannelID;        ///< Offset 0x0000 Type _MJVTBL_INT32
    std::string ChannelName;          ///< Offset 0x0004 Type _MJVTBL_STRING
};

///< CMSG_CHAT_GMCHAT
struct CliChatGMChat
{
    std::string Source;             ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Arguments;          ///< Offset 0x0132 Type _MJVTBL_STRING
    std::string Dest;               ///< Offset 0x0232 Type _MJVTBL_STRING
    uint64      Target;             ///< Offset 0x0368 Type _MJVTBL_UINT64
};

///< CMSG_CHAT_REPORT_IGNORED
struct CliChatReportIgnored
{
    uint64 IgnoredGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint8  Reason;             ///< Offset 0x0008 Type _MJVTBL_UINT8
};

///< CMSG_CHAT_REPORT_FILTERED
struct CliChatReportFiltered
{
    uint64 FilteredSenderGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< CMSG_CHAT_REGISTER_ADDON_PREFIXES
struct CliChatRegisterAddonPrefixes
{
    struct JamCliStructAddonPrefix
    {
        std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    };

    std::vector<JamCliStructAddonPrefix> Prefixes;                                    ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamCliStructAddonPrefix>::MJVTBL
};

///< CMSG_CHAT_UNREGISTER_ALL_ADDON_PREFIXES
struct CliChatUnregisterAllAddonPrefixes
{
};

///< CMSG_CHAT_MESSAGE_CHANNEL
struct CliChatMessageChannel
{
    int32       Language;           ///< Offset 0x0000 Type _MJVTBL_INT32
    std::string Text;               ///< Offset 0x0004 Type _MJVTBL_STRING
    std::string Target;             ///< Offset 0x0104 Type _MJVTBL_STRING
};

///< CMSG_CHAT_ADDON_MESSAGE_CHANNEL
struct CliChatAddonMessageChannel
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Target;             ///< Offset 0x0100 Type _MJVTBL_STRING
    std::string Prefix;             ///< Offset 0x0232 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_WHISPER
struct CliChatMessageWhisper
{
    std::string Target;             ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Text;               ///< Offset 0x0132 Type _MJVTBL_STRING
    int32       Language;           ///< Offset 0x0234 Type _MJVTBL_INT32
};

///< CMSG_CHAT_ADDON_MESSAGE_WHISPER
struct CliChatAddonMessageWhisper
{
    std::string Prefix;             ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Target;             ///< Offset 0x0011 Type _MJVTBL_STRING
    std::string Text;               ///< Offset 0x0143 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_GUILD
struct CliChatMessageGuild
{
    int32       Language;           ///< Offset 0x0000 Type _MJVTBL_INT32
    std::string Text;               ///< Offset 0x0004 Type _MJVTBL_STRING
};

///< CMSG_CHAT_ADDON_MESSAGE_GUILD
struct CliChatAddonMessageGuild
{
    std::string Prefix;             ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Text;               ///< Offset 0x0011 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_OFFICER
struct CliChatMessageOfficer
{
    int32       Language;           ///< Offset 0x0000 Type _MJVTBL_INT32
    std::string Text;               ///< Offset 0x0004 Type _MJVTBL_STRING
};

///< CMSG_CHAT_ADDON_MESSAGE_OFFICER
struct CliChatAddonMessageOfficer
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Prefix;             ///< Offset 0x0100 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_AFK
struct CliChatMessageAfk
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_DND
struct CliChatMessageDnd
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_LIST
struct CliChatChannelList
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_DISPLAY_LIST
struct CliChatChannelDisplayList
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_PASSWORD
struct CliChatChannelPassword
{
    std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string ChannelName;        ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_SET_OWNER
struct CliChatChannelSetOwner
{
    std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string ChannelName;        ///< Offset 0x0132 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_OWNER
struct CliChatChannelOwner
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_MODERATE
struct CliChatChannelModerate
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_MODERATOR
struct CliChatChannelModerator
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Name;               ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_UNMODERATOR
struct CliChatChannelUnmoderator
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Name;               ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_MUTE
struct CliChatChannelMute
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Name;               ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_UNMUTE
struct CliChatChannelUnmute
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Name;               ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_INVITE
struct CliChatChannelInvite
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Name;               ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_KICK
struct CliChatChannelKick
{
    std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string ChannelName;        ///< Offset 0x0132 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_BAN
struct CliChatChannelBan
{
    std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string ChannelName;        ///< Offset 0x0132 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_UNBAN
struct CliChatChannelUnban
{
    std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string ChannelName;        ///< Offset 0x0132 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_ANNOUNCEMENTS
struct CliChatChannelAnnouncements
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_SILENCE_VOICE
struct CliChatChannelSilenceVoice
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Name;               ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_UNSILENCE_VOICE
struct CliChatChannelUnsilenceVoice
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Name;               ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_SILENCE_ALL
struct CliChatChannelSilenceAll
{
    std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string ChannelName;        ///< Offset 0x0132 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_UNSILENCE_ALL
struct CliChatChannelUnsilenceAll
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Name;               ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_VOICE_ON
struct CliChatChannelVoiceOn
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_VOICE_OFF
struct CliChatChannelVoiceOff
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_CHANNEL_DECLINE_INVITE
struct CliChatChannelDeclineInvite
{
    std::string ChannelName;        ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_SAY
struct CliChatMessageSay
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
    int32       Language;           ///< Offset 0x0100 Type _MJVTBL_INT32
};

///< CMSG_CHAT_MESSAGE_EMOTE
struct CliChatMessageEmote
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_YELL
struct CliChatMessageYell
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
    int32       Language;           ///< Offset 0x0100 Type _MJVTBL_INT32
};

///< CMSG_CHAT_MESSAGE_PARTY
struct CliChatMessageParty
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
    int32       Language;           ///< Offset 0x0100 Type _MJVTBL_INT32
};

///< CMSG_CHAT_ADDON_MESSAGE_PARTY
struct CliChatAddonMessageParty
{
    std::string Prefix;             ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Text;               ///< Offset 0x0011 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_RAID
struct CliChatMessageRaid
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
    int32       Language;           ///< Offset 0x0100 Type _MJVTBL_INT32
};

///< CMSG_CHAT_ADDON_MESSAGE_RAID
struct CliChatAddonMessageRaid
{
    std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Prefix;             ///< Offset 0x0100 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_INSTANCE_CHAT
struct CliChatMessageInstanceChat
{
    int32       Language;           ///< Offset 0x0000 Type _MJVTBL_INT32
    std::string Text;               ///< Offset 0x0004 Type _MJVTBL_STRING
};

///< CMSG_CHAT_ADDON_MESSAGE_INSTANCE_CHAT
struct CliChatAddonMessageInstanceChat
{
    std::string Prefix;             ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string Text;               ///< Offset 0x0011 Type _MJVTBL_STRING
};

///< CMSG_CHAT_MESSAGE_RAID_WARNING
struct CliChatMessageRaidWarning
{
    int32       Language;           ///< Offset 0x0000 Type _MJVTBL_INT32
    std::string Text;               ///< Offset 0x0004 Type _MJVTBL_STRING
};

///< SMSG_SET_VETERAN_TRIAL
struct ClientSetVeteranTrial
{
    bool IsVeteranTrial;        ///< Offset 0x0000 Type _MJVTBL_BOOL
};

///< SMSG_AUTH_RESPONSE
struct ClientAuthResponse
{
    struct JamAuthWaitInfo
    {
        uint32 WaitCount;        ///< Offset 0x0000 Type _MJVTBL_UINT32
        bool   HasFCM;           ///< Offset 0x0004 Type _MJVTBL_BOOL
    };

    struct JamAuthSuccessInfo
    {
        struct JamVirtualRealmInfo
        {
            struct RealmNameInfo_Struct
            {
                bool        IsLocal;                    ///< Offset 0x0000 Type _MJVTBL_BOOL
                std::string RealmNameActual;            ///< Offset 0x0001 Type _MJVTBL_STRING
                std::string RealmNameNormalized;        ///< Offset 0x0101 Type _MJVTBL_STRING
            };

            uint32               RealmAddress;                ///< Offset 0x0000 Type _MJVTBL_UINT32
            RealmNameInfo_Struct RealmNameInfo;               ///< Offset 0x0004 Type _MJVTBL_STRUCT
        };

        struct JamRaceClassAvailability
        {
            JamRaceClassAvailability(uint8 RoC, uint8 E)
            {
                RaceOrClassID = RoC;
                RequiredExpansion = E;
            }

            uint8 RaceOrClassID;            ///< Offset 0x0000 Type _MJVTBL_UINT8
            uint8 RequiredExpansion;        ///< Offset 0x0001 Type _MJVTBL_UINT8
        };

        struct JamAvailableCharacterTemplateSet
        {
            struct JamAvailableCharacterTemplateClass
            {
                uint8 ClassID;             ///< Offset 0x0000 Type _MJVTBL_UINT8
                uint8 FactionGroup;        ///< Offset 0x0001 Type _MJVTBL_UINT8
            };

            uint32                                          TemplateSetID;                                          ///< Offset 0x0000 Type _MJVTBL_UINT32
            std::string                                     Name;                                                   ///< Offset 0x0004 Type _MJVTBL_STRING
            std::string                                     Description;                                            ///< Offset 0x0045 Type _MJVTBL_STRING
            std::vector<JamAvailableCharacterTemplateClass> Classes;                                                ///< Offset 0x0448 Type MakeMJVTblForArrayOfStruct<JamAvailableCharacterTemplateClass>::MJVTBL
        };

        uint32                                        VirtualRealmAddress;                                  ///< Offset 0x0000 Type _MJVTBL_UINT32
        std::vector<JamVirtualRealmInfo>              VirtualRealms;                                        ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamVirtualRealmInfo>::MJVTBL
        uint32                                        TimeRemain;                                           ///< Offset 0x0020 Type _MJVTBL_UINT32
        uint32                                        TimeOptions;                                          ///< Offset 0x0024 Type _MJVTBL_UINT32
        uint32                                        TimeRested;                                           ///< Offset 0x0028 Type _MJVTBL_UINT32
        uint8                                         ActiveExpansionLevel;                                 ///< Offset 0x002C Type _MJVTBL_UINT8
        uint8                                         AccountExpansionLevel;                                ///< Offset 0x002D Type _MJVTBL_UINT8
        bool                                          IsExpansionTrial;                                     ///< Offset 0x002E Type _MJVTBL_BOOL
        uint32                                        TimeSecondsUntilPCKick;                               ///< Offset 0x0030 Type _MJVTBL_UINT32
        std::vector<JamRaceClassAvailability>         AvailableRaces;                                       ///< Offset 0x0038 Type MakeMJVTblForArrayOfStruct<JamRaceClassAvailability>::MJVTBL
        std::vector<JamRaceClassAvailability>         AvailableClasses;                                     ///< Offset 0x0050 Type MakeMJVTblForArrayOfStruct<JamRaceClassAvailability>::MJVTBL
        std::vector<JamAvailableCharacterTemplateSet> Templates;                                            ///< Offset 0x0068 Type MakeMJVTblForArrayOfStruct<JamAvailableCharacterTemplateSet>::MJVTBL
        bool                                          ForceCharacterTemplate;                               ///< Offset 0x0080 Type _MJVTBL_BOOL
        Optional<uint16>                              NumPlayersHorde;                                      ///< Offset 0x0082 Type MakeMJVTblForOptional<unsignedshort,&(MJVTBL_UINT16)>::MJVTBL
        Optional<uint16>                              NumPlayersAlliance;                                   ///< Offset 0x0086 Type MakeMJVTblForOptional<unsignedshort,&(MJVTBL_UINT16)>::MJVTBL
        bool                                          IsVeteranTrial;                                       ///< Offset 0x008A Type _MJVTBL_BOOL
        uint32                                        CurrencyID;                                           ///< Offset 0x008C Type _MJVTBL_UINT32
    };

    Optional<JamAuthWaitInfo>    WaitInfo;                            ///< Offset 0x0000 Type MakeMJVTblForOptionalStruct<JamAuthWaitInfo>::MJVTBL
    uint8                        Result;                              ///< Offset 0x000C Type _MJVTBL_UINT8
    Optional<JamAuthSuccessInfo> SuccessInfo;                         ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamAuthSuccessInfo>::MJVTBL
};

///< SMSG_WAIT_QUEUE_UPDATE
struct ClientWaitQueueUpdate
{
    struct WaitInfo_Struct
    {
        uint32 WaitCount;        ///< Offset 0x0000 Type _MJVTBL_UINT32
        bool   HasFCM;           ///< Offset 0x0004 Type _MJVTBL_BOOL
    };

    WaitInfo_Struct WaitInfo;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_WAIT_QUEUE_FINISH
struct ClientWaitQueueFinish
{
};

///< SMSG_ALL_ACHIEVEMENT_DATA
struct ClientAllAchievementData
{
    struct Data_Struct
    {
        struct JamEarnedAchievement
        {
            int32   Id;                         ///< Offset 0x0000 Type _MJVTBL_INT32
            uint8 * Date;                       ///< Offset 0x0004 Type _MJVTBL_NOT_IMPLEMENTED
            uint64  Owner;                      ///< Offset 0x0028 Type _MJVTBL_UINT64
            uint32  VirtualRealmAddress;        ///< Offset 0x0030 Type _MJVTBL_UINT32
            uint32  NativeRealmAddress;         ///< Offset 0x0034 Type _MJVTBL_UINT32
        };

        struct JamCriteriaProgress
        {
            int32   Id;                    ///< Offset 0x0000 Type _MJVTBL_INT32
            uint64  Quantity;              ///< Offset 0x0008 Type _MJVTBL_UINT64
            uint64  Player;                ///< Offset 0x0010 Type _MJVTBL_UINT64
            int32   Flags;                 ///< Offset 0x0018 Type _MJVTBL_INT32
            uint8 * Date;                  ///< Offset 0x001C Type _MJVTBL_NOT_IMPLEMENTED
            uint32  TimeFromStart;         ///< Offset 0x0040 Type _MJVTBL_TIME_T
            uint32  TimeFromCreate;        ///< Offset 0x0048 Type _MJVTBL_TIME_T
        };

        std::vector<JamEarnedAchievement> Earned;                                   ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamEarnedAchievement>::MJVTBL
        std::vector<JamCriteriaProgress>  Progress;                                 ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamCriteriaProgress>::MJVTBL
    };

    Data_Struct Data;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_ALL_ACCOUNT_CRITERIA
struct ClientAllAccountCriteria
{
    struct JamCriteriaProgress
    {
        int32   Id;                    ///< Offset 0x0000 Type _MJVTBL_INT32
        uint64  Quantity;              ///< Offset 0x0008 Type _MJVTBL_UINT64
        uint64  Player;                ///< Offset 0x0010 Type _MJVTBL_UINT64
        int32   Flags;                 ///< Offset 0x0018 Type _MJVTBL_INT32
        uint8 * Date;                  ///< Offset 0x001C Type _MJVTBL_NOT_IMPLEMENTED
        uint32  TimeFromStart;         ///< Offset 0x0040 Type _MJVTBL_TIME_T
        uint32  TimeFromCreate;        ///< Offset 0x0048 Type _MJVTBL_TIME_T
    };

    std::vector<JamCriteriaProgress> Progress;                                ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamCriteriaProgress>::MJVTBL
};

///< SMSG_RESPOND_INSPECT_ACHIEVEMENTS
struct ClientRespondInspectAchievements
{
    struct Data_Struct
    {
        struct JamEarnedAchievement
        {
            int32   Id;                         ///< Offset 0x0000 Type _MJVTBL_INT32
            uint8 * Date;                       ///< Offset 0x0004 Type _MJVTBL_NOT_IMPLEMENTED
            uint64  Owner;                      ///< Offset 0x0028 Type _MJVTBL_UINT64
            uint32  VirtualRealmAddress;        ///< Offset 0x0030 Type _MJVTBL_UINT32
            uint32  NativeRealmAddress;         ///< Offset 0x0034 Type _MJVTBL_UINT32
        };

        struct JamCriteriaProgress
        {
            int32   Id;                    ///< Offset 0x0000 Type _MJVTBL_INT32
            uint64  Quantity;              ///< Offset 0x0008 Type _MJVTBL_UINT64
            uint64  Player;                ///< Offset 0x0010 Type _MJVTBL_UINT64
            int32   Flags;                 ///< Offset 0x0018 Type _MJVTBL_INT32
            uint8 * Date;                  ///< Offset 0x001C Type _MJVTBL_NOT_IMPLEMENTED
            uint32  TimeFromStart;         ///< Offset 0x0040 Type _MJVTBL_TIME_T
            uint32  TimeFromCreate;        ///< Offset 0x0048 Type _MJVTBL_TIME_T
        };

        std::vector<JamEarnedAchievement> Earned;                                   ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamEarnedAchievement>::MJVTBL
        std::vector<JamCriteriaProgress>  Progress;                                 ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamCriteriaProgress>::MJVTBL
    };

    uint64      Player;             ///< Offset 0x0000 Type _MJVTBL_UINT64
    Data_Struct Data;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
};

///< SMSG_SETUP_CURRENCY
struct ClientSetupCurrency
{
    struct ClientSetupCurrencyRecord
    {
        int32           Type;                     ///< Offset 0x0000 Type _MJVTBL_INT32
        int32           Quantity;                 ///< Offset 0x0004 Type _MJVTBL_INT32
        Optional<int32> WeeklyQuantity;           ///< Offset 0x0008 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
        Optional<int32> MaxWeeklyQuantity;        ///< Offset 0x0010 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
        Optional<int32> TrackedQuantity;          ///< Offset 0x0018 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
        uint8           Flags;                    ///< Offset 0x0020 Type _MJVTBL_UINT8
    };

    std::vector<ClientSetupCurrencyRecord> Data;                                          ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ClientSetupCurrencyRecord>::MJVTBL
};

///< SMSG_SET_CURRENCY
struct ClientSetCurrency
{
    bool            SuppressChatLog;        ///< Offset 0x0000 Type _MJVTBL_BOOL
    Optional<int32> TrackedQuantity;        ///< Offset 0x0004 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
    int32           Quantity;               ///< Offset 0x000C Type _MJVTBL_INT32
    uint32          Flags;                  ///< Offset 0x0010 Type _MJVTBL_UINT32
    int32           Type;                   ///< Offset 0x0014 Type _MJVTBL_INT32
    Optional<int32> WeeklyQuantity;         ///< Offset 0x0018 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_RESET_WEEKLY_CURRENCY
struct ClientResetWeeklyCurrency
{
};

///< SMSG_MESSAGE_BOX
struct ClientMessageBox
{
    uint8 * Text;           ///< Offset 0x0000 Type _MJVTBL_NOT_IMPLEMENTED
};

///< SMSG_WARDEN_DATA
struct ClientWardenData
{
    uint8 * Packet;         ///< Offset 0x0000 Type _MJVTBL_NOT_IMPLEMENTED
};

///< SMSG_PHASE_SHIFT_CHANGE
struct ClientPhaseShiftChange
{
    struct PhaseShift_Struct
    {
        struct PhaseShiftDataPhase
        {
            uint16 PhaseFlags;        ///< Offset 0x0000 Type _MJVTBL_UINT16
            uint16 Id;                ///< Offset 0x0002 Type _MJVTBL_UINT16
        };

        uint32                           PhaseShiftFlags;                         ///< Offset 0x0000 Type _MJVTBL_UINT32
        std::vector<PhaseShiftDataPhase> Phases;                                  ///< Offset 0x0004 Type MakeMJVTblForArrayOfStruct<PhaseShiftDataPhase>::MJVTBL
        uint64                           PersonalGUID;                            ///< Offset 0x0020 Type _MJVTBL_UINT64
    };

    uint64            Client;                       ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint8 *           PreloadMapIDs;                ///< Offset 0x0008 Type _MJVTBL_NOT_IMPLEMENTED
    PhaseShift_Struct PhaseShift;                   ///< Offset 0x0038 Type _MJVTBL_STRUCT
    uint8 *           UiWorldMapAreaIDSwaps;        ///< Offset 0x0060 Type _MJVTBL_NOT_IMPLEMENTED
    uint8 *           VisibleMapIDs;                ///< Offset 0x0090 Type _MJVTBL_NOT_IMPLEMENTED
};

///< SMSG_MOUNT_RESULT
struct ClientMountResult
{
    uint32 Result;        ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_DISMOUNT_RESULT
struct ClientDismountResult
{
    uint32 Result;        ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_BIND_POINT_UPDATE
struct ClientBindPointUpdate
{
    uint32       BindMapID;           ///< Offset 0x0000 Type _MJVTBL_UINT32
    G3D::Vector3 BindPosition;        ///< Offset 0x0004 Type _MJVTBL_V3
    uint32       BindAreaID;          ///< Offset 0x0010 Type _MJVTBL_UINT32
};

///< SMSG_PLAYER_BOUND
struct ClientPlayerBound
{
    uint64 BinderID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32 AreaID;          ///< Offset 0x0008 Type _MJVTBL_UINT32
};

///< SMSG_RESURRECT_REQUEST
struct ClientResurrectRequest
{
    uint64      ResurrectOffererGUID;                       ///< Offset 0x0000 Type _MJVTBL_UINT64
    bool        Sickness;                                   ///< Offset 0x0008 Type _MJVTBL_BOOL
    uint32      ResurrectOffererVirtualRealmAddress;        ///< Offset 0x000C Type _MJVTBL_UINT32
    std::string Name;                                       ///< Offset 0x0010 Type _MJVTBL_STRING
    uint32      PetNumber;                                  ///< Offset 0x0044 Type _MJVTBL_UINT32
    bool        UseTimer;                                   ///< Offset 0x0048 Type _MJVTBL_BOOL
    int32       SpellID;                                    ///< Offset 0x004C Type _MJVTBL_INT32
};

///< SMSG_INITIAL_SETUP
struct ClientInitialSetup
{
    uint8              ServerExpansionTier;         ///< Offset 0x0000 Type _MJVTBL_UINT8
    uint8              ServerExpansionLevel;        ///< Offset 0x0001 Type _MJVTBL_UINT8
    uint32             RaidOrigin;                  ///< Offset 0x0008 Type _MJVTBL_TIME_T
    std::vector<uint8> QuestsCompleted;             ///< Offset 0x0010 Type MakeMJVTblForArrayOf<unsignedchar,&(MJVTBL_UINT8)>::MJVTBL
    int32              ServerRegionID;              ///< Offset 0x0028 Type _MJVTBL_INT32
};

///< SMSG_TRADE_UPDATED
struct ClientTradeUpdated
{
    struct JamTradeItem
    {
        struct JamUnwrappedTradeItem
        {
            struct Item_Struct
            {
                struct JamItemBonusInstanceData
                {
                    struct Context_Struct
                    {
                        uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                    };

                    struct Bonuses_Struct
                    {
                        std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                    };

                    Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                    Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
                };

                int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
                int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
                int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
                Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
                Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
            };

            Item_Struct Item;                      ///< Offset 0x0000 Type _MJVTBL_STRUCT
            int32       EnchantID;                 ///< Offset 0x0060 Type _MJVTBL_INT32
            int32       OnUseEnchantmentID;        ///< Offset 0x0064 Type _MJVTBL_INT32
            uint64      Creator;                   ///< Offset 0x0068 Type _MJVTBL_UINT64
            int32       Charges;                   ///< Offset 0x0070 Type _MJVTBL_INT32
            bool        Lock;                      ///< Offset 0x0074 Type _MJVTBL_BOOL
            uint32      MaxDurability;             ///< Offset 0x0078 Type _MJVTBL_UINT32
            uint32      Durability;                ///< Offset 0x007C Type _MJVTBL_UINT32
            int32       SocketEnchant[3];          ///< Offset 0x0080 Type MakeMJVTblForFixedArrayOf<int,3,&(MJVTBL_INT32)>::MJVTBL
        };

        uint8                           Slot;                                   ///< Offset 0x0000 Type _MJVTBL_UINT8
        int32                           EntryID;                                ///< Offset 0x0004 Type _MJVTBL_INT32
        int32                           StackCount;                             ///< Offset 0x0008 Type _MJVTBL_INT32
        uint64                          GiftCreator;                            ///< Offset 0x0010 Type _MJVTBL_UINT64
        Optional<JamUnwrappedTradeItem> Unwrapped;                              ///< Offset 0x0018 Type MakeMJVTblForOptionalStruct<JamUnwrappedTradeItem>::MJVTBL
    };

    uint64                    Gold;                             ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32                    CurrentStateIndex;                ///< Offset 0x0008 Type _MJVTBL_UINT32
    uint8                     WhichPlayer;                      ///< Offset 0x000C Type _MJVTBL_UINT8
    uint32                    ClientStateIndex;                 ///< Offset 0x0010 Type _MJVTBL_UINT32
    std::vector<JamTradeItem> Items;                            ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamTradeItem>::MJVTBL
    int32                     CurrencyType;                     ///< Offset 0x0030 Type _MJVTBL_INT32
    uint32                    ID;                               ///< Offset 0x0034 Type _MJVTBL_UINT32
    int32                     ProposedEnchantment;              ///< Offset 0x0038 Type _MJVTBL_INT32
    int32                     CurrencyQuantity;                 ///< Offset 0x003C Type _MJVTBL_INT32
};

///< SMSG_TRADE_STATUS
struct ClientTradeStatus
{
    TRADE_STATUS Status;                          ///< Offset 0x0000 Type _MJVTBL_TRADE_STATUS
    uint8        TradeSlot;                       ///< Offset 0x0004 Type _MJVTBL_UINT8
    uint64       Partner;                         ///< Offset 0x0008 Type _MJVTBL_UINT64
    int32        CurrencyType;                    ///< Offset 0x0010 Type _MJVTBL_INT32
    int32        CurrencyQuantity;                ///< Offset 0x0014 Type _MJVTBL_INT32
    bool         FailureForYou;                   ///< Offset 0x0018 Type _MJVTBL_BOOL
    int32        BagResult;                       ///< Offset 0x001C Type _MJVTBL_INT32
    int32        ItemID;                          ///< Offset 0x0020 Type _MJVTBL_INT32
    uint32       ID;                              ///< Offset 0x0024 Type _MJVTBL_UINT32
    bool         PartnerIsSameBnetAccount;        ///< Offset 0x0028 Type _MJVTBL_BOOL
};

///< SMSG_ENUM_CHARACTERS_RESULT
struct ClientEnumCharactersResult
{
    struct JamClientCharacterListEntry
    {
        struct JamClientCharacterListItem
        {
            uint32 DisplayID;               ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint32 DisplayEnchantID;        ///< Offset 0x0004 Type _MJVTBL_UINT32
            uint8  InvType;                 ///< Offset 0x0008 Type _MJVTBL_UINT8
        };

        uint64                     Guid;                              ///< Offset 0x0000 Type _MJVTBL_UINT64
        std::string                Name;                              ///< Offset 0x0008 Type _MJVTBL_STRING
        uint8                      ListPosition;                      ///< Offset 0x0039 Type _MJVTBL_UINT8
        uint8                      RaceID;                            ///< Offset 0x003A Type _MJVTBL_UINT8
        uint8                      ClassID;                           ///< Offset 0x003B Type _MJVTBL_UINT8
        uint8                      SexID;                             ///< Offset 0x003C Type _MJVTBL_UINT8
        uint8                      SkinID;                            ///< Offset 0x003D Type _MJVTBL_UINT8
        uint8                      FaceID;                            ///< Offset 0x003E Type _MJVTBL_UINT8
        uint8                      HairStyle;                         ///< Offset 0x003F Type _MJVTBL_UINT8
        uint8                      HairColor;                         ///< Offset 0x0040 Type _MJVTBL_UINT8
        uint8                      FacialHairStyle;                   ///< Offset 0x0041 Type _MJVTBL_UINT8
        uint8                      ExperienceLevel;                   ///< Offset 0x0042 Type _MJVTBL_UINT8
        int32                      ZoneID;                            ///< Offset 0x0044 Type _MJVTBL_INT32
        int32                      MapID;                             ///< Offset 0x0048 Type _MJVTBL_INT32
        G3D::Vector3               PreloadPos;                        ///< Offset 0x004C Type _MJVTBL_V3
        uint64                     GuildGUID;                         ///< Offset 0x0058 Type _MJVTBL_UINT64
        uint32                     Flags;                             ///< Offset 0x0060 Type _MJVTBL_UINT32
        uint32                     Flags2;                            ///< Offset 0x0064 Type _MJVTBL_UINT32
        uint32                     Flags3;                            ///< Offset 0x0068 Type _MJVTBL_UINT32
        bool                       FirstLogin;                        ///< Offset 0x006C Type _MJVTBL_BOOL
        uint32                     PetCreatureDisplayID;              ///< Offset 0x0070 Type _MJVTBL_UINT32
        uint32                     PetExperienceLevel;                ///< Offset 0x0074 Type _MJVTBL_UINT32
        uint32                     PetCreatureFamilyID;               ///< Offset 0x0078 Type _MJVTBL_UINT32
        bool                       BoostInProgress;                   ///< Offset 0x007C Type _MJVTBL_BOOL
        int32                      ProfessionIDs[2];                  ///< Offset 0x0080 Type MakeMJVTblForFixedArrayOf<int,2,&(MJVTBL_INT32)>::MJVTBL
        JamClientCharacterListItem InventoryItems[23];                ///< Offset 0x0088 Type MakeMJVTblForFixedArrayOfStruct<JamClientCharacterListItem,23>::MJVTBL
    };

    struct JamClientRestrictedFactionChangeRule
    {
        int32 Mask;          ///< Offset 0x0000 Type _MJVTBL_INT32
        uint8 RaceID;        ///< Offset 0x0004 Type _MJVTBL_UINT8
    };

    std::vector<JamClientCharacterListEntry>          Characters;                                               ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamClientCharacterListEntry>::MJVTBL
    bool                                              Success;                                                  ///< Offset 0x0018 Type _MJVTBL_BOOL
    std::vector<JamClientRestrictedFactionChangeRule> FactionChangeRestrictions;                                ///< Offset 0x0020 Type MakeMJVTblForArrayOfStruct<JamClientRestrictedFactionChangeRule>::MJVTBL
    bool                                              IsDeletedCharacters;                                      ///< Offset 0x0038 Type _MJVTBL_BOOL
};

///< SMSG_GENERATE_RANDOM_CHARACTER_NAME_RESULT
struct ClientGenerateRandomCharacterNameResult
{
    std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    bool        Success;            ///< Offset 0x0031 Type _MJVTBL_BOOL
};

///< SMSG_SETUP_RESEARCH_HISTORY
struct ClientSetupResearchHistory
{
    struct JamResearchHistory
    {
        int32  ProjectID;              ///< Offset 0x0000 Type _MJVTBL_INT32
        uint32 FirstCompleted;         ///< Offset 0x0008 Type _MJVTBL_TIME_T
        int32  CompletionCount;        ///< Offset 0x0010 Type _MJVTBL_INT32
    };

    std::vector<JamResearchHistory> History;                                ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamResearchHistory>::MJVTBL
};

///< SMSG_RESEARCH_COMPLETE
struct ClientResearchComplete
{
    struct Research_Struct
    {
        int32  ProjectID;              ///< Offset 0x0000 Type _MJVTBL_INT32
        uint32 FirstCompleted;         ///< Offset 0x0008 Type _MJVTBL_TIME_T
        int32  CompletionCount;        ///< Offset 0x0010 Type _MJVTBL_INT32
    };

    Research_Struct Research;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_ARCHAEOLOGY_SURVERY_CAST
struct ClientArchaeologySurveryCast
{
    int32  ResearchBranchID;         ///< Offset 0x0000 Type _MJVTBL_INT32
    bool   SuccessfulFind;           ///< Offset 0x0004 Type _MJVTBL_BOOL
    uint32 NumFindsCompleted;        ///< Offset 0x0008 Type _MJVTBL_UINT32
    uint32 TotalFinds;               ///< Offset 0x000C Type _MJVTBL_UINT32
};

///< SMSG_PET_SLOT_UPDATED
struct ClientPetSlotUpdated
{
    int32 PetSlotA;          ///< Offset 0x0000 Type _MJVTBL_INT32
    int32 PetNumberB;        ///< Offset 0x0004 Type _MJVTBL_INT32
    int32 PetNumberA;        ///< Offset 0x0008 Type _MJVTBL_INT32
    int32 PetSlotB;          ///< Offset 0x000C Type _MJVTBL_INT32
};

///< SMSG_PET_MODE
struct ClientPetMode
{
    uint64 PetGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32 PetMode;        ///< Offset 0x0008 Type _MJVTBL_UINT32
};

///< SMSG_DIFFERENT_INSTANCE_FROM_PARTY
struct ClientDifferentInstanceFromParty
{
};

///< SMSG_UPDATE_SERVER_PLAYER_POSITION
struct ClientUpdateServerPlayerPosition
{
    G3D::Vector3 Position;            ///< Offset 0x0000 Type _MJVTBL_V3
};

///< SMSG_ROLE_CHANGED_INFORM
struct ClientRoleChangedInform
{
    uint64 ChangedUnit;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 From;               ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint32 NewRole;            ///< Offset 0x0010 Type _MJVTBL_UINT32
    uint32 OldRole;            ///< Offset 0x0014 Type _MJVTBL_UINT32
    uint8  PartyIndex;         ///< Offset 0x0018 Type _MJVTBL_UINT8
};

///< SMSG_ROLE_POLL_INFORM
struct ClientRolePollInform
{
    uint64 From;              ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint8  PartyIndex;        ///< Offset 0x0008 Type _MJVTBL_UINT8
};

///< SMSG_SUMMON_RAID_MEMBER_VALIDATE_FAILED
struct ClientSummonRaidMemberValidateFailed
{
    struct ClientSummonRaidMemberValidateReason
    {
        uint64 Member;            ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32  ReasonCode;        ///< Offset 0x0008 Type _MJVTBL_INT32
    };

    std::vector<ClientSummonRaidMemberValidateReason> Members;                                                  ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ClientSummonRaidMemberValidateReason>::MJVTBL
};

///< SMSG_BATTLEFIELD_STATUS_NEED_CONFIRMATION
struct ClientBattlefieldStatus_NeedConfirmation
{
    struct Hdr_Struct
    {
        struct Ticket_Struct
        {
            uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
            uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
            uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
            uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
        };

        Ticket_Struct Ticket;                 ///< Offset 0x0000 Type _MJVTBL_STRUCT
        uint64        QueueID;                ///< Offset 0x0018 Type _MJVTBL_UINT64
        uint8         RangeMin;               ///< Offset 0x0020 Type _MJVTBL_UINT8
        uint8         RangeMax;               ///< Offset 0x0021 Type _MJVTBL_UINT8
        uint8         TeamSize;               ///< Offset 0x0022 Type _MJVTBL_UINT8
        uint32        InstanceID;             ///< Offset 0x0024 Type _MJVTBL_UINT32
        bool          RegisteredMatch;        ///< Offset 0x0028 Type _MJVTBL_BOOL
        bool          TournamentRules;        ///< Offset 0x0029 Type _MJVTBL_BOOL
    };

    uint32     Timeout;           ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32     Mapid;             ///< Offset 0x0004 Type _MJVTBL_UINT32
    Hdr_Struct Hdr;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
    uint8      Role;              ///< Offset 0x0038 Type _MJVTBL_UINT8
};

///< SMSG_BATTLEFIELD_STATUS_ACTIVE
struct ClientBattlefieldStatus_Active
{
    struct Hdr_Struct
    {
        struct Ticket_Struct
        {
            uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
            uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
            uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
            uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
        };

        Ticket_Struct Ticket;                 ///< Offset 0x0000 Type _MJVTBL_STRUCT
        uint64        QueueID;                ///< Offset 0x0018 Type _MJVTBL_UINT64
        uint8         RangeMin;               ///< Offset 0x0020 Type _MJVTBL_UINT8
        uint8         RangeMax;               ///< Offset 0x0021 Type _MJVTBL_UINT8
        uint8         TeamSize;               ///< Offset 0x0022 Type _MJVTBL_UINT8
        uint32        InstanceID;             ///< Offset 0x0024 Type _MJVTBL_UINT32
        bool          RegisteredMatch;        ///< Offset 0x0028 Type _MJVTBL_BOOL
        bool          TournamentRules;        ///< Offset 0x0029 Type _MJVTBL_BOOL
    };

    Hdr_Struct Hdr;                  ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint32     ShutdownTimer;        ///< Offset 0x0030 Type _MJVTBL_UINT32
    uint8      ArenaFaction;         ///< Offset 0x0034 Type _MJVTBL_UINT8
    bool       LeftEarly;            ///< Offset 0x0035 Type _MJVTBL_BOOL
    uint32     StartTimer;           ///< Offset 0x0038 Type _MJVTBL_UINT32
    uint32     Mapid;                ///< Offset 0x003C Type _MJVTBL_UINT32
};

///< SMSG_BATTLEFIELD_STATUS_QUEUED
struct ClientBattlefieldStatus_Queued
{
    struct Hdr_Struct
    {
        struct Ticket_Struct
        {
            uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
            uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
            uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
            uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
        };

        Ticket_Struct Ticket;                 ///< Offset 0x0000 Type _MJVTBL_STRUCT
        uint64        QueueID;                ///< Offset 0x0018 Type _MJVTBL_UINT64
        uint8         RangeMin;               ///< Offset 0x0020 Type _MJVTBL_UINT8
        uint8         RangeMax;               ///< Offset 0x0021 Type _MJVTBL_UINT8
        uint8         TeamSize;               ///< Offset 0x0022 Type _MJVTBL_UINT8
        uint32        InstanceID;             ///< Offset 0x0024 Type _MJVTBL_UINT32
        bool          RegisteredMatch;        ///< Offset 0x0028 Type _MJVTBL_BOOL
        bool          TournamentRules;        ///< Offset 0x0029 Type _MJVTBL_BOOL
    };

    uint32     AverageWaitTime;               ///< Offset 0x0000 Type _MJVTBL_UINT32
    Hdr_Struct Hdr;                           ///< Offset 0x0008 Type _MJVTBL_STRUCT
    bool       AsGroup;                       ///< Offset 0x0038 Type _MJVTBL_BOOL
    bool       SuspendedQueue;                ///< Offset 0x0039 Type _MJVTBL_BOOL
    bool       EligibleForMatchmaking;        ///< Offset 0x003A Type _MJVTBL_BOOL
    uint32     WaitTime;                      ///< Offset 0x003C Type _MJVTBL_UINT32
};

///< SMSG_BATTLEFIELD_STATUS_NONE
struct ClientBattlefieldStatus_None
{
    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    Ticket_Struct Ticket;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_BATTLEFIELD_STATUS_FAILED
struct ClientBattlefieldStatus_Failed
{
    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    uint64        QueueID;              ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64        ClientID;             ///< Offset 0x0008 Type _MJVTBL_UINT64
    int32         Reason;               ///< Offset 0x0010 Type _MJVTBL_INT32
    Ticket_Struct Ticket;               ///< Offset 0x0018 Type _MJVTBL_STRUCT
};

///< SMSG_BATTLEFIELD_LIST
struct ClientBattlefieldList
{
    uint8              MaxLevel;                  ///< Offset 0x0000 Type _MJVTBL_UINT8
    bool               PvpAnywhere;               ///< Offset 0x0001 Type _MJVTBL_BOOL
    uint64             BattlemasterGuid;          ///< Offset 0x0008 Type _MJVTBL_UINT64
    bool               IsRandomBG;                ///< Offset 0x0010 Type _MJVTBL_BOOL
    uint8              MinLevel;                  ///< Offset 0x0011 Type _MJVTBL_UINT8
    bool               HasHolidayWinToday;        ///< Offset 0x0012 Type _MJVTBL_BOOL
    int32              BattlemasterListID;        ///< Offset 0x0014 Type _MJVTBL_INT32
    bool               HasRandomWinToday;         ///< Offset 0x0018 Type _MJVTBL_BOOL
    std::vector<int32> Battlefields;              ///< Offset 0x0020 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_BATTLEGROUND_PLAYER_POSITIONS
struct ClientBattlegroundPlayerPositions
{
    struct BattlegroundPlayerPosition
    {
        uint64       Guid;                ///< Offset 0x0000 Type _MJVTBL_UINT64
        G3D::Vector2 Pos;                 ///< Offset 0x0008 Type _MJVTBL_V2
        int8         IconID;              ///< Offset 0x0010 Type _MJVTBL_INT8
        int8         ArenaSlot;           ///< Offset 0x0011 Type _MJVTBL_INT8
    };

    std::vector<BattlegroundPlayerPosition> FlagCarriers;                                   ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<BattlegroundPlayerPosition>::MJVTBL
};

///< SMSG_UPDATE_CAPTURE_POINT
struct ClientUpdateCapturePoint
{
    struct CapturePointInfo_Struct
    {
        uint64       Guid;                        ///< Offset 0x0000 Type _MJVTBL_UINT64
        G3D::Vector2 Pos;                         ///< Offset 0x0008 Type _MJVTBL_V2
        int8         State;                       ///< Offset 0x0010 Type _MJVTBL_INT8
        uint32       CaptureTime;                 ///< Offset 0x0018 Type _MJVTBL_TIME_T
        uint32       CaptureTotalDuration;        ///< Offset 0x0020 Type _MJVTBL_UINT32
    };

    CapturePointInfo_Struct CapturePointInfo;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_CAPTURE_POINT_REMOVED
struct ClientCapturePointRemoved
{
    uint64 CapturePointGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_BATTLEGROUND_PLAYER_JOINED
struct ClientBattlegroundPlayerJoined
{
    uint64 Guid;          ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_BATTLEGROUND_PLAYER_LEFT
struct ClientBattlegroundPlayerLeft
{
    uint64 Guid;          ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_BATTLEFIELD_PORT_DENIED
struct ClientBattlefieldPortDenied
{
};

///< SMSG_BFMGR_ENTRY_INVITE
struct ClientBFMgrEntryInvite
{
    int32  AreaID;            ///< Offset 0x0000 Type _MJVTBL_INT32
    uint32 ExpireTime;        ///< Offset 0x0008 Type _MJVTBL_TIME_T
    uint64 QueueID;           ///< Offset 0x0010 Type _MJVTBL_UINT64
};

///< SMSG_BFMGR_ENTERING
struct ClientBFMgrEntering
{
    bool   Relocated;         ///< Offset 0x0000 Type _MJVTBL_BOOL
    bool   ClearedAFK;        ///< Offset 0x0001 Type _MJVTBL_BOOL
    bool   OnOffense;         ///< Offset 0x0002 Type _MJVTBL_BOOL
    uint64 QueueID;           ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_BFMGR_QUEUE_REQUEST_RESPONSE
struct ClientBFMgrQueueRequestResponse
{
    int8   Result;                  ///< Offset 0x0000 Type _MJVTBL_INT8
    int8   BattleState;             ///< Offset 0x0001 Type _MJVTBL_INT8
    uint64 FailedPlayerGUID;        ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint64 QueueID;                 ///< Offset 0x0010 Type _MJVTBL_UINT64
    bool   LoggingIn;               ///< Offset 0x0018 Type _MJVTBL_BOOL
    int32  AreaID;                  ///< Offset 0x001C Type _MJVTBL_INT32
};

///< SMSG_BFMGR_EJECT_PENDING
struct ClientBFMgrEjectPending
{
    uint64 QueueID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    bool   Remote;         ///< Offset 0x0008 Type _MJVTBL_BOOL
};

///< SMSG_BFMGR_EJECTED
struct ClientBFMgrEjected
{
    uint64 QueueID;            ///< Offset 0x0000 Type _MJVTBL_UINT64
    bool   Relocated;          ///< Offset 0x0008 Type _MJVTBL_BOOL
    int8   Reason;             ///< Offset 0x0009 Type _MJVTBL_INT8
    int8   BattleState;        ///< Offset 0x000A Type _MJVTBL_INT8
};

///< SMSG_BFMGR_QUEUE_INVITE
struct ClientBFMgrQueueInvite
{
    uint64 QueueID;            ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32 InstanceID;         ///< Offset 0x0008 Type _MJVTBL_UINT32
    uint32 Timeout;            ///< Offset 0x000C Type _MJVTBL_UINT32
    int32  MapID;              ///< Offset 0x0010 Type _MJVTBL_INT32
    int32  MaxLevel;           ///< Offset 0x0014 Type _MJVTBL_INT32
    int32  MinLevel;           ///< Offset 0x0018 Type _MJVTBL_INT32
    int8   BattleState;        ///< Offset 0x001C Type _MJVTBL_INT8
    int8   Index;              ///< Offset 0x001D Type _MJVTBL_INT8
};

///< SMSG_BFMGR_EXIT_REQUEST
struct ClientBFMgrExitRequest
{
};

///< SMSG_BFMGR_STATE_CHANGED
struct ClientBFMgrStateChanged
{
    uint64 QueueID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32  State;          ///< Offset 0x0008 Type _MJVTBL_INT32
};

///< SMSG_BATTLEGROUND_INFO_THROTTLED
struct ClientBattlegroundInfoThrottled
{
};

///< SMSG_GROUP_ACTION_THROTTLED
struct ClientGroupActionThrottled
{
};

///< SMSG_REQUEST_CEMETERY_LIST_RESPONSE
struct ClientRequestCemeteryListResponse
{
    bool                IsGossipTriggered;          ///< Offset 0x0000 Type _MJVTBL_BOOL
    std::vector<uint32> CemeteryID;                 ///< Offset 0x0008 Type MakeMJVTblForArrayOf<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
};

///< SMSG_CHECK_WARGAME_ENTRY
struct ClientCheckWargameEntry
{
    uint64     QueueID;                           ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64     OpposingPartyBnetAccountID;        ///< Offset 0x0008 Type _MJVTBL_UINT64
    ServerSpec OpposingPartyUserServer;           ///< Offset 0x0010 Type _MJVTBL_JAMSERVERSPEC
    uint64     OpposingPartyMember;               ///< Offset 0x0020 Type _MJVTBL_UINT64
    uint32     TimeoutSeconds;                    ///< Offset 0x0028 Type _MJVTBL_TIME_T
    bool       TournamentRules;                   ///< Offset 0x0030 Type _MJVTBL_BOOL
};

///< SMSG_SHOW_RATINGS
struct ClientShowRatings
{
    int32 PersonalRating[6];        ///< Offset 0x0000 Type MakeMJVTblForFixedArrayOf<int,6,&(MJVTBL_INT32)>::MJVTBL
    float GdfRating[6];             ///< Offset 0x0018 Type MakeMJVTblForFixedArrayOf<float,6,&(MJVTBL_FLOAT)>::MJVTBL
    float GdfVariance[6];           ///< Offset 0x0030 Type MakeMJVTblForFixedArrayOf<float,6,&(MJVTBL_FLOAT)>::MJVTBL
};

///< SMSG_DBREPLY
struct ClientDBReply
{
    uint32  TableHash;        ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32  Timestamp;        ///< Offset 0x0004 Type _MJVTBL_UINT32
    int32   RecordID;         ///< Offset 0x0008 Type _MJVTBL_INT32
    uint8 * Data;             ///< Offset 0x0010 Type _MJVTBL_NOT_IMPLEMENTED
};

///< SMSG_HOTFIX_NOTIFY
struct ClientHotfixNotify
{
    uint32 TableHash;        ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32 Timestamp;        ///< Offset 0x0004 Type _MJVTBL_UINT32
    int32  RecordID;         ///< Offset 0x0008 Type _MJVTBL_INT32
};

///< SMSG_HOTFIX_NOTIFY_BLOB
struct ClientHotfixNotifyBlob
{
    struct HotfixNotify
    {
        uint32 TableHash;        ///< Offset 0x0000 Type _MJVTBL_UINT32
        int32  RecordID;         ///< Offset 0x0004 Type _MJVTBL_INT32
        uint32 Timestamp;        ///< Offset 0x0008 Type _MJVTBL_UINT32
    };

    std::vector<HotfixNotify> Hotfixes;                         ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<HotfixNotify>::MJVTBL
};

///< SMSG_BATTLEFIELD_STATUS_WAIT_FOR_GROUPS
struct ClientBattlefieldStatus_WaitForGroups
{
    struct Hdr_Struct
    {
        struct Ticket_Struct
        {
            uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
            uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
            uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
            uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
        };

        Ticket_Struct Ticket;                 ///< Offset 0x0000 Type _MJVTBL_STRUCT
        uint64        QueueID;                ///< Offset 0x0018 Type _MJVTBL_UINT64
        uint8         RangeMin;               ///< Offset 0x0020 Type _MJVTBL_UINT8
        uint8         RangeMax;               ///< Offset 0x0021 Type _MJVTBL_UINT8
        uint8         TeamSize;               ///< Offset 0x0022 Type _MJVTBL_UINT8
        uint32        InstanceID;             ///< Offset 0x0024 Type _MJVTBL_UINT32
        bool          RegisteredMatch;        ///< Offset 0x0028 Type _MJVTBL_BOOL
        bool          TournamentRules;        ///< Offset 0x0029 Type _MJVTBL_BOOL
    };

    uint32     Timeout;                   ///< Offset 0x0000 Type _MJVTBL_UINT32
    Hdr_Struct Hdr;                       ///< Offset 0x0008 Type _MJVTBL_STRUCT
    uint32     Mapid;                     ///< Offset 0x0038 Type _MJVTBL_UINT32
    uint8      TotalPlayers[2];           ///< Offset 0x003C Type MakeMJVTblForFixedArrayOf<unsignedchar,2,&(MJVTBL_UINT8)>::MJVTBL
    uint8      AwaitingPlayers[2];        ///< Offset 0x003E Type MakeMJVTblForFixedArrayOf<unsignedchar,2,&(MJVTBL_UINT8)>::MJVTBL
};

///< SMSG_RATED_BATTLEFIELD_INFO
struct ClientRatedBattlefieldInfo
{
    struct ClientBracketInfo
    {
        int32 PersonalRating;          ///< Offset 0x0000 Type _MJVTBL_INT32
        int32 Ranking;                 ///< Offset 0x0004 Type _MJVTBL_INT32
        int32 SeasonPlayed;            ///< Offset 0x0008 Type _MJVTBL_INT32
        int32 SeasonWon;               ///< Offset 0x000C Type _MJVTBL_INT32
        int32 WeeklyPlayed;            ///< Offset 0x0010 Type _MJVTBL_INT32
        int32 WeeklyWon;               ///< Offset 0x0014 Type _MJVTBL_INT32
        int32 BestWeeklyRating;        ///< Offset 0x0018 Type _MJVTBL_INT32
        int32 BestSeasonRating;        ///< Offset 0x001C Type _MJVTBL_INT32
    };

    ClientBracketInfo Bracket[6];               ///< Offset 0x0000 Type MakeMJVTblForFixedArrayOfStruct<ClientBracketInfo,6>::MJVTBL
};

///< SMSG_AVERAGE_ITEM_LEVEL_INFORM
struct ClientAverageItemLevelInform
{
    float AvgItemLevel;        ///< Offset 0x0000 Type _MJVTBL_FLOAT
};

///< SMSG_PET_ADDED
struct ClientPetAdded
{
    std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    int32       CreatureID;         ///< Offset 0x0084 Type _MJVTBL_INT32
    int32       Level;              ///< Offset 0x0088 Type _MJVTBL_INT32
    uint32      PetNumber;          ///< Offset 0x008C Type _MJVTBL_UINT32
    int32       DisplayID;          ///< Offset 0x0090 Type _MJVTBL_INT32
    uint8       Flags;              ///< Offset 0x0094 Type _MJVTBL_UINT8
    int32       PetSlot;            ///< Offset 0x0098 Type _MJVTBL_INT32
};

///< SMSG_PET_STABLE_LIST
struct ClientPetStableList
{
    struct ClientPetStableInfo
    {
        uint32      PetSlot;                ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32      PetNumber;              ///< Offset 0x0004 Type _MJVTBL_UINT32
        uint32      CreatureID;             ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32      DisplayID;              ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32      ExperienceLevel;        ///< Offset 0x0010 Type _MJVTBL_UINT32
        std::string PetName;                ///< Offset 0x0014 Type _MJVTBL_STRING
        uint8       PetFlags;               ///< Offset 0x0095 Type _MJVTBL_UINT8
    };

    std::vector<ClientPetStableInfo> Pets;                                    ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ClientPetStableInfo>::MJVTBL
    uint64                           StableMaster;                            ///< Offset 0x0018 Type _MJVTBL_UINT64
};

///< SMSG_PET_STABLE_RESULT
struct ClientPetStableResult
{
    uint8 Result;        ///< Offset 0x0000 Type _MJVTBL_UINT8
};

///< SMSG_NEW_WORLD
struct ClientNewWorld
{
    int32        MapID;               ///< Offset 0x0000 Type _MJVTBL_INT32
    uint32       Reason;              ///< Offset 0x0004 Type _MJVTBL_UINT32
    float        Facing;              ///< Offset 0x0008 Type _MJVTBL_FLOAT
    G3D::Vector3 Position;            ///< Offset 0x000C Type _MJVTBL_V3
};

///< SMSG_LOGIN_VERIFY_WORLD
struct ClientLoginVerifyWorld
{
    float        Facing;              ///< Offset 0x0000 Type _MJVTBL_FLOAT
    int32        MapID;               ///< Offset 0x0004 Type _MJVTBL_INT32
    uint32       Reason;              ///< Offset 0x0008 Type _MJVTBL_UINT32
    G3D::Vector3 Position;            ///< Offset 0x000C Type _MJVTBL_V3
};

///< SMSG_ABORT_NEW_WORLD
struct ClientAbortNewWorld
{
};

///< SMSG_NOTIFY_MONEY
struct ClientNotifyMoney
{
    uint64 Money;         ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_ITEM_PURCHASE_REFUND_RESULT
struct ClientItemPurchaseRefundResult
{
    struct ClientItemPurchaseContents
    {
        struct ClientItemPurchaseRefundItem
        {
            int32 ItemID;           ///< Offset 0x0000 Type _MJVTBL_INT32
            int32 ItemCount;        ///< Offset 0x0004 Type _MJVTBL_INT32
        };

        struct ClientItemPurchaseRefundCurrency
        {
            int32 CurrencyID;           ///< Offset 0x0000 Type _MJVTBL_INT32
            int32 CurrencyCount;        ///< Offset 0x0004 Type _MJVTBL_INT32
        };

        uint32                           Money;                                   ///< Offset 0x0000 Type _MJVTBL_UINT32
        ClientItemPurchaseRefundItem     Items[5];                                ///< Offset 0x0004 Type MakeMJVTblForFixedArrayOfStruct<ClientItemPurchaseRefundItem,5>::MJVTBL
        ClientItemPurchaseRefundCurrency Currencies[5];                           ///< Offset 0x002C Type MakeMJVTblForFixedArrayOfStruct<ClientItemPurchaseRefundCurrency,5>::MJVTBL
    };

    uint8                                Result;                                      ///< Offset 0x0000 Type _MJVTBL_UINT8
    uint64                               ItemGUID;                                    ///< Offset 0x0008 Type _MJVTBL_UINT64
    Optional<ClientItemPurchaseContents> Contents;                                    ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<ClientItemPurchaseContents>::MJVTBL
};

///< SMSG_SET_ITEM_PURCHASE_DATA
struct ClientSetItemPurchaseData
{
    struct Contents_Struct
    {
        struct ClientItemPurchaseRefundItem
        {
            int32 ItemID;           ///< Offset 0x0000 Type _MJVTBL_INT32
            int32 ItemCount;        ///< Offset 0x0004 Type _MJVTBL_INT32
        };

        struct ClientItemPurchaseRefundCurrency
        {
            int32 CurrencyID;           ///< Offset 0x0000 Type _MJVTBL_INT32
            int32 CurrencyCount;        ///< Offset 0x0004 Type _MJVTBL_INT32
        };

        uint32                           Money;                                   ///< Offset 0x0000 Type _MJVTBL_UINT32
        ClientItemPurchaseRefundItem     Items[5];                                ///< Offset 0x0004 Type MakeMJVTblForFixedArrayOfStruct<ClientItemPurchaseRefundItem,5>::MJVTBL
        ClientItemPurchaseRefundCurrency Currencies[5];                           ///< Offset 0x002C Type MakeMJVTblForFixedArrayOfStruct<ClientItemPurchaseRefundCurrency,5>::MJVTBL
    };

    uint32          PurchaseTime;           ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32          Flags;                  ///< Offset 0x0004 Type _MJVTBL_UINT32
    Contents_Struct Contents;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
    uint64          ItemGUID;               ///< Offset 0x0060 Type _MJVTBL_UINT64
};

///< SMSG_ITEM_EXPIRE_PURCHASE_REFUND
struct ClientItemExpirePurchaseRefund
{
    uint64 ItemGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_INSPECT_HONOR_STATS
struct ClientInspectHonorStats
{
    uint64 PlayerGUID;             ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32 LifetimeHK;             ///< Offset 0x0008 Type _MJVTBL_UINT32
    uint16 YesterdayHK;            ///< Offset 0x000C Type _MJVTBL_UINT16
    uint16 TodayHK;                ///< Offset 0x000E Type _MJVTBL_UINT16
    uint8  LifetimeMaxRank;        ///< Offset 0x0010 Type _MJVTBL_UINT8
};

///< SMSG_PVPLOG_DATA
struct ClientPVPLogData
{
    struct ClientPVPLogData_Player
    {
        struct ClientPVPLogData_Honor
        {
            uint32 HonorKills;                ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint32 Deaths;                    ///< Offset 0x0004 Type _MJVTBL_UINT32
            uint32 ContributionPoints;        ///< Offset 0x0008 Type _MJVTBL_UINT32
        };

        uint64                           PlayerGUID;                              ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32                           Kills;                                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8                            Faction;                                 ///< Offset 0x000C Type _MJVTBL_UINT8
        bool                             IsInWorld;                               ///< Offset 0x000D Type _MJVTBL_BOOL
        Optional<ClientPVPLogData_Honor> Honor;                                   ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<ClientPVPLogData_Honor>::MJVTBL
        uint32                           DamageDone;                              ///< Offset 0x0020 Type _MJVTBL_UINT32
        uint32                           HealingDone;                             ///< Offset 0x0024 Type _MJVTBL_UINT32
        Optional<uint32>                 PreMatchRating;                          ///< Offset 0x0028 Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
        Optional<int32>                  RatingChange;                            ///< Offset 0x0030 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
        Optional<uint32>                 PreMatchMMR;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
        Optional<int32>                  MmrChange;                               ///< Offset 0x0040 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
        std::vector<int32>               Stats;                                   ///< Offset 0x0048 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
        int32                            PrimaryTalentTree;                       ///< Offset 0x0060 Type _MJVTBL_INT32
    };

    struct ClientPVPLogData_RatingData
    {
        int32 Prematch[2];           ///< Offset 0x0000 Type MakeMJVTblForFixedArrayOf<int,2,&(MJVTBL_INT32)>::MJVTBL
        int32 Postmatch[2];          ///< Offset 0x0008 Type MakeMJVTblForFixedArrayOf<int,2,&(MJVTBL_INT32)>::MJVTBL
        int32 PrematchMMR[2];        ///< Offset 0x0010 Type MakeMJVTblForFixedArrayOf<int,2,&(MJVTBL_INT32)>::MJVTBL
    };

    Optional<uint8>                       Winner;                                       ///< Offset 0x0000 Type MakeMJVTblForOptional<unsignedchar,&(MJVTBL_UINT8)>::MJVTBL
    std::vector<ClientPVPLogData_Player>  Players;                                      ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<ClientPVPLogData_Player>::MJVTBL
    Optional<ClientPVPLogData_RatingData> Ratings;                                      ///< Offset 0x0020 Type MakeMJVTblForOptionalStruct<ClientPVPLogData_RatingData>::MJVTBL
    int8                                  PlayerCount[2];                               ///< Offset 0x003C Type MakeMJVTblForFixedArrayOf<signedchar,2,&(MJVTBL_INT8)>::MJVTBL
};

///< SMSG_WARGAME_REQUEST_SUCCESSFULLY_SENT_TO_OPPONENT
struct ClientWargameRequestSuccessfullySentToOpponent
{
    uint64 Opponent;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_DISPLAY_GAME_ERROR
struct ClientDisplayGameError
{
    Optional<int32> Arg2;                   ///< Offset 0x0000 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
    Optional<int32> Arg;                    ///< Offset 0x0008 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
    uint32          Error;                  ///< Offset 0x0010 Type _MJVTBL_UINT32
};

///< SMSG_PVPOPTIONS_ENABLED
struct ClientPVPOptionsEnabled
{
    bool WargameArenas;               ///< Offset 0x0000 Type _MJVTBL_BOOL
    bool RatedArenas;                 ///< Offset 0x0001 Type _MJVTBL_BOOL
    bool WargameBattlegrounds;        ///< Offset 0x0002 Type _MJVTBL_BOOL
    bool ArenaSkirmish;               ///< Offset 0x0003 Type _MJVTBL_BOOL
    bool PugBattlegrounds;            ///< Offset 0x0004 Type _MJVTBL_BOOL
    bool RatedBattlegrounds;          ///< Offset 0x0005 Type _MJVTBL_BOOL
};

///< SMSG_SET_MAX_WEEKLY_QUANTITY
struct ClientSetMaxWeeklyQuantity
{
    int32 MaxWeeklyQuantity;        ///< Offset 0x0000 Type _MJVTBL_INT32
    int32 Type;                     ///< Offset 0x0004 Type _MJVTBL_INT32
};

///< SMSG_PETITION_ALREADY_SIGNED
struct ClientPetitionAlreadySigned
{
    uint64 SignerGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_RAID_MARKERS_CHANGED
struct ClientRaidMarkersChanged
{
    struct JamCliRaidMarkerData
    {
        uint64       TransportGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32        MapID;                ///< Offset 0x0008 Type _MJVTBL_INT32
        G3D::Vector3 Position;             ///< Offset 0x000C Type _MJVTBL_V3
    };

    uint32                            ActiveMarkers;                            ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint8                             PartyIndex;                               ///< Offset 0x0004 Type _MJVTBL_UINT8
    std::vector<JamCliRaidMarkerData> MarkerData;                               ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamCliRaidMarkerData>::MJVTBL
};

///< SMSG_STREAMING_MOVIES
struct ClientStreamingMovies
{
    std::vector<uint16> MovieIDs;                   ///< Offset 0x0000 Type MakeMJVTblForArrayOf<unsignedshort,&(MJVTBL_UINT16)>::MJVTBL
};

///< SMSG_TIME_SYNC_REQUEST
struct ClientTimeSyncRequest
{
    uint32 SequenceIndex;        ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_TIME_ADJUSTMENT
struct ClientTimeAdjustment
{
    uint32 SequenceIndex;        ///< Offset 0x0000 Type _MJVTBL_UINT32
    float  TimeScale;            ///< Offset 0x0004 Type _MJVTBL_FLOAT
};

///< SMSG_START_TIMER
struct ClientStartTimer
{
    uint32 TimeRemaining;        ///< Offset 0x0000 Type _MJVTBL_TIME_T
    uint32 TotalTime;            ///< Offset 0x0008 Type _MJVTBL_TIME_T
    int32  Type;                 ///< Offset 0x0010 Type _MJVTBL_INT32
};

///< SMSG_DISENCHANT_CREDIT
struct ClientDisenchantCredit
{
    struct Item_Struct
    {
        struct JamItemBonusInstanceData
        {
            struct Context_Struct
            {
                uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
            };

            struct Bonuses_Struct
            {
                std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
            };

            Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
            Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
        };

        int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
        int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
        int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
        Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
        Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
    };

    uint64      Disenchanter;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    Item_Struct Item;                ///< Offset 0x0008 Type _MJVTBL_STRUCT
};

///< SMSG_SUSPEND_TOKEN
struct ClientSuspendToken
{
    CLIENT_SUSPEND_REASON Reason;                       ///< Offset 0x0000 Type _MJVTBL_CLIENT_SUSPEND_REASON
    uint32                Sequence;                     ///< Offset 0x0004 Type _MJVTBL_UINT32
};

///< SMSG_RESUME_TOKEN
struct ClientResumeToken
{
    uint32                Sequence;                     ///< Offset 0x0000 Type _MJVTBL_UINT32
    CLIENT_SUSPEND_REASON Reason;                       ///< Offset 0x0004 Type _MJVTBL_CLIENT_SUSPEND_REASON
};

///< SMSG_CANCEL_SPELL_VISUAL
struct ClientCancelSpellVisual
{
    uint64 Source;               ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32  SpellVisualID;        ///< Offset 0x0008 Type _MJVTBL_INT32
};

///< SMSG_PLAY_SPELL_VISUAL
struct ClientPlaySpellVisual
{
    uint64       Source;                ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64       Target;                ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint16       MissReason;            ///< Offset 0x0010 Type _MJVTBL_UINT16
    int32        SpellVisualID;         ///< Offset 0x0014 Type _MJVTBL_INT32
    bool         SpeedAsTime;           ///< Offset 0x0018 Type _MJVTBL_BOOL
    uint16       ReflectStatus;         ///< Offset 0x001A Type _MJVTBL_UINT16
    float        TravelSpeed;           ///< Offset 0x001C Type _MJVTBL_FLOAT
    G3D::Vector3 TargetPosition;        ///< Offset 0x0020 Type _MJVTBL_V3
};

///< SMSG_CANCEL_ORPHAN_SPELL_VISUAL
struct ClientCancelOrphanSpellVisual
{
    int32 SpellVisualID;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_PLAY_ORPHAN_SPELL_VISUAL
struct ClientPlayOrphanSpellVisual
{
    uint64       Target;                   ///< Offset 0x0000 Type _MJVTBL_UINT64
    G3D::Vector3 SourceLocation;           ///< Offset 0x0008 Type _MJVTBL_V3
    int32        SpellVisualID;            ///< Offset 0x0014 Type _MJVTBL_INT32
    bool         SpeedAsTime;              ///< Offset 0x0018 Type _MJVTBL_BOOL
    float        TravelSpeed;              ///< Offset 0x001C Type _MJVTBL_FLOAT
    G3D::Vector3 SourceOrientation;        ///< Offset 0x0020 Type _MJVTBL_V3
    G3D::Vector3 TargetLocation;           ///< Offset 0x002C Type _MJVTBL_V3
};

///< SMSG_CANCEL_SPELL_VISUAL_KIT
struct ClientCancelSpellVisualKit
{
    uint64 Source;                  ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32  SpellVisualKitID;        ///< Offset 0x0008 Type _MJVTBL_INT32
};

///< SMSG_PLAY_SPELL_VISUAL_KIT
struct ClientPlaySpellVisualKit
{
    uint64 Unit;            ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32  KitType;         ///< Offset 0x0008 Type _MJVTBL_INT32
    uint32 Duration;        ///< Offset 0x000C Type _MJVTBL_UINT32
    int32  KitRecID;        ///< Offset 0x0010 Type _MJVTBL_INT32
};

///< SMSG_GAME_OBJECT_PLAY_SPELL_VISUAL_KIT
struct ClientGameObjectPlaySpellVisualKit
{
    uint64 Object;          ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32  KitRecID;        ///< Offset 0x0008 Type _MJVTBL_INT32
    int32  KitType;         ///< Offset 0x000C Type _MJVTBL_INT32
    uint32 Duration;        ///< Offset 0x0010 Type _MJVTBL_UINT32
};

///< SMSG_ADD_ITEM_PASSIVE
struct ClientAddItemPassive
{
    int32 SpellID;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_REMOVE_ITEM_PASSIVE
struct ClientRemoveItemPassive
{
    int32 SpellID;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_SEND_ITEM_PASSIVES
struct ClientSendItemPassives
{
    std::vector<int32> SpellID;                   ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_WORLD_SERVER_INFO
struct ClientWorldServerInfo
{
    Optional<uint32> IneligibleForLootMask;            ///< Offset 0x0000 Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
    uint32           WeeklyReset;                      ///< Offset 0x0008 Type _MJVTBL_TIME_T
    Optional<uint32> InstanceGroupSize;                ///< Offset 0x0010 Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
    uint8            IsTournamentRealm;                ///< Offset 0x0018 Type _MJVTBL_UINT8
    Optional<uint32> RestrictedAccountMaxLevel;        ///< Offset 0x001C Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
    Optional<uint32> RestrictedAccountMaxMoney;        ///< Offset 0x0024 Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
    uint32           DifficultyID;                     ///< Offset 0x002C Type _MJVTBL_UINT32
};

///< SMSG_ACCOUNT_MOUNT_UPDATE
struct ClientAccountMountUpdate
{
    std::vector<int32> MountSpellIDs;             ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
    std::vector<bool>  MountIsFavorite;           ///< Offset 0x0018 Type MakeMJVTblForArrayOf<bool,&(MJVTBL_BOOL)>::MJVTBL
    bool               IsFullUpdate;              ///< Offset 0x0030 Type _MJVTBL_BOOL
};

///< SMSG_LAST_WEEKLY_RESET
struct ClientLastWeeklyReset
{
    uint32 Reset;         ///< Offset 0x0000 Type _MJVTBL_TIME_T
};

///< SMSG_RUNE_REGEN_DEBUG
struct ClientRuneRegenDebug
{
    uint32 Time;                ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32 Interval;            ///< Offset 0x0004 Type _MJVTBL_UINT32
    int32  RuneStart[6];        ///< Offset 0x0008 Type MakeMJVTblForFixedArrayOf<int,6,&(MJVTBL_INT32)>::MJVTBL
    int32  RuneEnd[6];          ///< Offset 0x0020 Type MakeMJVTblForFixedArrayOf<int,6,&(MJVTBL_INT32)>::MJVTBL
    float  RegenRate[4];        ///< Offset 0x0038 Type MakeMJVTblForFixedArrayOf<float,4,&(MJVTBL_FLOAT)>::MJVTBL
};

///< SMSG_GMACCOUNT_ONLINE_RESPONSE
struct ClientGMAccountOnlineResponse
{
    uint64 PlayerGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32 AccountID;         ///< Offset 0x0008 Type _MJVTBL_UINT32
};

///< SMSG_VENDOR_INVENTORY
struct ClientVendorInventory
{
    struct JamCliVendorItem
    {
        struct Item_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        uint32      M_muid;                         ///< Offset 0x0000 Type _MJVTBL_UINT32
        int32       M_type;                         ///< Offset 0x0004 Type _MJVTBL_INT32
        Item_Struct Item;                           ///< Offset 0x0008 Type _MJVTBL_STRUCT
        int32       M_quantity;                     ///< Offset 0x0068 Type _MJVTBL_INT32
        int32       M_price;                        ///< Offset 0x006C Type _MJVTBL_INT32
        int32       M_durability;                   ///< Offset 0x0070 Type _MJVTBL_INT32
        int32       M_stackCount;                   ///< Offset 0x0074 Type _MJVTBL_INT32
        int32       M_extendedCostID;               ///< Offset 0x0078 Type _MJVTBL_INT32
        int32       M_playerConditionFailed;        ///< Offset 0x007C Type _MJVTBL_INT32
        bool        M_doNotFilterOnVendor;          ///< Offset 0x0080 Type _MJVTBL_BOOL
    };

    uint8                         Reason;                               ///< Offset 0x0000 Type _MJVTBL_UINT8
    std::vector<JamCliVendorItem> Items;                                ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamCliVendorItem>::MJVTBL
    uint64                        Vendor;                               ///< Offset 0x0020 Type _MJVTBL_UINT64
};

///< SMSG_RESTRICTED_ACCOUNT_WARNING
struct ClientRestrictedAccountWarning
{
    uint32 Arg;           ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint8  Type;          ///< Offset 0x0004 Type _MJVTBL_UINT8
};

///< SMSG_SET_PLAY_HOVER_ANIM
struct ClientSetPlayHoverAnim
{
    uint64 UnitGUID;             ///< Offset 0x0000 Type _MJVTBL_UINT64
    bool   PlayHoverAnim;        ///< Offset 0x0008 Type _MJVTBL_BOOL
};

///< SMSG_CLEAR_BOSS_EMOTES
struct ClientClearBossEmotes
{
};

///< SMSG_LOAD_CUFPROFILES
struct ClientLoadCUFProfiles
{
    struct JamCliCUFProfile
    {
        std::string Name;                                 ///< Offset 0x0000 Type _MJVTBL_STRING
        uint16      FrameHeight;                          ///< Offset 0x0080 Type _MJVTBL_UINT16
        uint16      FrameWidth;                           ///< Offset 0x0082 Type _MJVTBL_UINT16
        uint8       SortBy;                               ///< Offset 0x0084 Type _MJVTBL_UINT8
        uint8       HealthText;                           ///< Offset 0x0085 Type _MJVTBL_UINT8
        bool        KeepGroupsTogether;                   ///< Offset 0x0086 Type _MJVTBL_BOOL
        bool        DisplayPets;                          ///< Offset 0x0087 Type _MJVTBL_BOOL
        bool        DisplayMainTankAndAssist;             ///< Offset 0x0088 Type _MJVTBL_BOOL
        bool        DisplayHealPrediction;                ///< Offset 0x0089 Type _MJVTBL_BOOL
        bool        DisplayAggroHighlight;                ///< Offset 0x008A Type _MJVTBL_BOOL
        bool        DisplayOnlyDispellableDebuffs;        ///< Offset 0x008B Type _MJVTBL_BOOL
        bool        DisplayPowerBar;                      ///< Offset 0x008C Type _MJVTBL_BOOL
        bool        DisplayBorder;                        ///< Offset 0x008D Type _MJVTBL_BOOL
        bool        UseClassColors;                       ///< Offset 0x008E Type _MJVTBL_BOOL
        bool        HorizontalGroups;                     ///< Offset 0x008F Type _MJVTBL_BOOL
        bool        DisplayNonBossDebuffs;                ///< Offset 0x0090 Type _MJVTBL_BOOL
        bool        DynamicPosition;                      ///< Offset 0x0091 Type _MJVTBL_BOOL
        uint8       TopPoint;                             ///< Offset 0x0092 Type _MJVTBL_UINT8
        uint8       BottomPoint;                          ///< Offset 0x0093 Type _MJVTBL_UINT8
        uint8       LeftPoint;                            ///< Offset 0x0094 Type _MJVTBL_UINT8
        uint16      TopOffset;                            ///< Offset 0x0096 Type _MJVTBL_UINT16
        uint16      BottomOffset;                         ///< Offset 0x0098 Type _MJVTBL_UINT16
        uint16      LeftOffset;                           ///< Offset 0x009A Type _MJVTBL_UINT16
        bool        Locked;                               ///< Offset 0x009C Type _MJVTBL_BOOL
        bool        Shown;                                ///< Offset 0x009D Type _MJVTBL_BOOL
        bool        AutoActivate2Players;                 ///< Offset 0x009E Type _MJVTBL_BOOL
        bool        AutoActivate3Players;                 ///< Offset 0x009F Type _MJVTBL_BOOL
        bool        AutoActivate5Players;                 ///< Offset 0x00A0 Type _MJVTBL_BOOL
        bool        AutoActivate10Players;                ///< Offset 0x00A1 Type _MJVTBL_BOOL
        bool        AutoActivate15Players;                ///< Offset 0x00A2 Type _MJVTBL_BOOL
        bool        AutoActivate25Players;                ///< Offset 0x00A3 Type _MJVTBL_BOOL
        bool        AutoActivate40Players;                ///< Offset 0x00A4 Type _MJVTBL_BOOL
        bool        AutoActivateSpec1;                    ///< Offset 0x00A5 Type _MJVTBL_BOOL
        bool        AutoActivateSpec2;                    ///< Offset 0x00A6 Type _MJVTBL_BOOL
        bool        AutoActivatePvP;                      ///< Offset 0x00A7 Type _MJVTBL_BOOL
        bool        AutoActivatePvE;                      ///< Offset 0x00A8 Type _MJVTBL_BOOL
    };

    std::vector<JamCliCUFProfile> Profiles;                             ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamCliCUFProfile>::MJVTBL
};

///< SMSG_SUPPRESS_NPCGREETINGS
struct ClientSuppressNPCGreetings
{
    bool   SuppressNPCGreetings;        ///< Offset 0x0000 Type _MJVTBL_BOOL
    uint64 UnitGUID;                    ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_DESTROY_OBJECT
struct ClientDestroyObject
{
    bool   IsDead;        ///< Offset 0x0000 Type _MJVTBL_BOOL
    uint64 Guid;          ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_PARTY_INVITE
struct ClientPartyInvite
{
    bool                AllowMultipleRoles;          ///< Offset 0x0000 Type _MJVTBL_BOOL
    uint32              InviterCfgRealmID;           ///< Offset 0x0004 Type _MJVTBL_UINT32
    bool                MightCRZYou;                 ///< Offset 0x0008 Type _MJVTBL_BOOL
    bool                CanAccept;                   ///< Offset 0x0009 Type _MJVTBL_BOOL
    uint64              InviterGuid;                 ///< Offset 0x0010 Type _MJVTBL_UINT64
    bool                MustBeBNetFriend;            ///< Offset 0x0018 Type _MJVTBL_BOOL
    uint32              LfgCompletedMask;            ///< Offset 0x001C Type _MJVTBL_UINT32
    uint32              ProposedRoles;               ///< Offset 0x0020 Type _MJVTBL_UINT32
    std::vector<uint32> LfgSlots;                    ///< Offset 0x0028 Type MakeMJVTblForArrayOf<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
    bool                IsXRealm;                    ///< Offset 0x0040 Type _MJVTBL_BOOL
    std::string         InviterRealmName;            ///< Offset 0x0041 Type _MJVTBL_STRING
    std::string         InviterName;                 ///< Offset 0x0142 Type _MJVTBL_STRING
    uint64              InviterBNetAccountID;        ///< Offset 0x0178 Type _MJVTBL_UINT64
};

///< SMSG_DUMP_RIDE_TICKETS_RESPONSE
struct ClientDumpRideTicketsResponse
{
    struct ClientDumpRideTicket
    {
        std::string Description;        ///< Offset 0x0000 Type _MJVTBL_STRING
    };

    std::vector<ClientDumpRideTicket> Ticket;                                   ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ClientDumpRideTicket>::MJVTBL
};

///< SMSG_FEATURE_SYSTEM_STATUS
struct ClientFeatureSystemStatus
{
    struct JamClientSessionAlertConfig
    {
        int32 Delay;              ///< Offset 0x0000 Type _MJVTBL_INT32
        int32 Period;             ///< Offset 0x0004 Type _MJVTBL_INT32
        int32 DisplayTime;        ///< Offset 0x0008 Type _MJVTBL_INT32
    };

    struct JamCliEuropaTicketConfig
    {
        struct ThrottleState_Struct
        {
            uint32 MaxTries;                      ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint32 PerMilliseconds;               ///< Offset 0x0004 Type _MJVTBL_UINT32
            uint32 TryCount;                      ///< Offset 0x0008 Type _MJVTBL_UINT32
            uint32 LastResetTimeBeforeNow;        ///< Offset 0x000C Type _MJVTBL_UINT32
        };

        ThrottleState_Struct ThrottleState;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
    };

    bool                                  VoiceEnabled;                                 ///< Offset 0x0000 Type _MJVTBL_BOOL
    bool                                  BrowserEnabled;                               ///< Offset 0x0001 Type _MJVTBL_BOOL
    bool                                  BpayStoreAvailable;                           ///< Offset 0x0002 Type _MJVTBL_BOOL
    bool                                  RecruitAFriendSendingEnabled;                 ///< Offset 0x0003 Type _MJVTBL_BOOL
    bool                                  BpayStoreEnabled;                             ///< Offset 0x0004 Type _MJVTBL_BOOL
    Optional<JamClientSessionAlertConfig> SessionAlert;                                 ///< Offset 0x0008 Type MakeMJVTblForOptionalStruct<JamClientSessionAlertConfig>::MJVTBL
    uint32                                ScrollOfResurrectionMaxRequestsPerDay;        ///< Offset 0x0018 Type _MJVTBL_UINT32
    bool                                  ScrollOfResurrectionEnabled;                  ///< Offset 0x001C Type _MJVTBL_BOOL
    Optional<JamCliEuropaTicketConfig>    EuropaTicketSystemStatus;                     ///< Offset 0x0020 Type MakeMJVTblForOptionalStruct<JamCliEuropaTicketConfig>::MJVTBL
    uint32                                ScrollOfResurrectionRequestsRemaining;        ///< Offset 0x0034 Type _MJVTBL_UINT32
    uint32                                CfgRealmID;                                   ///< Offset 0x0038 Type _MJVTBL_UINT32
    uint8                                 ComplaintStatus;                              ///< Offset 0x003C Type _MJVTBL_UINT8
    int32                                 CfgRealmRecID;                                ///< Offset 0x0040 Type _MJVTBL_INT32
    bool                                  ItemRestorationButtonEnabled;                 ///< Offset 0x0044 Type _MJVTBL_BOOL
    bool                                  CharUndeleteEnabled;                          ///< Offset 0x0045 Type _MJVTBL_BOOL
    bool                                  BpayStoreDisabledByParentalControls;          ///< Offset 0x0046 Type _MJVTBL_BOOL
};

///< SMSG_FEATURE_SYSTEM_STATUS_GLUE_SCREEN
struct ClientFeatureSystemStatusGlueScreen
{
    bool BpayStoreAvailable;                         ///< Offset 0x0000 Type _MJVTBL_BOOL
    bool BpayStoreDisabledByParentalControls;        ///< Offset 0x0001 Type _MJVTBL_BOOL
    bool CharUndeleteEnabled;                        ///< Offset 0x0002 Type _MJVTBL_BOOL
    bool BpayStoreEnabled;                           ///< Offset 0x0003 Type _MJVTBL_BOOL
};

///< SMSG_PVPSEASON
struct ClientPVPSeason
{
    int32 PreviousSeason;        ///< Offset 0x0000 Type _MJVTBL_INT32
    int32 CurrentSeason;         ///< Offset 0x0004 Type _MJVTBL_INT32
};

///< SMSG_REQUEST_PVPREWARDS_RESPONSE
struct ClientRequestPVPRewardsResponse
{
    int32 RatedRewardPointsThisWeek;            ///< Offset 0x0000 Type _MJVTBL_INT32
    int32 ArenaRewardPointsThisWeek;            ///< Offset 0x0004 Type _MJVTBL_INT32
    int32 RatedMaxRewardPointsThisWeek;         ///< Offset 0x0008 Type _MJVTBL_INT32
    int32 ArenaRewardPoints;                    ///< Offset 0x000C Type _MJVTBL_INT32
    int32 RandomRewardPointsThisWeek;           ///< Offset 0x0010 Type _MJVTBL_INT32
    int32 ArenaMaxRewardPointsThisWeek;         ///< Offset 0x0014 Type _MJVTBL_INT32
    int32 RatedRewardPoints;                    ///< Offset 0x0018 Type _MJVTBL_INT32
    int32 MaxRewardPointsThisWeek;              ///< Offset 0x001C Type _MJVTBL_INT32
    int32 RewardPointsThisWeek;                 ///< Offset 0x0020 Type _MJVTBL_INT32
    int32 RandomMaxRewardPointsThisWeek;        ///< Offset 0x0024 Type _MJVTBL_INT32
};

///< SMSG_GAME_OBJECT_ACTIVATE_ANIM_KIT
struct ClientGameObjectActivateAnimKit
{
    bool   Maintain;          ///< Offset 0x0000 Type _MJVTBL_BOOL
    uint64 ObjectGUID;        ///< Offset 0x0008 Type _MJVTBL_UINT64
    int32  AnimKitID;         ///< Offset 0x0010 Type _MJVTBL_INT32
};

///< SMSG_GAME_OBJECT_CUSTOM_ANIM
struct ClientGameObjectCustomAnim
{
    uint64 ObjectGUID;           ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32 CustomAnim;           ///< Offset 0x0008 Type _MJVTBL_UINT32
    bool   PlayAsDespawn;        ///< Offset 0x000C Type _MJVTBL_BOOL
};

///< SMSG_GAME_OBJECT_DESPAWN
struct ClientGameObjectDespawn
{
    uint64 ObjectGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_GAME_OBJECT_PLAY_SPELL_VISUAL
struct ClientGameObjectPlaySpellVisual
{
    uint64 ObjectGUID;           ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 ActivatorGUID;        ///< Offset 0x0008 Type _MJVTBL_UINT64
    int32  SpellVisualID;        ///< Offset 0x0010 Type _MJVTBL_INT32
};

///< SMSG_MAP_OBJ_EVENTS
struct ClientMapObjEvents
{
    uint32  UniqueID;        ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint8 * Events;          ///< Offset 0x0008 Type _MJVTBL_NOT_IMPLEMENTED
};

///< SMSG_MISSILE_CANCEL
struct ClientMissileCancel
{
    uint64 OwnerGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    bool   Reverse;          ///< Offset 0x0008 Type _MJVTBL_BOOL
    int32  SpellID;          ///< Offset 0x000C Type _MJVTBL_INT32
};

///< SMSG_VOID_STORAGE_FAILED
struct ClientVoidStorageFailed
{
    uint8 Reason;        ///< Offset 0x0000 Type _MJVTBL_UINT8
};

///< SMSG_VOID_STORAGE_CONTENTS
struct ClientVoidStorageContents
{
    struct JamVoidItem
    {
        struct Item_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        uint64      Guid;               ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint64      Creator;            ///< Offset 0x0008 Type _MJVTBL_UINT64
        uint32      Slot;               ///< Offset 0x0010 Type _MJVTBL_UINT32
        Item_Struct Item;               ///< Offset 0x0018 Type _MJVTBL_STRUCT
    };

    std::vector<JamVoidItem> Items;                           ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamVoidItem>::MJVTBL
};

///< SMSG_VOID_STORAGE_TRANSFER_CHANGES
struct ClientVoidStorageTransferChanges
{
    struct JamVoidItem
    {
        struct Item_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        uint64      Guid;               ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint64      Creator;            ///< Offset 0x0008 Type _MJVTBL_UINT64
        uint32      Slot;               ///< Offset 0x0010 Type _MJVTBL_UINT32
        Item_Struct Item;               ///< Offset 0x0018 Type _MJVTBL_STRUCT
    };

    std::vector<uint64>      RemovedItems;                    ///< Offset 0x0000 Type MakeMJVTblForArrayOf<unsignedlonglong,&(MJVTBL_UINT64)>::MJVTBL
    std::vector<JamVoidItem> AddedItems;                      ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamVoidItem>::MJVTBL
};

///< SMSG_VOID_TRANSFER_RESULT
struct ClientVoidTransferResult
{
    int32 Result;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_VOID_ITEM_SWAP_RESPONSE
struct ClientVoidItemSwapResponse
{
    uint64 VoidItemB;            ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 VoidItemA;            ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint32 VoidItemSlotB;        ///< Offset 0x0010 Type _MJVTBL_UINT32
    uint32 VoidItemSlotA;        ///< Offset 0x0014 Type _MJVTBL_UINT32
};

///< SMSG_XPGAIN_ABORTED
struct ClientXPGainAborted
{
    uint64 Victim;               ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32  XpToAdd;              ///< Offset 0x0008 Type _MJVTBL_INT32
    int32  XpGainReason;         ///< Offset 0x000C Type _MJVTBL_INT32
    int32  XpAbortReason;        ///< Offset 0x0010 Type _MJVTBL_INT32
};

///< SMSG_PRINT_NOTIFICATION
struct ClientPrintNotification
{
    std::string NotifyText;         ///< Offset 0x0000 Type _MJVTBL_STRING
};

///< SMSG_FAILED_PLAYER_CONDITION
struct ClientFailedPlayerCondition
{
    int32 ConditionID;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_CUSTOM_LOAD_SCREEN
struct ClientCustomLoadScreen
{
    int32 TeleportSpellID;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_TRANSFER_PENDING
struct ClientTransferPending
{
    struct ShipTransferPending
    {
        uint32 ID;                 ///< Offset 0x0000 Type _MJVTBL_UINT32
        int32  OriginMapID;        ///< Offset 0x0004 Type _MJVTBL_INT32
    };

    int32                         MapID;                                ///< Offset 0x0000 Type _MJVTBL_INT32
    Optional<ShipTransferPending> Ship;                                 ///< Offset 0x0004 Type MakeMJVTblForOptionalStruct<ShipTransferPending>::MJVTBL
    Optional<int32>               TransferSpellID;                      ///< Offset 0x0010 Type MakeMJVTblForOptional<int,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_GAME_EVENT_DEBUG_LOG
struct ClientGameEventDebugLog
{
    uint64      TriggeredBy;            ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32       EventID;                ///< Offset 0x0008 Type _MJVTBL_INT32
    int32       EventType;              ///< Offset 0x000C Type _MJVTBL_INT32
    std::string Reason;                 ///< Offset 0x0010 Type _MJVTBL_STRING
    std::string TriggeredByName;        ///< Offset 0x0090 Type _MJVTBL_STRING
    std::string EventName;              ///< Offset 0x0110 Type _MJVTBL_STRING
};

///< SMSG_SERVER_PERF
struct ClientServerPerf
{
    struct ClientServerPerfStat
    {
        std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
    };

    std::vector<ClientServerPerfStat> Stats;                                    ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ClientServerPerfStat>::MJVTBL
};

///< SMSG_AREA_TRIGGER_MOVEMENT_UPDATE
struct ClientAreaTriggerMovementUpdate
{
    G3D::Vector3 Start;               ///< Offset 0x0000 Type _MJVTBL_V3
    G3D::Vector3 End;                 ///< Offset 0x000C Type _MJVTBL_V3
};

///< SMSG_ADJUST_SPLINE_DURATION
struct ClientAdjustSplineDuration
{
    uint64 Unit;          ///< Offset 0x0000 Type _MJVTBL_UINT64
    float  Scale;         ///< Offset 0x0008 Type _MJVTBL_FLOAT
};

///< SMSG_LEARN_TALENT_FAILED
struct ClientLearnTalentFailed
{
    int32 Reason;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_UPDATE_TALENT_DATA
struct ClientUpdateTalentData
{
    struct Info_Struct
    {
        struct JamTalentGroupInfo
        {
            int32               SpecID;                     ///< Offset 0x0000 Type _MJVTBL_INT32
            std::vector<uint16> TalentIDs;                  ///< Offset 0x0008 Type MakeMJVTblForArrayOf<unsignedshort,&(MJVTBL_UINT16)>::MJVTBL
            uint16              GlyphIDs[6];                ///< Offset 0x0020 Type MakeMJVTblForFixedArrayOf<unsignedshort,6,&(MJVTBL_UINT16)>::MJVTBL
        };

        uint8                           ActiveGroup;                            ///< Offset 0x0000 Type _MJVTBL_UINT8
        std::vector<JamTalentGroupInfo> TalentGroups;                           ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamTalentGroupInfo>::MJVTBL
    };

    Info_Struct Info;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_GMREQUEST_PLAYER_INFO
struct ClientGMRequestPlayerInfo
{
    bool        Success;            ///< Offset 0x0000 Type _MJVTBL_BOOL
    std::string Name;               ///< Offset 0x0001 Type _MJVTBL_STRING
};

///< SMSG_GMSUMMON
struct ClientGMSummon
{
    bool Success;        ///< Offset 0x0000 Type _MJVTBL_BOOL
};

///< SMSG_GHOST
struct ClientGhost
{
    uint64 Target;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_LFGJOIN_RESULT
struct ClientLFGJoinResult
{
    struct ClientLFGBlackList
    {
        struct ClientLFGBlackListSlot
        {
            int32 Slot;              ///< Offset 0x0000 Type _MJVTBL_INT32
            int32 Reason;            ///< Offset 0x0004 Type _MJVTBL_INT32
            int32 SubReason1;        ///< Offset 0x0008 Type _MJVTBL_INT32
            int32 SubReason2;        ///< Offset 0x000C Type _MJVTBL_INT32
        };

        uint64                              Guid;                                       ///< Offset 0x0000 Type _MJVTBL_UINT64
        std::vector<ClientLFGBlackListSlot> Slots;                                      ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<ClientLFGBlackListSlot>::MJVTBL
    };

    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    uint8                           Result;                                 ///< Offset 0x0000 Type _MJVTBL_UINT8
    std::vector<ClientLFGBlackList> BlackList;                              ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<ClientLFGBlackList>::MJVTBL
    uint8                           ResultDetail;                           ///< Offset 0x0020 Type _MJVTBL_UINT8
    Ticket_Struct                   Ticket;                                 ///< Offset 0x0028 Type _MJVTBL_STRUCT
};

///< SMSG_LFGLIST_JOIN_RESULT
struct ClientLFGListJoinResult
{
    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    Ticket_Struct Ticket;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint8         ResultDetail;         ///< Offset 0x0018 Type _MJVTBL_UINT8
    uint8         Result;               ///< Offset 0x0019 Type _MJVTBL_UINT8
};

///< SMSG_LFGQUEUE_STATUS
struct ClientLFGQueueStatus
{
    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    Ticket_Struct Ticket;                      ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint32        QueuedTime;                  ///< Offset 0x0018 Type _MJVTBL_UINT32
    uint32        AvgWaitTime;                 ///< Offset 0x001C Type _MJVTBL_UINT32
    uint32        Slot;                        ///< Offset 0x0020 Type _MJVTBL_UINT32
    uint32        AvgWaitTimeMe;               ///< Offset 0x0024 Type _MJVTBL_UINT32
    uint8         LastNeeded[3];               ///< Offset 0x0028 Type MakeMJVTblForFixedArrayOf<unsignedchar,3,&(MJVTBL_UINT8)>::MJVTBL
    uint32        AvgWaitTimeByRole[3];        ///< Offset 0x002C Type MakeMJVTblForFixedArrayOf<unsignedint,3,&(MJVTBL_UINT32)>::MJVTBL
};

///< SMSG_LFGROLE_CHECK_UPDATE
struct ClientLFGRoleCheckUpdate
{
    struct ClientLFGRoleCheckUpdateMember
    {
        uint64 Guid;                     ///< Offset 0x0000 Type _MJVTBL_UINT64
        bool   RoleCheckComplete;        ///< Offset 0x0008 Type _MJVTBL_BOOL
        uint32 RolesDesired;             ///< Offset 0x000C Type _MJVTBL_UINT32
        uint8  Level;                    ///< Offset 0x0010 Type _MJVTBL_UINT8
    };

    bool                                        IsBeginning;                                        ///< Offset 0x0000 Type _MJVTBL_BOOL
    std::vector<uint32>                         JoinSlots;                                          ///< Offset 0x0008 Type MakeMJVTblForArrayOf<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
    uint64                                      BgQueueID;                                          ///< Offset 0x0020 Type _MJVTBL_UINT64
    uint8                                       PartyIndex;                                         ///< Offset 0x0028 Type _MJVTBL_UINT8
    uint8                                       RoleCheckStatus;                                    ///< Offset 0x0029 Type _MJVTBL_UINT8
    std::vector<ClientLFGRoleCheckUpdateMember> Members;                                            ///< Offset 0x0030 Type MakeMJVTblForArrayOfStruct<ClientLFGRoleCheckUpdateMember>::MJVTBL
};

///< SMSG_LFGUPDATE_STATUS_NONE
struct ClientLFGUpdateStatusNone
{
};

///< SMSG_LFGUPDATE_STATUS
struct ClientLFGUpdateStatus
{
    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    uint32              RequestedRoles;             ///< Offset 0x0000 Type _MJVTBL_UINT32
    bool                NotifyUI;                   ///< Offset 0x0004 Type _MJVTBL_BOOL
    std::vector<uint32> Slots;                      ///< Offset 0x0008 Type MakeMJVTblForArrayOf<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
    bool                LfgJoined;                  ///< Offset 0x0020 Type _MJVTBL_BOOL
    uint8               Reason;                     ///< Offset 0x0021 Type _MJVTBL_UINT8
    std::vector<uint64> SuspendedPlayers;           ///< Offset 0x0028 Type MakeMJVTblForArrayOf<unsignedlonglong,&(MJVTBL_UINT64)>::MJVTBL
    uint8               SubType;                    ///< Offset 0x0040 Type _MJVTBL_UINT8
    bool                Queued;                     ///< Offset 0x0041 Type _MJVTBL_BOOL
    std::string         Comment;                    ///< Offset 0x0042 Type _MJVTBL_STRING
    Ticket_Struct       Ticket;                     ///< Offset 0x0148 Type _MJVTBL_STRUCT
    bool                Joined;                     ///< Offset 0x0160 Type _MJVTBL_BOOL
    bool                IsParty;                    ///< Offset 0x0161 Type _MJVTBL_BOOL
    uint8               Needs[3];                   ///< Offset 0x0162 Type MakeMJVTblForFixedArrayOf<unsignedchar,3,&(MJVTBL_UINT8)>::MJVTBL
};

///< SMSG_LFGLIST_UPDATE_STATUS
struct ClientLFGListUpdateStatus
{
    struct Request_Struct
    {
        uint32      ActivityID;               ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32      RequiredItemLevel;        ///< Offset 0x0004 Type _MJVTBL_UINT32
        std::string Name;                     ///< Offset 0x0008 Type _MJVTBL_STRING
        std::string Comment;                  ///< Offset 0x0088 Type _MJVTBL_STRING
        std::string VoiceChat;                ///< Offset 0x0488 Type _MJVTBL_STRING
    };

    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    bool           Listed;                ///< Offset 0x0000 Type _MJVTBL_BOOL
    Request_Struct Request;               ///< Offset 0x0004 Type _MJVTBL_STRUCT
    uint8          Reason;                ///< Offset 0x050C Type _MJVTBL_UINT8
    Ticket_Struct  Ticket;                ///< Offset 0x0510 Type _MJVTBL_STRUCT
};

///< SMSG_LFGLIST_UPDATE_BLACKLIST
struct ClientLFGListUpdateBlacklist
{
    struct Blacklist_Struct
    {
        struct JamLFGListBlacklistEntry
        {
            uint32 ActivityID;        ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint32 Reason;            ///< Offset 0x0004 Type _MJVTBL_UINT32
        };

        std::vector<JamLFGListBlacklistEntry> Entries;                                      ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamLFGListBlacklistEntry>::MJVTBL
    };

    Blacklist_Struct Blacklist;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_LFGPROPOSAL_UPDATE
struct ClientLFGProposalUpdate
{
    struct ClientLFGProposalUpdatePlayer
    {
        uint32 Roles;            ///< Offset 0x0000 Type _MJVTBL_UINT32
        bool   Me;               ///< Offset 0x0004 Type _MJVTBL_BOOL
        bool   SameParty;        ///< Offset 0x0005 Type _MJVTBL_BOOL
        bool   MyParty;          ///< Offset 0x0006 Type _MJVTBL_BOOL
        bool   Responded;        ///< Offset 0x0007 Type _MJVTBL_BOOL
        bool   Accepted;         ///< Offset 0x0008 Type _MJVTBL_BOOL
    };

    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    bool                                       ProposalSilent;                                    ///< Offset 0x0000 Type _MJVTBL_BOOL
    std::vector<ClientLFGProposalUpdatePlayer> Players;                                           ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<ClientLFGProposalUpdatePlayer>::MJVTBL
    uint32                                     CompletedMask;                                     ///< Offset 0x0020 Type _MJVTBL_UINT32
    uint64                                     InstanceID;                                        ///< Offset 0x0028 Type _MJVTBL_UINT64
    bool                                       ValidCompletedMask;                                ///< Offset 0x0030 Type _MJVTBL_BOOL
    uint32                                     Slot;                                              ///< Offset 0x0034 Type _MJVTBL_UINT32
    Ticket_Struct                              Ticket;                                            ///< Offset 0x0038 Type _MJVTBL_STRUCT
    int8                                       State;                                             ///< Offset 0x0050 Type _MJVTBL_INT8
    uint32                                     ProposalID;                                        ///< Offset 0x0054 Type _MJVTBL_UINT32
};

///< SMSG_LFGSEARCH_RESULTS
struct ClientLFGSearchResults
{
    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    struct ClientLFGSearchResultParty
    {
        uint64      Guid;                         ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32      ChangeMask;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        std::string Comment;                      ///< Offset 0x000C Type _MJVTBL_STRING
        uint64      InstanceID;                   ///< Offset 0x0110 Type _MJVTBL_UINT64
        uint32      InstanceCompletedMask;        ///< Offset 0x0118 Type _MJVTBL_UINT32
        uint8       Needs[3];                     ///< Offset 0x011C Type MakeMJVTblForFixedArrayOf<unsignedchar,3,&(MJVTBL_UINT8)>::MJVTBL
    };

    struct ClientLFGSearchResultPlayer
    {
        uint64      Guid;                         ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32      ChangeMask;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8       Level;                        ///< Offset 0x000C Type _MJVTBL_UINT8
        uint8       ChrClass;                     ///< Offset 0x000D Type _MJVTBL_UINT8
        uint8       Race;                         ///< Offset 0x000E Type _MJVTBL_UINT8
        uint32      Armor;                        ///< Offset 0x0010 Type _MJVTBL_UINT32
        uint32      SpellDamage;                  ///< Offset 0x0014 Type _MJVTBL_UINT32
        uint32      PlusHealing;                  ///< Offset 0x0018 Type _MJVTBL_UINT32
        uint32      CritMelee;                    ///< Offset 0x001C Type _MJVTBL_UINT32
        uint32      CritRanged;                   ///< Offset 0x0020 Type _MJVTBL_UINT32
        uint32      CritSpell;                    ///< Offset 0x0024 Type _MJVTBL_UINT32
        float       Mp5;                          ///< Offset 0x0028 Type _MJVTBL_FLOAT
        float       Mp5InCombat;                  ///< Offset 0x002C Type _MJVTBL_FLOAT
        uint32      AttackPower;                  ///< Offset 0x0030 Type _MJVTBL_UINT32
        uint32      Agility;                      ///< Offset 0x0034 Type _MJVTBL_UINT32
        uint32      MaxHealth;                    ///< Offset 0x0038 Type _MJVTBL_UINT32
        uint32      MaxMana;                      ///< Offset 0x003C Type _MJVTBL_UINT32
        uint32      BossKills;                    ///< Offset 0x0040 Type _MJVTBL_UINT32
        float       GearRating;                   ///< Offset 0x0044 Type _MJVTBL_FLOAT
        float       AvgItemLevel;                 ///< Offset 0x0048 Type _MJVTBL_FLOAT
        uint32      DefenseRating;                ///< Offset 0x004C Type _MJVTBL_UINT32
        uint32      DodgeRating;                  ///< Offset 0x0050 Type _MJVTBL_UINT32
        uint32      BlockRating;                  ///< Offset 0x0054 Type _MJVTBL_UINT32
        uint32      ParryRating;                  ///< Offset 0x0058 Type _MJVTBL_UINT32
        uint32      HasteRating;                  ///< Offset 0x005C Type _MJVTBL_UINT32
        float       Expertise;                    ///< Offset 0x0060 Type _MJVTBL_FLOAT
        uint32      SpecID;                       ///< Offset 0x0064 Type _MJVTBL_UINT32
        uint32      VirtualRealmAddress;          ///< Offset 0x0068 Type _MJVTBL_UINT32
        uint32      NativeRealmAddress;           ///< Offset 0x006C Type _MJVTBL_UINT32
        std::string Comment;                      ///< Offset 0x0070 Type _MJVTBL_STRING
        bool        IsLeader;                     ///< Offset 0x0170 Type _MJVTBL_BOOL
        uint64      PartyGuid;                    ///< Offset 0x0178 Type _MJVTBL_UINT64
        uint8       RolesDesired;                 ///< Offset 0x0180 Type _MJVTBL_UINT8
        uint32      Area;                         ///< Offset 0x0184 Type _MJVTBL_UINT32
        uint8       Status;                       ///< Offset 0x0188 Type _MJVTBL_UINT8
        uint64      InstanceID;                   ///< Offset 0x0190 Type _MJVTBL_UINT64
        uint32      InstanceCompletedMask;        ///< Offset 0x0198 Type _MJVTBL_UINT32
    };

    bool                                     Incremental;                                     ///< Offset 0x0000 Type _MJVTBL_BOOL
    std::vector<uint64>                      Removes;                                         ///< Offset 0x0008 Type MakeMJVTblForArrayOf<unsignedlonglong,&(MJVTBL_UINT64)>::MJVTBL
    Ticket_Struct                            Ticket;                                          ///< Offset 0x0020 Type _MJVTBL_STRUCT
    uint32                                   SlotID;                                          ///< Offset 0x0038 Type _MJVTBL_UINT32
    uint32                                   CountTotalParties;                               ///< Offset 0x003C Type _MJVTBL_UINT32
    uint32                                   CountTotalPlayers;                               ///< Offset 0x0040 Type _MJVTBL_UINT32
    uint32                                   SlotType;                                        ///< Offset 0x0044 Type _MJVTBL_UINT32
    std::vector<ClientLFGSearchResultParty>  Parties;                                         ///< Offset 0x0048 Type MakeMJVTblForArrayOfStruct<ClientLFGSearchResultParty>::MJVTBL
    std::vector<ClientLFGSearchResultPlayer> Players;                                         ///< Offset 0x0060 Type MakeMJVTblForArrayOfStruct<ClientLFGSearchResultPlayer>::MJVTBL
};

///< SMSG_SERVER_INFO_RESPONSE
struct ClientServerInfoResponse
{
    struct JamCliServerInfoLine
    {
        std::string Label;              ///< Offset 0x0000 Type _MJVTBL_STRING
        std::string Data;               ///< Offset 0x0020 Type _MJVTBL_STRING
    };

    std::vector<JamCliServerInfoLine> UserServerInfo;                           ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamCliServerInfoLine>::MJVTBL
    std::vector<JamCliServerInfoLine> WorldServerInfo;                          ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamCliServerInfoLine>::MJVTBL
};

///< SMSG_LOOT_CONTENTS
struct ClientLootContents
{
    struct JamLootItem
    {
        struct Loot_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        LOOT_LIST_ITEM_TYPE Type;                       ///< Offset 0x0000 Type _MJVTBL_LOOT_LIST_ITEM_TYPE
        LOOT_ITEM_UI_TYPE   UiType;                     ///< Offset 0x0004 Type _MJVTBL_LOOT_ITEM_UI_TYPE
        uint32              Quantity;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8               LootItemType;               ///< Offset 0x000C Type _MJVTBL_UINT8
        uint8               LootListID;                 ///< Offset 0x000D Type _MJVTBL_UINT8
        bool                CanTradeToTapList;          ///< Offset 0x000E Type _MJVTBL_BOOL
        Loot_Struct         Loot;                       ///< Offset 0x0010 Type _MJVTBL_STRUCT
    };

    uint64                   LootObj;                         ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64                   Owner;                           ///< Offset 0x0008 Type _MJVTBL_UINT64
    std::vector<JamLootItem> Items;                           ///< Offset 0x0010 Type MakeMJVTblForArrayOfStruct<JamLootItem>::MJVTBL
};

///< SMSG_SHOW_NEUTRAL_PLAYER_FACTION_SELECT_UI
struct ClientShowNeutralPlayerFactionSelectUI
{
};

///< SMSG_NEUTRAL_PLAYER_FACTION_SELECT_RESULT
struct ClientNeutralPlayerFactionSelectResult
{
    bool  Success;          ///< Offset 0x0000 Type _MJVTBL_BOOL
    int32 NewRaceID;        ///< Offset 0x0004 Type _MJVTBL_INT32
};

///< SMSG_SORSTART_EXPERIENCE_INCOMPLETE
struct ClientSORStartExperienceIncomplete
{
};

///< SMSG_ACCOUNT_INFO_RESPONSE
struct ClientAccountInfoResponse
{
    struct JamCliBnetLicense
    {
        int32  LicenseID;         ///< Offset 0x0000 Type _MJVTBL_INT32
        uint32 Expiration;        ///< Offset 0x0008 Type _MJVTBL_TIME_T
    };

    int32                          BnetAccountID;                         ///< Offset 0x0000 Type _MJVTBL_INT32
    std::vector<JamCliBnetLicense> GameAccountLicenses;                   ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamCliBnetLicense>::MJVTBL
    std::vector<JamCliBnetLicense> BnetAccountLicenses;                   ///< Offset 0x0020 Type MakeMJVTblForArrayOfStruct<JamCliBnetLicense>::MJVTBL
    int32                          GameAccountFlags;                      ///< Offset 0x0038 Type _MJVTBL_INT32
    int32                          LocalAccountFlags;                     ///< Offset 0x003C Type _MJVTBL_INT32
    std::string                    BnetAccountName;                       ///< Offset 0x0040 Type _MJVTBL_STRING
    int32                          BnetAccountFlags;                      ///< Offset 0x0544 Type _MJVTBL_INT32
    int32                          GameAccountID;                         ///< Offset 0x0548 Type _MJVTBL_INT32
    std::string                    GameAccountName;                       ///< Offset 0x054C Type _MJVTBL_STRING
};

///< SMSG_SET_DFFAST_LAUNCH_RESULT
struct ClientSetDFFastLaunchResult
{
    bool Set;         ///< Offset 0x0000 Type _MJVTBL_BOOL
};

///< SMSG_SET_LFGTIME_WALKER
struct ClientSetLFGTimeWalker
{
    int32 LfgDungeonID;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_SUPERCEDED_SPELLS
struct ClientSupercededSpells
{
    std::vector<int32> SpellID;                   ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
    std::vector<int32> Superceded;                ///< Offset 0x0018 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_LEARNED_SPELLS
struct ClientLearnedSpells
{
    std::vector<int32> SpellID;                   ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
    bool               SuppressMessaging;         ///< Offset 0x0018 Type _MJVTBL_BOOL
};

///< SMSG_UNLEARNED_SPELLS
struct ClientUnlearnedSpells
{
    std::vector<int32> SpellID;                   ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_PET_LEARNED_SPELLS
struct ClientPetLearnedSpells
{
    std::vector<int32> SpellID;                   ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_PET_UNLEARNED_SPELLS
struct ClientPetUnlearnedSpells
{
    std::vector<int32> SpellID;                   ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_UPDATE_ACTION_BUTTONS
struct ClientUpdateActionButtons
{
    uint64 ActionButtons[132];        ///< Offset 0x0000 Type MakeMJVTblForFixedArrayOf<unsignedlonglong,132,&(MJVTBL_UINT64)>::MJVTBL
    uint8  Reason;                    ///< Offset 0x0420 Type _MJVTBL_UINT8
};

///< SMSG_DONT_AUTO_PUSH_SPELLS_TO_ACTION_BAR
struct ClientDontAutoPushSpellsToActionBar
{
};

///< SMSG_LFGSLOT_INVALID
struct ClientLFGSlotInvalid
{
    int32  SubReason1;        ///< Offset 0x0000 Type _MJVTBL_INT32
    int32  SubReason2;        ///< Offset 0x0004 Type _MJVTBL_INT32
    uint32 Reason;            ///< Offset 0x0008 Type _MJVTBL_UINT32
};

///< SMSG_UPDATE_DUNGEON_ENCOUNTER_FOR_LOOT
struct ClientUpdateDungeonEncounterForLoot
{
};

///< SMSG_SCENE_OBJECT_EVENT
struct ClientSceneObjectEvent
{
    struct SceneEvent_Struct
    {
        std::string EventScript;        ///< Offset 0x0000 Type _MJVTBL_STRING
    };

    SceneEvent_Struct SceneEvent;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint64            SceneObjectGUID;          ///< Offset 0x0100 Type _MJVTBL_UINT64
};

///< SMSG_SCENE_OBJECT_PET_BATTLE_INITIAL_UPDATE
struct ClientSceneObjectPetBattleInitialUpdate
{
    struct MsgData_Struct
    {
        struct JamPetBattlePlayerUpdate
        {
            struct JamPetBattlePetUpdate
            {
                struct JamPetBattleActiveAbility
                {
                    int32 AbilityID;                ///< Offset 0x0000 Type _MJVTBL_INT32
                    int16 CooldownRemaining;        ///< Offset 0x0004 Type _MJVTBL_INT16
                    int16 LockdownRemaining;        ///< Offset 0x0006 Type _MJVTBL_INT16
                    int8  AbilityIndex;             ///< Offset 0x0008 Type _MJVTBL_INT8
                    uint8 Pboid;                    ///< Offset 0x0009 Type _MJVTBL_UINT8
                };

                struct JamPetBattleActiveAura
                {
                    int32  AbilityID;              ///< Offset 0x0000 Type _MJVTBL_INT32
                    uint32 InstanceID;             ///< Offset 0x0004 Type _MJVTBL_UINT32
                    int32  RoundsRemaining;        ///< Offset 0x0008 Type _MJVTBL_INT32
                    int32  CurrentRound;           ///< Offset 0x000C Type _MJVTBL_INT32
                    uint8  CasterPBOID;            ///< Offset 0x0010 Type _MJVTBL_UINT8
                };

                struct JamPetBattleActiveState
                {
                    uint32 StateID;           ///< Offset 0x0000 Type _MJVTBL_UINT32
                    int32  StateValue;        ///< Offset 0x0004 Type _MJVTBL_INT32
                };

                uint64                                 BattlePetGUID;                                 ///< Offset 0x0000 Type _MJVTBL_UINT64
                int32                                  SpeciesID;                                     ///< Offset 0x0008 Type _MJVTBL_INT32
                int32                                  DisplayID;                                     ///< Offset 0x000C Type _MJVTBL_INT32
                int32                                  CollarID;                                      ///< Offset 0x0010 Type _MJVTBL_INT32
                int16                                  Level;                                         ///< Offset 0x0014 Type _MJVTBL_INT16
                int16                                  Xp;                                            ///< Offset 0x0016 Type _MJVTBL_INT16
                int32                                  CurHealth;                                     ///< Offset 0x0018 Type _MJVTBL_INT32
                int32                                  MaxHealth;                                     ///< Offset 0x001C Type _MJVTBL_INT32
                int32                                  Power;                                         ///< Offset 0x0020 Type _MJVTBL_INT32
                int32                                  Speed;                                         ///< Offset 0x0024 Type _MJVTBL_INT32
                int32                                  NpcTeamMemberID;                               ///< Offset 0x0028 Type _MJVTBL_INT32
                uint16                                 BreedQuality;                                  ///< Offset 0x002C Type _MJVTBL_UINT16
                uint16                                 StatusFlags;                                   ///< Offset 0x002E Type _MJVTBL_UINT16
                int8                                   Slot;                                          ///< Offset 0x0030 Type _MJVTBL_INT8
                std::string                            CustomName;                                    ///< Offset 0x0031 Type _MJVTBL_STRING
                std::vector<JamPetBattleActiveAbility> Abilities;                                     ///< Offset 0x0078 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAbility>::MJVTBL
                std::vector<JamPetBattleActiveAura>    Auras;                                         ///< Offset 0x0090 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAura>::MJVTBL
                std::vector<JamPetBattleActiveState>   States;                                        ///< Offset 0x00A8 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveState>::MJVTBL
            };

            uint64                             CharacterID;                               ///< Offset 0x0000 Type _MJVTBL_UINT64
            int32                              TrapAbilityID;                             ///< Offset 0x0008 Type _MJVTBL_INT32
            int32                              TrapStatus;                                ///< Offset 0x000C Type _MJVTBL_INT32
            uint16                             RoundTimeSecs;                             ///< Offset 0x0010 Type _MJVTBL_UINT16
            std::vector<JamPetBattlePetUpdate> Pets;                                      ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamPetBattlePetUpdate>::MJVTBL
            int8                               FrontPet;                                  ///< Offset 0x0030 Type _MJVTBL_INT8
            uint8                              InputFlags;                                ///< Offset 0x0031 Type _MJVTBL_UINT8
        };

        struct JamPetBattleEnviroUpdate
        {
            struct JamPetBattleActiveAura
            {
                int32  AbilityID;              ///< Offset 0x0000 Type _MJVTBL_INT32
                uint32 InstanceID;             ///< Offset 0x0004 Type _MJVTBL_UINT32
                int32  RoundsRemaining;        ///< Offset 0x0008 Type _MJVTBL_INT32
                int32  CurrentRound;           ///< Offset 0x000C Type _MJVTBL_INT32
                uint8  CasterPBOID;            ///< Offset 0x0010 Type _MJVTBL_UINT8
            };

            struct JamPetBattleActiveState
            {
                uint32 StateID;           ///< Offset 0x0000 Type _MJVTBL_UINT32
                int32  StateValue;        ///< Offset 0x0004 Type _MJVTBL_INT32
            };

            std::vector<JamPetBattleActiveAura>  Auras;                                       ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAura>::MJVTBL
            std::vector<JamPetBattleActiveState> States;                                      ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveState>::MJVTBL
        };

        uint16                   WaitingForFrontPetsMaxSecs;        ///< Offset 0x0000 Type _MJVTBL_UINT16
        uint16                   PvpMaxRoundTime;                   ///< Offset 0x0002 Type _MJVTBL_UINT16
        int32                    CurRound;                          ///< Offset 0x0004 Type _MJVTBL_INT32
        uint32                   NpcCreatureID;                     ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32                   NpcDisplayID;                      ///< Offset 0x000C Type _MJVTBL_UINT32
        int8                     CurPetBattleState;                 ///< Offset 0x0010 Type _MJVTBL_INT8
        uint8                    ForfeitPenalty;                    ///< Offset 0x0011 Type _MJVTBL_UINT8
        uint64                   InitialWildPetGUID;                ///< Offset 0x0018 Type _MJVTBL_UINT64
        bool                     IsPVP;                             ///< Offset 0x0020 Type _MJVTBL_BOOL
        bool                     CanAwardXP;                        ///< Offset 0x0021 Type _MJVTBL_BOOL
        JamPetBattlePlayerUpdate Players[2];                        ///< Offset 0x0028 Type MakeMJVTblForFixedArrayOfStruct<JamPetBattlePlayerUpdate,2>::MJVTBL
        JamPetBattleEnviroUpdate Enviros[3];                        ///< Offset 0x0098 Type MakeMJVTblForFixedArrayOfStruct<JamPetBattleEnviroUpdate,3>::MJVTBL
    };

    MsgData_Struct MsgData;                ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint64         SceneObjectGUID;        ///< Offset 0x0128 Type _MJVTBL_UINT64
};

///< SMSG_SCENE_OBJECT_PET_BATTLE_FIRST_ROUND
struct ClientSceneObjectPetBattleFirstRound
{
    struct MsgData_Struct
    {
        struct JamPetBattleEffect
        {
            struct JamPetBattleEffectTarget
            {
                JAM_PET_BATTLE_EFFECT_TARGET_EX Type;                                   ///< Offset 0x0000 Type _MJVTBL_JAM_PET_BATTLE_EFFECT_TARGET_EX
                uint8                           Petx;                                   ///< Offset 0x0004 Type _MJVTBL_UINT8
                uint32                          AuraInstanceID;                         ///< Offset 0x0008 Type _MJVTBL_UINT32
                uint32                          AuraAbilityID;                          ///< Offset 0x000C Type _MJVTBL_UINT32
                int32                           RoundsRemaining;                        ///< Offset 0x0010 Type _MJVTBL_INT32
                int32                           CurrentRound;                           ///< Offset 0x0014 Type _MJVTBL_INT32
                uint32                          StateID;                                ///< Offset 0x0018 Type _MJVTBL_UINT32
                int32                           StateValue;                             ///< Offset 0x001C Type _MJVTBL_INT32
                int32                           Health;                                 ///< Offset 0x0020 Type _MJVTBL_INT32
                int32                           NewStatValue;                           ///< Offset 0x0024 Type _MJVTBL_INT32
                int32                           TriggerAbilityID;                       ///< Offset 0x0028 Type _MJVTBL_INT32
                int32                           ChangedAbilityID;                       ///< Offset 0x002C Type _MJVTBL_INT32
                int32                           CooldownRemaining;                      ///< Offset 0x0030 Type _MJVTBL_INT32
                int32                           LockdownRemaining;                      ///< Offset 0x0034 Type _MJVTBL_INT32
                int32                           BroadcastTextID;                        ///< Offset 0x0038 Type _MJVTBL_INT32
            };

            uint32                                AbilityEffectID;                              ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint16                                Flags;                                        ///< Offset 0x0004 Type _MJVTBL_UINT16
            uint16                                SourceAuraInstanceID;                         ///< Offset 0x0006 Type _MJVTBL_UINT16
            uint16                                TurnInstanceID;                               ///< Offset 0x0008 Type _MJVTBL_UINT16
            int8                                  PetBattleEffectType;                          ///< Offset 0x000A Type _MJVTBL_INT8
            uint8                                 CasterPBOID;                                  ///< Offset 0x000B Type _MJVTBL_UINT8
            uint8                                 StackDepth;                                   ///< Offset 0x000C Type _MJVTBL_UINT8
            std::vector<JamPetBattleEffectTarget> Targets;                                      ///< Offset 0x0010 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffectTarget>::MJVTBL
        };

        struct JamPetBattleActiveAbility
        {
            int32 AbilityID;                ///< Offset 0x0000 Type _MJVTBL_INT32
            int16 CooldownRemaining;        ///< Offset 0x0004 Type _MJVTBL_INT16
            int16 LockdownRemaining;        ///< Offset 0x0006 Type _MJVTBL_INT16
            int8  AbilityIndex;             ///< Offset 0x0008 Type _MJVTBL_INT8
            uint8 Pboid;                    ///< Offset 0x0009 Type _MJVTBL_UINT8
        };

        int32                                  CurRound;                                      ///< Offset 0x0000 Type _MJVTBL_INT32
        int8                                   NextPetBattleState;                            ///< Offset 0x0004 Type _MJVTBL_INT8
        std::vector<JamPetBattleEffect>        Effects;                                       ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffect>::MJVTBL
        std::vector<int8>                      PetXDied;                                      ///< Offset 0x0020 Type MakeMJVTblForArrayOf<signedchar,&(MJVTBL_INT8)>::MJVTBL
        std::vector<JamPetBattleActiveAbility> Cooldowns;                                     ///< Offset 0x0038 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAbility>::MJVTBL
        uint8                                  NextInputFlags[2];                             ///< Offset 0x0050 Type MakeMJVTblForFixedArrayOf<unsignedchar,2,&(MJVTBL_UINT8)>::MJVTBL
        int8                                   NextTrapStatus[2];                             ///< Offset 0x0052 Type MakeMJVTblForFixedArrayOf<signedchar,2,&(MJVTBL_INT8)>::MJVTBL
        uint16                                 RoundTimeSecs[2];                              ///< Offset 0x0054 Type MakeMJVTblForFixedArrayOf<unsignedshort,2,&(MJVTBL_UINT16)>::MJVTBL
    };

    MsgData_Struct MsgData;                ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint64         SceneObjectGUID;        ///< Offset 0x0058 Type _MJVTBL_UINT64
};

///< SMSG_SCENE_OBJECT_PET_BATTLE_ROUND_RESULT
struct ClientSceneObjectPetBattleRoundResult
{
    struct MsgData_Struct
    {
        struct JamPetBattleEffect
        {
            struct JamPetBattleEffectTarget
            {
                JAM_PET_BATTLE_EFFECT_TARGET_EX Type;                                   ///< Offset 0x0000 Type _MJVTBL_JAM_PET_BATTLE_EFFECT_TARGET_EX
                uint8                           Petx;                                   ///< Offset 0x0004 Type _MJVTBL_UINT8
                uint32                          AuraInstanceID;                         ///< Offset 0x0008 Type _MJVTBL_UINT32
                uint32                          AuraAbilityID;                          ///< Offset 0x000C Type _MJVTBL_UINT32
                int32                           RoundsRemaining;                        ///< Offset 0x0010 Type _MJVTBL_INT32
                int32                           CurrentRound;                           ///< Offset 0x0014 Type _MJVTBL_INT32
                uint32                          StateID;                                ///< Offset 0x0018 Type _MJVTBL_UINT32
                int32                           StateValue;                             ///< Offset 0x001C Type _MJVTBL_INT32
                int32                           Health;                                 ///< Offset 0x0020 Type _MJVTBL_INT32
                int32                           NewStatValue;                           ///< Offset 0x0024 Type _MJVTBL_INT32
                int32                           TriggerAbilityID;                       ///< Offset 0x0028 Type _MJVTBL_INT32
                int32                           ChangedAbilityID;                       ///< Offset 0x002C Type _MJVTBL_INT32
                int32                           CooldownRemaining;                      ///< Offset 0x0030 Type _MJVTBL_INT32
                int32                           LockdownRemaining;                      ///< Offset 0x0034 Type _MJVTBL_INT32
                int32                           BroadcastTextID;                        ///< Offset 0x0038 Type _MJVTBL_INT32
            };

            uint32                                AbilityEffectID;                              ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint16                                Flags;                                        ///< Offset 0x0004 Type _MJVTBL_UINT16
            uint16                                SourceAuraInstanceID;                         ///< Offset 0x0006 Type _MJVTBL_UINT16
            uint16                                TurnInstanceID;                               ///< Offset 0x0008 Type _MJVTBL_UINT16
            int8                                  PetBattleEffectType;                          ///< Offset 0x000A Type _MJVTBL_INT8
            uint8                                 CasterPBOID;                                  ///< Offset 0x000B Type _MJVTBL_UINT8
            uint8                                 StackDepth;                                   ///< Offset 0x000C Type _MJVTBL_UINT8
            std::vector<JamPetBattleEffectTarget> Targets;                                      ///< Offset 0x0010 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffectTarget>::MJVTBL
        };

        struct JamPetBattleActiveAbility
        {
            int32 AbilityID;                ///< Offset 0x0000 Type _MJVTBL_INT32
            int16 CooldownRemaining;        ///< Offset 0x0004 Type _MJVTBL_INT16
            int16 LockdownRemaining;        ///< Offset 0x0006 Type _MJVTBL_INT16
            int8  AbilityIndex;             ///< Offset 0x0008 Type _MJVTBL_INT8
            uint8 Pboid;                    ///< Offset 0x0009 Type _MJVTBL_UINT8
        };

        int32                                  CurRound;                                      ///< Offset 0x0000 Type _MJVTBL_INT32
        int8                                   NextPetBattleState;                            ///< Offset 0x0004 Type _MJVTBL_INT8
        std::vector<JamPetBattleEffect>        Effects;                                       ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffect>::MJVTBL
        std::vector<int8>                      PetXDied;                                      ///< Offset 0x0020 Type MakeMJVTblForArrayOf<signedchar,&(MJVTBL_INT8)>::MJVTBL
        std::vector<JamPetBattleActiveAbility> Cooldowns;                                     ///< Offset 0x0038 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAbility>::MJVTBL
        uint8                                  NextInputFlags[2];                             ///< Offset 0x0050 Type MakeMJVTblForFixedArrayOf<unsignedchar,2,&(MJVTBL_UINT8)>::MJVTBL
        int8                                   NextTrapStatus[2];                             ///< Offset 0x0052 Type MakeMJVTblForFixedArrayOf<signedchar,2,&(MJVTBL_INT8)>::MJVTBL
        uint16                                 RoundTimeSecs[2];                              ///< Offset 0x0054 Type MakeMJVTblForFixedArrayOf<unsignedshort,2,&(MJVTBL_UINT16)>::MJVTBL
    };

    MsgData_Struct MsgData;                ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint64         SceneObjectGUID;        ///< Offset 0x0058 Type _MJVTBL_UINT64
};

///< SMSG_SCENE_OBJECT_PET_BATTLE_REPLACEMENTS_MADE
struct ClientSceneObjectPetBattleReplacementsMade
{
    struct MsgData_Struct
    {
        struct JamPetBattleEffect
        {
            struct JamPetBattleEffectTarget
            {
                JAM_PET_BATTLE_EFFECT_TARGET_EX Type;                                   ///< Offset 0x0000 Type _MJVTBL_JAM_PET_BATTLE_EFFECT_TARGET_EX
                uint8                           Petx;                                   ///< Offset 0x0004 Type _MJVTBL_UINT8
                uint32                          AuraInstanceID;                         ///< Offset 0x0008 Type _MJVTBL_UINT32
                uint32                          AuraAbilityID;                          ///< Offset 0x000C Type _MJVTBL_UINT32
                int32                           RoundsRemaining;                        ///< Offset 0x0010 Type _MJVTBL_INT32
                int32                           CurrentRound;                           ///< Offset 0x0014 Type _MJVTBL_INT32
                uint32                          StateID;                                ///< Offset 0x0018 Type _MJVTBL_UINT32
                int32                           StateValue;                             ///< Offset 0x001C Type _MJVTBL_INT32
                int32                           Health;                                 ///< Offset 0x0020 Type _MJVTBL_INT32
                int32                           NewStatValue;                           ///< Offset 0x0024 Type _MJVTBL_INT32
                int32                           TriggerAbilityID;                       ///< Offset 0x0028 Type _MJVTBL_INT32
                int32                           ChangedAbilityID;                       ///< Offset 0x002C Type _MJVTBL_INT32
                int32                           CooldownRemaining;                      ///< Offset 0x0030 Type _MJVTBL_INT32
                int32                           LockdownRemaining;                      ///< Offset 0x0034 Type _MJVTBL_INT32
                int32                           BroadcastTextID;                        ///< Offset 0x0038 Type _MJVTBL_INT32
            };

            uint32                                AbilityEffectID;                              ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint16                                Flags;                                        ///< Offset 0x0004 Type _MJVTBL_UINT16
            uint16                                SourceAuraInstanceID;                         ///< Offset 0x0006 Type _MJVTBL_UINT16
            uint16                                TurnInstanceID;                               ///< Offset 0x0008 Type _MJVTBL_UINT16
            int8                                  PetBattleEffectType;                          ///< Offset 0x000A Type _MJVTBL_INT8
            uint8                                 CasterPBOID;                                  ///< Offset 0x000B Type _MJVTBL_UINT8
            uint8                                 StackDepth;                                   ///< Offset 0x000C Type _MJVTBL_UINT8
            std::vector<JamPetBattleEffectTarget> Targets;                                      ///< Offset 0x0010 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffectTarget>::MJVTBL
        };

        struct JamPetBattleActiveAbility
        {
            int32 AbilityID;                ///< Offset 0x0000 Type _MJVTBL_INT32
            int16 CooldownRemaining;        ///< Offset 0x0004 Type _MJVTBL_INT16
            int16 LockdownRemaining;        ///< Offset 0x0006 Type _MJVTBL_INT16
            int8  AbilityIndex;             ///< Offset 0x0008 Type _MJVTBL_INT8
            uint8 Pboid;                    ///< Offset 0x0009 Type _MJVTBL_UINT8
        };

        int32                                  CurRound;                                      ///< Offset 0x0000 Type _MJVTBL_INT32
        int8                                   NextPetBattleState;                            ///< Offset 0x0004 Type _MJVTBL_INT8
        std::vector<JamPetBattleEffect>        Effects;                                       ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffect>::MJVTBL
        std::vector<int8>                      PetXDied;                                      ///< Offset 0x0020 Type MakeMJVTblForArrayOf<signedchar,&(MJVTBL_INT8)>::MJVTBL
        std::vector<JamPetBattleActiveAbility> Cooldowns;                                     ///< Offset 0x0038 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAbility>::MJVTBL
        uint8                                  NextInputFlags[2];                             ///< Offset 0x0050 Type MakeMJVTblForFixedArrayOf<unsignedchar,2,&(MJVTBL_UINT8)>::MJVTBL
        int8                                   NextTrapStatus[2];                             ///< Offset 0x0052 Type MakeMJVTblForFixedArrayOf<signedchar,2,&(MJVTBL_INT8)>::MJVTBL
        uint16                                 RoundTimeSecs[2];                              ///< Offset 0x0054 Type MakeMJVTblForFixedArrayOf<unsignedshort,2,&(MJVTBL_UINT16)>::MJVTBL
    };

    MsgData_Struct MsgData;                ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint64         SceneObjectGUID;        ///< Offset 0x0058 Type _MJVTBL_UINT64
};

///< SMSG_SCENE_OBJECT_PET_BATTLE_FINAL_ROUND
struct ClientSceneObjectPetBattleFinalRound
{
    struct MsgData_Struct
    {
        struct JamPetBattleFinalPet
        {
            bool   Captured;            ///< Offset 0x0000 Type _MJVTBL_BOOL
            bool   Caged;               ///< Offset 0x0001 Type _MJVTBL_BOOL
            bool   AwardedXP;           ///< Offset 0x0002 Type _MJVTBL_BOOL
            bool   SeenAction;          ///< Offset 0x0003 Type _MJVTBL_BOOL
            uint16 Level;               ///< Offset 0x0004 Type _MJVTBL_UINT16
            uint16 Xp;                  ///< Offset 0x0006 Type _MJVTBL_UINT16
            int32  Health;              ///< Offset 0x0008 Type _MJVTBL_INT32
            int32  MaxHealth;           ///< Offset 0x000C Type _MJVTBL_INT32
            uint16 InitialLevel;        ///< Offset 0x0010 Type _MJVTBL_UINT16
            uint8  Pboid;               ///< Offset 0x0012 Type _MJVTBL_UINT8
        };

        bool                              Abandoned;                                ///< Offset 0x0000 Type _MJVTBL_BOOL
        bool                              PvpBattle;                                ///< Offset 0x0001 Type _MJVTBL_BOOL
        std::vector<JamPetBattleFinalPet> Pets;                                     ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamPetBattleFinalPet>::MJVTBL
        bool                              Winners[2];                               ///< Offset 0x0020 Type MakeMJVTblForFixedArrayOf<bool,2,&(MJVTBL_BOOL)>::MJVTBL
        int32                             NpcCreatureID[2];                         ///< Offset 0x0024 Type MakeMJVTblForFixedArrayOf<int,2,&(MJVTBL_INT32)>::MJVTBL
    };

    uint64         SceneObjectGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    MsgData_Struct MsgData;                ///< Offset 0x0008 Type _MJVTBL_STRUCT
};

///< SMSG_SCENE_OBJECT_PET_BATTLE_FINISHED
struct ClientSceneObjectPetBattleFinished
{
    uint64 SceneObjectGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_SEND_ALL_ITEM_DURABILITY
struct ClientSendAllItemDurability
{
    std::vector<int32> MaxDurability;             ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_BATTLE_PET_UPDATES
struct ClientBattlePetUpdates
{
    struct JamClientBattlePet
    {
        struct JamClientBattlePetOwnerInfo
        {
            uint64 Guid;                      ///< Offset 0x0000 Type _MJVTBL_UINT64
            uint32 PlayerVirtualRealm;        ///< Offset 0x0008 Type _MJVTBL_UINT32
            uint32 PlayerNativeRealm;         ///< Offset 0x000C Type _MJVTBL_UINT32
        };

        uint64                                BattlePetGUID;                                ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32                                 SpeciesID;                                    ///< Offset 0x0008 Type _MJVTBL_INT32
        int32                                 CreatureID;                                   ///< Offset 0x000C Type _MJVTBL_INT32
        int32                                 DisplayID;                                    ///< Offset 0x0010 Type _MJVTBL_INT32
        uint16                                BreedID;                                      ///< Offset 0x0014 Type _MJVTBL_UINT16
        uint16                                Level;                                        ///< Offset 0x0016 Type _MJVTBL_UINT16
        uint16                                Xp;                                           ///< Offset 0x0018 Type _MJVTBL_UINT16
        uint16                                BattlePetDBFlags;                             ///< Offset 0x001A Type _MJVTBL_UINT16
        int32                                 Power;                                        ///< Offset 0x001C Type _MJVTBL_INT32
        int32                                 Health;                                       ///< Offset 0x0020 Type _MJVTBL_INT32
        int32                                 MaxHealth;                                    ///< Offset 0x0024 Type _MJVTBL_INT32
        int32                                 Speed;                                        ///< Offset 0x0028 Type _MJVTBL_INT32
        std::string                           CustomName;                                   ///< Offset 0x002C Type _MJVTBL_STRING
        Optional<JamClientBattlePetOwnerInfo> OwnerInfo;                                    ///< Offset 0x0070 Type MakeMJVTblForOptionalStruct<JamClientBattlePetOwnerInfo>::MJVTBL
        bool                                  NoRename;                                     ///< Offset 0x0088 Type _MJVTBL_BOOL
        uint8                                 BreedQuality;                                 ///< Offset 0x0089 Type _MJVTBL_UINT8
    };

    bool                            AddedPet;                               ///< Offset 0x0000 Type _MJVTBL_BOOL
    std::vector<JamClientBattlePet> Pets;                                   ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamClientBattlePet>::MJVTBL
};

///< SMSG_BATTLE_PET_TRAP_LEVEL
struct ClientBattlePetTrapLevel
{
    int16 TrapLevel;        ///< Offset 0x0000 Type _MJVTBL_INT16
};

///< SMSG_PET_BATTLE_SLOT_UPDATES
struct ClientPetBattleSlotUpdates
{
    struct JamClientPetBattleSlot
    {
        uint64 BattlePetGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32  CollarID;             ///< Offset 0x0008 Type _MJVTBL_INT32
        uint8  SlotIndex;            ///< Offset 0x000C Type _MJVTBL_UINT8
        bool   Locked;               ///< Offset 0x000D Type _MJVTBL_BOOL
    };

    bool                                NewSlotUnlocked;                            ///< Offset 0x0000 Type _MJVTBL_BOOL
    bool                                AutoSlotted;                                ///< Offset 0x0001 Type _MJVTBL_BOOL
    std::vector<JamClientPetBattleSlot> Slots;                                      ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamClientPetBattleSlot>::MJVTBL
};

///< SMSG_BATTLE_PET_JOURNAL_LOCK_ACQUIRED
struct ClientBattlePetJournalLockAcquired
{
};

///< SMSG_BATTLE_PET_JOURNAL_LOCK_DENIED
struct ClientBattlePetJournalLockDenied
{
};

///< SMSG_BATTLE_PET_JOURNAL
struct ClientBattlePetJournal
{
    struct JamClientBattlePet
    {
        struct JamClientBattlePetOwnerInfo
        {
            uint64 Guid;                      ///< Offset 0x0000 Type _MJVTBL_UINT64
            uint32 PlayerVirtualRealm;        ///< Offset 0x0008 Type _MJVTBL_UINT32
            uint32 PlayerNativeRealm;         ///< Offset 0x000C Type _MJVTBL_UINT32
        };

        uint64                                BattlePetGUID;                                ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32                                 SpeciesID;                                    ///< Offset 0x0008 Type _MJVTBL_INT32
        int32                                 CreatureID;                                   ///< Offset 0x000C Type _MJVTBL_INT32
        int32                                 DisplayID;                                    ///< Offset 0x0010 Type _MJVTBL_INT32
        uint16                                BreedID;                                      ///< Offset 0x0014 Type _MJVTBL_UINT16
        uint16                                Level;                                        ///< Offset 0x0016 Type _MJVTBL_UINT16
        uint16                                Xp;                                           ///< Offset 0x0018 Type _MJVTBL_UINT16
        uint16                                BattlePetDBFlags;                             ///< Offset 0x001A Type _MJVTBL_UINT16
        int32                                 Power;                                        ///< Offset 0x001C Type _MJVTBL_INT32
        int32                                 Health;                                       ///< Offset 0x0020 Type _MJVTBL_INT32
        int32                                 MaxHealth;                                    ///< Offset 0x0024 Type _MJVTBL_INT32
        int32                                 Speed;                                        ///< Offset 0x0028 Type _MJVTBL_INT32
        std::string                           CustomName;                                   ///< Offset 0x002C Type _MJVTBL_STRING
        Optional<JamClientBattlePetOwnerInfo> OwnerInfo;                                    ///< Offset 0x0070 Type MakeMJVTblForOptionalStruct<JamClientBattlePetOwnerInfo>::MJVTBL
        bool                                  NoRename;                                     ///< Offset 0x0088 Type _MJVTBL_BOOL
        uint8                                 BreedQuality;                                 ///< Offset 0x0089 Type _MJVTBL_UINT8
    };

    struct JamClientPetBattleSlot
    {
        uint64 BattlePetGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32  CollarID;             ///< Offset 0x0008 Type _MJVTBL_INT32
        uint8  SlotIndex;            ///< Offset 0x000C Type _MJVTBL_UINT8
        bool   Locked;               ///< Offset 0x000D Type _MJVTBL_BOOL
    };

    bool                                HasJournalLock;                             ///< Offset 0x0000 Type _MJVTBL_BOOL
    std::vector<JamClientBattlePet>     Pets;                                       ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamClientBattlePet>::MJVTBL
    int16                               TrapLevel;                                  ///< Offset 0x0020 Type _MJVTBL_INT16
    std::vector<JamClientPetBattleSlot> Slots;                                      ///< Offset 0x0028 Type MakeMJVTblForArrayOfStruct<JamClientPetBattleSlot>::MJVTBL
};

///< SMSG_BATTLE_PET_DELETED
struct ClientBattlePetDeleted
{
    uint64 BattlePetGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_BATTLE_PET_REVOKED
struct ClientBattlePetRevoked
{
    uint64 BattlePetGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_BATTLE_PET_RESTORED
struct ClientBattlePetRestored
{
    uint64 BattlePetGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_BATTLE_PETS_HEALED
struct ClientBattlePetsHealed
{
};

///< SMSG_BATTLE_PET_LICENSE_CHANGED
struct ClientBattlePetLicenseChanged
{
};

///< SMSG_PARTY_UPDATE
struct ClientPartyUpdate
{
    struct JamCliPartyLootSettings
    {
        uint64 LootMaster;           ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint8  LootMethod;           ///< Offset 0x0008 Type _MJVTBL_UINT8
        uint8  LootThreshold;        ///< Offset 0x0009 Type _MJVTBL_UINT8
    };

    struct JamCliPartyLFGInfo
    {
        uint8  MyLfgFlags;                ///< Offset 0x0000 Type _MJVTBL_UINT8
        uint32 LfgSlot;                   ///< Offset 0x0004 Type _MJVTBL_UINT32
        uint32 MyLfgRandomSlot;           ///< Offset 0x0008 Type _MJVTBL_UINT32
        bool   LfgAborted;                ///< Offset 0x000C Type _MJVTBL_BOOL
        uint8  MyLfgPartialClear;         ///< Offset 0x000D Type _MJVTBL_UINT8
        float  MyLfgGearDiff;             ///< Offset 0x0010 Type _MJVTBL_FLOAT
        uint8  MyLfgStrangerCount;        ///< Offset 0x0014 Type _MJVTBL_UINT8
        uint8  MyLfgKickVoteCount;        ///< Offset 0x0015 Type _MJVTBL_UINT8
        uint8  LfgBootCount;              ///< Offset 0x0016 Type _MJVTBL_UINT8
        bool   MyLfgFirstReward;          ///< Offset 0x0017 Type _MJVTBL_BOOL
    };

    struct JamCliPartyPlayerInfo
    {
        std::string Name;                 ///< Offset 0x0000 Type _MJVTBL_STRING
        uint64      Guid;                 ///< Offset 0x0038 Type _MJVTBL_UINT64
        uint8       Connected;            ///< Offset 0x0040 Type _MJVTBL_UINT8
        uint8       Subgroup;             ///< Offset 0x0041 Type _MJVTBL_UINT8
        uint8       Flags;                ///< Offset 0x0042 Type _MJVTBL_UINT8
        uint8       RolesAssigned;        ///< Offset 0x0043 Type _MJVTBL_UINT8
    };

    struct JamCliPartyDifficultySettings
    {
        uint32 DungeonDifficultyID;        ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32 RaidDifficultyID;           ///< Offset 0x0004 Type _MJVTBL_UINT32
    };

    uint8                                   PartyFlags;                                     ///< Offset 0x0000 Type _MJVTBL_UINT8
    Optional<JamCliPartyLootSettings>       LootSettings;                                   ///< Offset 0x0008 Type MakeMJVTblForOptionalStruct<JamCliPartyLootSettings>::MJVTBL
    Optional<JamCliPartyLFGInfo>            LfgInfo;                                        ///< Offset 0x0020 Type MakeMJVTblForOptionalStruct<JamCliPartyLFGInfo>::MJVTBL
    uint64                                  LeaderGUID;                                     ///< Offset 0x0040 Type _MJVTBL_UINT64
    uint8                                   PartyType;                                      ///< Offset 0x0048 Type _MJVTBL_UINT8
    uint64                                  PartyGUID;                                      ///< Offset 0x0050 Type _MJVTBL_UINT64
    uint8                                   PartyIndex;                                     ///< Offset 0x0058 Type _MJVTBL_UINT8
    std::vector<JamCliPartyPlayerInfo>      PlayerList;                                     ///< Offset 0x0060 Type MakeMJVTblForArrayOfStruct<JamCliPartyPlayerInfo>::MJVTBL
    uint32                                  SequenceNum;                                    ///< Offset 0x0078 Type _MJVTBL_UINT32
    Optional<JamCliPartyDifficultySettings> DifficultySettings;                             ///< Offset 0x007C Type MakeMJVTblForOptionalStruct<JamCliPartyDifficultySettings>::MJVTBL
    int32                                   MyIndex;                                        ///< Offset 0x0088 Type _MJVTBL_INT32
};

///< SMSG_READY_CHECK_STARTED
struct ClientReadyCheckStarted
{
    uint8  PartyIndex;           ///< Offset 0x0000 Type _MJVTBL_UINT8
    uint64 InitiatorGUID;        ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint64 PartyGUID;            ///< Offset 0x0010 Type _MJVTBL_UINT64
    uint32 Duration;             ///< Offset 0x0018 Type _MJVTBL_TIME_T
};

///< SMSG_READY_CHECK_RESPONSE
struct ClientReadyCheckResponse
{
    bool   IsReady;          ///< Offset 0x0000 Type _MJVTBL_BOOL
    uint64 Player;           ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint64 PartyGUID;        ///< Offset 0x0010 Type _MJVTBL_UINT64
};

///< SMSG_READY_CHECK_COMPLETED
struct ClientReadyCheckCompleted
{
    uint64 PartyGUID;         ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint8  PartyIndex;        ///< Offset 0x0008 Type _MJVTBL_UINT8
};

///< SMSG_PET_BATTLE_REQUEST_FAILED
struct ClientPetBattleRequestFailed
{
    uint8 Reason;        ///< Offset 0x0000 Type _MJVTBL_UINT8
};

///< SMSG_PET_BATTLE_PVPCHALLENGE
struct ClientPetBattlePVPChallenge
{
    struct Location_Struct
    {
        int32        LocationResult;            ///< Offset 0x0000 Type _MJVTBL_INT32
        G3D::Vector3 BattleOrigin;              ///< Offset 0x0004 Type _MJVTBL_V3
        float        BattleFacing;              ///< Offset 0x0010 Type _MJVTBL_FLOAT
        G3D::Vector3 PlayerPositions[2];        ///< Offset 0x0014 Type MakeMJVTblForFixedArrayOf<C3Vector,2,&(MJVTBL_V3)>::MJVTBL
    };

    uint64          ChallengerGUID;         ///< Offset 0x0000 Type _MJVTBL_UINT64
    Location_Struct Location;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
};

///< SMSG_PET_BATTLE_FINALIZE_LOCATION
struct ClientPetBattleFinalizeLocation
{
    struct Location_Struct
    {
        int32        LocationResult;            ///< Offset 0x0000 Type _MJVTBL_INT32
        G3D::Vector3 BattleOrigin;              ///< Offset 0x0004 Type _MJVTBL_V3
        float        BattleFacing;              ///< Offset 0x0010 Type _MJVTBL_FLOAT
        G3D::Vector3 PlayerPositions[2];        ///< Offset 0x0014 Type MakeMJVTblForFixedArrayOf<C3Vector,2,&(MJVTBL_V3)>::MJVTBL
    };

    Location_Struct Location;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_PET_BATTLE_INITIAL_UPDATE
struct ClientPetBattleInitialUpdate
{
    struct MsgData_Struct
    {
        struct JamPetBattlePlayerUpdate
        {
            struct JamPetBattlePetUpdate
            {
                struct JamPetBattleActiveAbility
                {
                    int32 AbilityID;                ///< Offset 0x0000 Type _MJVTBL_INT32
                    int16 CooldownRemaining;        ///< Offset 0x0004 Type _MJVTBL_INT16
                    int16 LockdownRemaining;        ///< Offset 0x0006 Type _MJVTBL_INT16
                    int8  AbilityIndex;             ///< Offset 0x0008 Type _MJVTBL_INT8
                    uint8 Pboid;                    ///< Offset 0x0009 Type _MJVTBL_UINT8
                };

                struct JamPetBattleActiveAura
                {
                    int32  AbilityID;              ///< Offset 0x0000 Type _MJVTBL_INT32
                    uint32 InstanceID;             ///< Offset 0x0004 Type _MJVTBL_UINT32
                    int32  RoundsRemaining;        ///< Offset 0x0008 Type _MJVTBL_INT32
                    int32  CurrentRound;           ///< Offset 0x000C Type _MJVTBL_INT32
                    uint8  CasterPBOID;            ///< Offset 0x0010 Type _MJVTBL_UINT8
                };

                struct JamPetBattleActiveState
                {
                    uint32 StateID;           ///< Offset 0x0000 Type _MJVTBL_UINT32
                    int32  StateValue;        ///< Offset 0x0004 Type _MJVTBL_INT32
                };

                uint64                                 BattlePetGUID;                                 ///< Offset 0x0000 Type _MJVTBL_UINT64
                int32                                  SpeciesID;                                     ///< Offset 0x0008 Type _MJVTBL_INT32
                int32                                  DisplayID;                                     ///< Offset 0x000C Type _MJVTBL_INT32
                int32                                  CollarID;                                      ///< Offset 0x0010 Type _MJVTBL_INT32
                int16                                  Level;                                         ///< Offset 0x0014 Type _MJVTBL_INT16
                int16                                  Xp;                                            ///< Offset 0x0016 Type _MJVTBL_INT16
                int32                                  CurHealth;                                     ///< Offset 0x0018 Type _MJVTBL_INT32
                int32                                  MaxHealth;                                     ///< Offset 0x001C Type _MJVTBL_INT32
                int32                                  Power;                                         ///< Offset 0x0020 Type _MJVTBL_INT32
                int32                                  Speed;                                         ///< Offset 0x0024 Type _MJVTBL_INT32
                int32                                  NpcTeamMemberID;                               ///< Offset 0x0028 Type _MJVTBL_INT32
                uint16                                 BreedQuality;                                  ///< Offset 0x002C Type _MJVTBL_UINT16
                uint16                                 StatusFlags;                                   ///< Offset 0x002E Type _MJVTBL_UINT16
                int8                                   Slot;                                          ///< Offset 0x0030 Type _MJVTBL_INT8
                std::string                            CustomName;                                    ///< Offset 0x0031 Type _MJVTBL_STRING
                std::vector<JamPetBattleActiveAbility> Abilities;                                     ///< Offset 0x0078 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAbility>::MJVTBL
                std::vector<JamPetBattleActiveAura>    Auras;                                         ///< Offset 0x0090 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAura>::MJVTBL
                std::vector<JamPetBattleActiveState>   States;                                        ///< Offset 0x00A8 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveState>::MJVTBL
            };

            uint64                             CharacterID;                               ///< Offset 0x0000 Type _MJVTBL_UINT64
            int32                              TrapAbilityID;                             ///< Offset 0x0008 Type _MJVTBL_INT32
            int32                              TrapStatus;                                ///< Offset 0x000C Type _MJVTBL_INT32
            uint16                             RoundTimeSecs;                             ///< Offset 0x0010 Type _MJVTBL_UINT16
            std::vector<JamPetBattlePetUpdate> Pets;                                      ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamPetBattlePetUpdate>::MJVTBL
            int8                               FrontPet;                                  ///< Offset 0x0030 Type _MJVTBL_INT8
            uint8                              InputFlags;                                ///< Offset 0x0031 Type _MJVTBL_UINT8
        };

        struct JamPetBattleEnviroUpdate
        {
            struct JamPetBattleActiveAura
            {
                int32  AbilityID;              ///< Offset 0x0000 Type _MJVTBL_INT32
                uint32 InstanceID;             ///< Offset 0x0004 Type _MJVTBL_UINT32
                int32  RoundsRemaining;        ///< Offset 0x0008 Type _MJVTBL_INT32
                int32  CurrentRound;           ///< Offset 0x000C Type _MJVTBL_INT32
                uint8  CasterPBOID;            ///< Offset 0x0010 Type _MJVTBL_UINT8
            };

            struct JamPetBattleActiveState
            {
                uint32 StateID;           ///< Offset 0x0000 Type _MJVTBL_UINT32
                int32  StateValue;        ///< Offset 0x0004 Type _MJVTBL_INT32
            };

            std::vector<JamPetBattleActiveAura>  Auras;                                       ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAura>::MJVTBL
            std::vector<JamPetBattleActiveState> States;                                      ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveState>::MJVTBL
        };

        uint16                   WaitingForFrontPetsMaxSecs;        ///< Offset 0x0000 Type _MJVTBL_UINT16
        uint16                   PvpMaxRoundTime;                   ///< Offset 0x0002 Type _MJVTBL_UINT16
        int32                    CurRound;                          ///< Offset 0x0004 Type _MJVTBL_INT32
        uint32                   NpcCreatureID;                     ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32                   NpcDisplayID;                      ///< Offset 0x000C Type _MJVTBL_UINT32
        int8                     CurPetBattleState;                 ///< Offset 0x0010 Type _MJVTBL_INT8
        uint8                    ForfeitPenalty;                    ///< Offset 0x0011 Type _MJVTBL_UINT8
        uint64                   InitialWildPetGUID;                ///< Offset 0x0018 Type _MJVTBL_UINT64
        bool                     IsPVP;                             ///< Offset 0x0020 Type _MJVTBL_BOOL
        bool                     CanAwardXP;                        ///< Offset 0x0021 Type _MJVTBL_BOOL
        JamPetBattlePlayerUpdate Players[2];                        ///< Offset 0x0028 Type MakeMJVTblForFixedArrayOfStruct<JamPetBattlePlayerUpdate,2>::MJVTBL
        JamPetBattleEnviroUpdate Enviros[3];                        ///< Offset 0x0098 Type MakeMJVTblForFixedArrayOfStruct<JamPetBattleEnviroUpdate,3>::MJVTBL
    };

    MsgData_Struct MsgData;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_PET_BATTLE_FIRST_ROUND
struct ClientPetBattleFirstRound
{
    struct MsgData_Struct
    {
        struct JamPetBattleEffect
        {
            struct JamPetBattleEffectTarget
            {
                JAM_PET_BATTLE_EFFECT_TARGET_EX Type;                                   ///< Offset 0x0000 Type _MJVTBL_JAM_PET_BATTLE_EFFECT_TARGET_EX
                uint8                           Petx;                                   ///< Offset 0x0004 Type _MJVTBL_UINT8
                uint32                          AuraInstanceID;                         ///< Offset 0x0008 Type _MJVTBL_UINT32
                uint32                          AuraAbilityID;                          ///< Offset 0x000C Type _MJVTBL_UINT32
                int32                           RoundsRemaining;                        ///< Offset 0x0010 Type _MJVTBL_INT32
                int32                           CurrentRound;                           ///< Offset 0x0014 Type _MJVTBL_INT32
                uint32                          StateID;                                ///< Offset 0x0018 Type _MJVTBL_UINT32
                int32                           StateValue;                             ///< Offset 0x001C Type _MJVTBL_INT32
                int32                           Health;                                 ///< Offset 0x0020 Type _MJVTBL_INT32
                int32                           NewStatValue;                           ///< Offset 0x0024 Type _MJVTBL_INT32
                int32                           TriggerAbilityID;                       ///< Offset 0x0028 Type _MJVTBL_INT32
                int32                           ChangedAbilityID;                       ///< Offset 0x002C Type _MJVTBL_INT32
                int32                           CooldownRemaining;                      ///< Offset 0x0030 Type _MJVTBL_INT32
                int32                           LockdownRemaining;                      ///< Offset 0x0034 Type _MJVTBL_INT32
                int32                           BroadcastTextID;                        ///< Offset 0x0038 Type _MJVTBL_INT32
            };

            uint32                                AbilityEffectID;                              ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint16                                Flags;                                        ///< Offset 0x0004 Type _MJVTBL_UINT16
            uint16                                SourceAuraInstanceID;                         ///< Offset 0x0006 Type _MJVTBL_UINT16
            uint16                                TurnInstanceID;                               ///< Offset 0x0008 Type _MJVTBL_UINT16
            int8                                  PetBattleEffectType;                          ///< Offset 0x000A Type _MJVTBL_INT8
            uint8                                 CasterPBOID;                                  ///< Offset 0x000B Type _MJVTBL_UINT8
            uint8                                 StackDepth;                                   ///< Offset 0x000C Type _MJVTBL_UINT8
            std::vector<JamPetBattleEffectTarget> Targets;                                      ///< Offset 0x0010 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffectTarget>::MJVTBL
        };

        struct JamPetBattleActiveAbility
        {
            int32 AbilityID;                ///< Offset 0x0000 Type _MJVTBL_INT32
            int16 CooldownRemaining;        ///< Offset 0x0004 Type _MJVTBL_INT16
            int16 LockdownRemaining;        ///< Offset 0x0006 Type _MJVTBL_INT16
            int8  AbilityIndex;             ///< Offset 0x0008 Type _MJVTBL_INT8
            uint8 Pboid;                    ///< Offset 0x0009 Type _MJVTBL_UINT8
        };

        int32                                  CurRound;                                      ///< Offset 0x0000 Type _MJVTBL_INT32
        int8                                   NextPetBattleState;                            ///< Offset 0x0004 Type _MJVTBL_INT8
        std::vector<JamPetBattleEffect>        Effects;                                       ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffect>::MJVTBL
        std::vector<int8>                      PetXDied;                                      ///< Offset 0x0020 Type MakeMJVTblForArrayOf<signedchar,&(MJVTBL_INT8)>::MJVTBL
        std::vector<JamPetBattleActiveAbility> Cooldowns;                                     ///< Offset 0x0038 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAbility>::MJVTBL
        uint8                                  NextInputFlags[2];                             ///< Offset 0x0050 Type MakeMJVTblForFixedArrayOf<unsignedchar,2,&(MJVTBL_UINT8)>::MJVTBL
        int8                                   NextTrapStatus[2];                             ///< Offset 0x0052 Type MakeMJVTblForFixedArrayOf<signedchar,2,&(MJVTBL_INT8)>::MJVTBL
        uint16                                 RoundTimeSecs[2];                              ///< Offset 0x0054 Type MakeMJVTblForFixedArrayOf<unsignedshort,2,&(MJVTBL_UINT16)>::MJVTBL
    };

    MsgData_Struct MsgData;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_PET_BATTLE_ROUND_RESULT
struct ClientPetBattleRoundResult
{
    struct MsgData_Struct
    {
        struct JamPetBattleEffect
        {
            struct JamPetBattleEffectTarget
            {
                JAM_PET_BATTLE_EFFECT_TARGET_EX Type;                                   ///< Offset 0x0000 Type _MJVTBL_JAM_PET_BATTLE_EFFECT_TARGET_EX
                uint8                           Petx;                                   ///< Offset 0x0004 Type _MJVTBL_UINT8
                uint32                          AuraInstanceID;                         ///< Offset 0x0008 Type _MJVTBL_UINT32
                uint32                          AuraAbilityID;                          ///< Offset 0x000C Type _MJVTBL_UINT32
                int32                           RoundsRemaining;                        ///< Offset 0x0010 Type _MJVTBL_INT32
                int32                           CurrentRound;                           ///< Offset 0x0014 Type _MJVTBL_INT32
                uint32                          StateID;                                ///< Offset 0x0018 Type _MJVTBL_UINT32
                int32                           StateValue;                             ///< Offset 0x001C Type _MJVTBL_INT32
                int32                           Health;                                 ///< Offset 0x0020 Type _MJVTBL_INT32
                int32                           NewStatValue;                           ///< Offset 0x0024 Type _MJVTBL_INT32
                int32                           TriggerAbilityID;                       ///< Offset 0x0028 Type _MJVTBL_INT32
                int32                           ChangedAbilityID;                       ///< Offset 0x002C Type _MJVTBL_INT32
                int32                           CooldownRemaining;                      ///< Offset 0x0030 Type _MJVTBL_INT32
                int32                           LockdownRemaining;                      ///< Offset 0x0034 Type _MJVTBL_INT32
                int32                           BroadcastTextID;                        ///< Offset 0x0038 Type _MJVTBL_INT32
            };

            uint32                                AbilityEffectID;                              ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint16                                Flags;                                        ///< Offset 0x0004 Type _MJVTBL_UINT16
            uint16                                SourceAuraInstanceID;                         ///< Offset 0x0006 Type _MJVTBL_UINT16
            uint16                                TurnInstanceID;                               ///< Offset 0x0008 Type _MJVTBL_UINT16
            int8                                  PetBattleEffectType;                          ///< Offset 0x000A Type _MJVTBL_INT8
            uint8                                 CasterPBOID;                                  ///< Offset 0x000B Type _MJVTBL_UINT8
            uint8                                 StackDepth;                                   ///< Offset 0x000C Type _MJVTBL_UINT8
            std::vector<JamPetBattleEffectTarget> Targets;                                      ///< Offset 0x0010 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffectTarget>::MJVTBL
        };

        struct JamPetBattleActiveAbility
        {
            int32 AbilityID;                ///< Offset 0x0000 Type _MJVTBL_INT32
            int16 CooldownRemaining;        ///< Offset 0x0004 Type _MJVTBL_INT16
            int16 LockdownRemaining;        ///< Offset 0x0006 Type _MJVTBL_INT16
            int8  AbilityIndex;             ///< Offset 0x0008 Type _MJVTBL_INT8
            uint8 Pboid;                    ///< Offset 0x0009 Type _MJVTBL_UINT8
        };

        int32                                  CurRound;                                      ///< Offset 0x0000 Type _MJVTBL_INT32
        int8                                   NextPetBattleState;                            ///< Offset 0x0004 Type _MJVTBL_INT8
        std::vector<JamPetBattleEffect>        Effects;                                       ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffect>::MJVTBL
        std::vector<int8>                      PetXDied;                                      ///< Offset 0x0020 Type MakeMJVTblForArrayOf<signedchar,&(MJVTBL_INT8)>::MJVTBL
        std::vector<JamPetBattleActiveAbility> Cooldowns;                                     ///< Offset 0x0038 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAbility>::MJVTBL
        uint8                                  NextInputFlags[2];                             ///< Offset 0x0050 Type MakeMJVTblForFixedArrayOf<unsignedchar,2,&(MJVTBL_UINT8)>::MJVTBL
        int8                                   NextTrapStatus[2];                             ///< Offset 0x0052 Type MakeMJVTblForFixedArrayOf<signedchar,2,&(MJVTBL_INT8)>::MJVTBL
        uint16                                 RoundTimeSecs[2];                              ///< Offset 0x0054 Type MakeMJVTblForFixedArrayOf<unsignedshort,2,&(MJVTBL_UINT16)>::MJVTBL
    };

    MsgData_Struct MsgData;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_PET_BATTLE_REPLACEMENTS_MADE
struct ClientPetBattleReplacementsMade
{
    struct MsgData_Struct
    {
        struct JamPetBattleEffect
        {
            struct JamPetBattleEffectTarget
            {
                JAM_PET_BATTLE_EFFECT_TARGET_EX Type;                                   ///< Offset 0x0000 Type _MJVTBL_JAM_PET_BATTLE_EFFECT_TARGET_EX
                uint8                           Petx;                                   ///< Offset 0x0004 Type _MJVTBL_UINT8
                uint32                          AuraInstanceID;                         ///< Offset 0x0008 Type _MJVTBL_UINT32
                uint32                          AuraAbilityID;                          ///< Offset 0x000C Type _MJVTBL_UINT32
                int32                           RoundsRemaining;                        ///< Offset 0x0010 Type _MJVTBL_INT32
                int32                           CurrentRound;                           ///< Offset 0x0014 Type _MJVTBL_INT32
                uint32                          StateID;                                ///< Offset 0x0018 Type _MJVTBL_UINT32
                int32                           StateValue;                             ///< Offset 0x001C Type _MJVTBL_INT32
                int32                           Health;                                 ///< Offset 0x0020 Type _MJVTBL_INT32
                int32                           NewStatValue;                           ///< Offset 0x0024 Type _MJVTBL_INT32
                int32                           TriggerAbilityID;                       ///< Offset 0x0028 Type _MJVTBL_INT32
                int32                           ChangedAbilityID;                       ///< Offset 0x002C Type _MJVTBL_INT32
                int32                           CooldownRemaining;                      ///< Offset 0x0030 Type _MJVTBL_INT32
                int32                           LockdownRemaining;                      ///< Offset 0x0034 Type _MJVTBL_INT32
                int32                           BroadcastTextID;                        ///< Offset 0x0038 Type _MJVTBL_INT32
            };

            uint32                                AbilityEffectID;                              ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint16                                Flags;                                        ///< Offset 0x0004 Type _MJVTBL_UINT16
            uint16                                SourceAuraInstanceID;                         ///< Offset 0x0006 Type _MJVTBL_UINT16
            uint16                                TurnInstanceID;                               ///< Offset 0x0008 Type _MJVTBL_UINT16
            int8                                  PetBattleEffectType;                          ///< Offset 0x000A Type _MJVTBL_INT8
            uint8                                 CasterPBOID;                                  ///< Offset 0x000B Type _MJVTBL_UINT8
            uint8                                 StackDepth;                                   ///< Offset 0x000C Type _MJVTBL_UINT8
            std::vector<JamPetBattleEffectTarget> Targets;                                      ///< Offset 0x0010 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffectTarget>::MJVTBL
        };

        struct JamPetBattleActiveAbility
        {
            int32 AbilityID;                ///< Offset 0x0000 Type _MJVTBL_INT32
            int16 CooldownRemaining;        ///< Offset 0x0004 Type _MJVTBL_INT16
            int16 LockdownRemaining;        ///< Offset 0x0006 Type _MJVTBL_INT16
            int8  AbilityIndex;             ///< Offset 0x0008 Type _MJVTBL_INT8
            uint8 Pboid;                    ///< Offset 0x0009 Type _MJVTBL_UINT8
        };

        int32                                  CurRound;                                      ///< Offset 0x0000 Type _MJVTBL_INT32
        int8                                   NextPetBattleState;                            ///< Offset 0x0004 Type _MJVTBL_INT8
        std::vector<JamPetBattleEffect>        Effects;                                       ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamPetBattleEffect>::MJVTBL
        std::vector<int8>                      PetXDied;                                      ///< Offset 0x0020 Type MakeMJVTblForArrayOf<signedchar,&(MJVTBL_INT8)>::MJVTBL
        std::vector<JamPetBattleActiveAbility> Cooldowns;                                     ///< Offset 0x0038 Type MakeMJVTblForArrayOfStruct<JamPetBattleActiveAbility>::MJVTBL
        uint8                                  NextInputFlags[2];                             ///< Offset 0x0050 Type MakeMJVTblForFixedArrayOf<unsignedchar,2,&(MJVTBL_UINT8)>::MJVTBL
        int8                                   NextTrapStatus[2];                             ///< Offset 0x0052 Type MakeMJVTblForFixedArrayOf<signedchar,2,&(MJVTBL_INT8)>::MJVTBL
        uint16                                 RoundTimeSecs[2];                              ///< Offset 0x0054 Type MakeMJVTblForFixedArrayOf<unsignedshort,2,&(MJVTBL_UINT16)>::MJVTBL
    };

    MsgData_Struct MsgData;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_PET_BATTLE_FINAL_ROUND
struct ClientPetBattleFinalRound
{
    struct MsgData_Struct
    {
        struct JamPetBattleFinalPet
        {
            bool   Captured;            ///< Offset 0x0000 Type _MJVTBL_BOOL
            bool   Caged;               ///< Offset 0x0001 Type _MJVTBL_BOOL
            bool   AwardedXP;           ///< Offset 0x0002 Type _MJVTBL_BOOL
            bool   SeenAction;          ///< Offset 0x0003 Type _MJVTBL_BOOL
            uint16 Level;               ///< Offset 0x0004 Type _MJVTBL_UINT16
            uint16 Xp;                  ///< Offset 0x0006 Type _MJVTBL_UINT16
            int32  Health;              ///< Offset 0x0008 Type _MJVTBL_INT32
            int32  MaxHealth;           ///< Offset 0x000C Type _MJVTBL_INT32
            uint16 InitialLevel;        ///< Offset 0x0010 Type _MJVTBL_UINT16
            uint8  Pboid;               ///< Offset 0x0012 Type _MJVTBL_UINT8
        };

        bool                              Abandoned;                                ///< Offset 0x0000 Type _MJVTBL_BOOL
        bool                              PvpBattle;                                ///< Offset 0x0001 Type _MJVTBL_BOOL
        std::vector<JamPetBattleFinalPet> Pets;                                     ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamPetBattleFinalPet>::MJVTBL
        bool                              Winners[2];                               ///< Offset 0x0020 Type MakeMJVTblForFixedArrayOf<bool,2,&(MJVTBL_BOOL)>::MJVTBL
        int32                             NpcCreatureID[2];                         ///< Offset 0x0024 Type MakeMJVTblForFixedArrayOf<int,2,&(MJVTBL_INT32)>::MJVTBL
    };

    MsgData_Struct MsgData;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_PET_BATTLE_FINISHED
struct ClientPetBattleFinished
{
};

///< SMSG_PET_BATTLE_CHAT_RESTRICTED
struct ClientPetBattleChatRestricted
{
};

///< SMSG_PET_BATTLE_MAX_GAME_LENGTH_WARNING
struct ClientPetBattleMaxGameLengthWarning
{
    struct MsgData_Struct
    {
        uint32 TimeRemaining;          ///< Offset 0x0000 Type _MJVTBL_TIME_T
        int32  RoundsRemaining;        ///< Offset 0x0008 Type _MJVTBL_INT32
    };

    MsgData_Struct MsgData;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_START_ELAPSED_TIMER
struct ClientStartElapsedTimer
{
    struct Timer_Struct
    {
        uint32 TimerID;                ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32 CurrentDuration;        ///< Offset 0x0008 Type _MJVTBL_TIME_T
    };

    Timer_Struct Timer;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_STOP_ELAPSED_TIMER
struct ClientStopElapsedTimer
{
    uint32 TimerID;          ///< Offset 0x0000 Type _MJVTBL_UINT32
    bool   KeepTimer;        ///< Offset 0x0004 Type _MJVTBL_BOOL
};

///< SMSG_START_ELAPSED_TIMERS
struct ClientStartElapsedTimers
{
    struct JamElaspedTimer
    {
        uint32 TimerID;                ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32 CurrentDuration;        ///< Offset 0x0008 Type _MJVTBL_TIME_T
    };

    std::vector<JamElaspedTimer> Timers;                              ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamElaspedTimer>::MJVTBL
};

///< SMSG_CHALLENGE_MODE_COMPLETE
struct ClientChallengeModeComplete
{
    struct Reward_Struct
    {
        struct JamItemReward
        {
            int32  ItemID;               ///< Offset 0x0000 Type _MJVTBL_INT32
            int32  ItemDisplayID;        ///< Offset 0x0004 Type _MJVTBL_INT32
            uint32 Quantity;             ///< Offset 0x0008 Type _MJVTBL_UINT32
        };

        struct JamCurrencyReward
        {
            uint32 CurrencyID;        ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint32 Quantity;          ///< Offset 0x0004 Type _MJVTBL_UINT32
        };

        std::vector<JamItemReward>     ItemRewards;                           ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamItemReward>::MJVTBL
        std::vector<JamCurrencyReward> CurrencyRewards;                       ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamCurrencyReward>::MJVTBL
        uint32                         Money;                                 ///< Offset 0x0030 Type _MJVTBL_UINT32
    };

    uint32        MapID;                ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32        Time;                 ///< Offset 0x0004 Type _MJVTBL_UINT32
    uint32        MedalEarned;          ///< Offset 0x0008 Type _MJVTBL_UINT32
    Reward_Struct Reward;               ///< Offset 0x0010 Type _MJVTBL_STRUCT
};

///< SMSG_CHALLEGE_MODE_REWARDS
struct ClientChallegeModeRewards
{
    struct JamMapChallengeModeReward
    {
        struct JamChallengeModeReward
        {
            struct JamItemReward
            {
                int32  ItemID;               ///< Offset 0x0000 Type _MJVTBL_INT32
                int32  ItemDisplayID;        ///< Offset 0x0004 Type _MJVTBL_INT32
                uint32 Quantity;             ///< Offset 0x0008 Type _MJVTBL_UINT32
            };

            struct JamCurrencyReward
            {
                uint32 CurrencyID;        ///< Offset 0x0000 Type _MJVTBL_UINT32
                uint32 Quantity;          ///< Offset 0x0004 Type _MJVTBL_UINT32
            };

            std::vector<JamItemReward>     ItemRewards;                           ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamItemReward>::MJVTBL
            std::vector<JamCurrencyReward> CurrencyRewards;                       ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamCurrencyReward>::MJVTBL
            uint32                         Money;                                 ///< Offset 0x0030 Type _MJVTBL_UINT32
        };

        int32                               MapID;                                      ///< Offset 0x0000 Type _MJVTBL_INT32
        std::vector<JamChallengeModeReward> RewardsPerMedal;                            ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamChallengeModeReward>::MJVTBL
    };

    struct JamItemReward
    {
        int32  ItemID;               ///< Offset 0x0000 Type _MJVTBL_INT32
        int32  ItemDisplayID;        ///< Offset 0x0004 Type _MJVTBL_INT32
        uint32 Quantity;             ///< Offset 0x0008 Type _MJVTBL_UINT32
    };

    std::vector<JamMapChallengeModeReward> Rewards;                                       ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamMapChallengeModeReward>::MJVTBL
    std::vector<JamItemReward>             TierRewards;                                   ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<JamItemReward>::MJVTBL
};

///< SMSG_CHALLENGE_MODE_ALL_MAP_STATS
struct ClientChallengeModeAllMapStats
{
    struct ClientChallengeModeMap
    {
        int32              MapID;                             ///< Offset 0x0000 Type _MJVTBL_INT32
        int32              BestCompletionMilliseconds;        ///< Offset 0x0004 Type _MJVTBL_INT32
        int32              LastCompletionMilliseconds;        ///< Offset 0x0008 Type _MJVTBL_INT32
        int32              BestMedal;                         ///< Offset 0x000C Type _MJVTBL_INT32
        uint8 *            BestMedalDate;                     ///< Offset 0x0010 Type _MJVTBL_NOT_IMPLEMENTED
        std::vector<int16> BestSpecID;                        ///< Offset 0x0030 Type MakeMJVTblForArrayOf<short,&(MJVTBL_INT16)>::MJVTBL
    };

    std::vector<ClientChallengeModeMap> Maps;                                       ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ClientChallengeModeMap>::MJVTBL
};

///< SMSG_CHALLENGE_MODE_MAP_STATS_UPDATE
struct ClientChallengeModeMapStatsUpdate
{
    struct MapData_Struct
    {
        int32              MapID;                             ///< Offset 0x0000 Type _MJVTBL_INT32
        int32              BestCompletionMilliseconds;        ///< Offset 0x0004 Type _MJVTBL_INT32
        int32              LastCompletionMilliseconds;        ///< Offset 0x0008 Type _MJVTBL_INT32
        int32              BestMedal;                         ///< Offset 0x000C Type _MJVTBL_INT32
        uint8 *            BestMedalDate;                     ///< Offset 0x0010 Type _MJVTBL_NOT_IMPLEMENTED
        std::vector<int16> BestSpecID;                        ///< Offset 0x0030 Type MakeMJVTblForArrayOf<short,&(MJVTBL_INT16)>::MJVTBL
    };

    MapData_Struct MapData;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_CHALLENGE_MODE_REQUEST_LEADERS_RESULT
struct ClientChallengeModeRequestLeadersResult
{
    struct ClientChallengeModeAttempt
    {
        struct ClientChallengeModeMember
        {
            uint64 Guid;                       ///< Offset 0x0000 Type _MJVTBL_UINT64
            uint32 VirtualRealmAddress;        ///< Offset 0x0008 Type _MJVTBL_UINT32
            uint32 NativeRealmAddress;         ///< Offset 0x000C Type _MJVTBL_UINT32
            int32  SpecializationID;           ///< Offset 0x0010 Type _MJVTBL_INT32
        };

        uint32                                 InstanceRealmAddress;                          ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32                                 AttemptID;                                     ///< Offset 0x0004 Type _MJVTBL_UINT32
        int32                                  CompletionTime;                                ///< Offset 0x0008 Type _MJVTBL_INT32
        uint8 *                                CompletionDate;                                ///< Offset 0x000C Type _MJVTBL_NOT_IMPLEMENTED
        int32                                  MedalEarned;                                   ///< Offset 0x002C Type _MJVTBL_INT32
        std::vector<ClientChallengeModeMember> Members;                                       ///< Offset 0x0030 Type MakeMJVTblForArrayOfStruct<ClientChallengeModeMember>::MJVTBL
    };

    uint32                                  LastRealmUpdate;                                ///< Offset 0x0000 Type _MJVTBL_TIME_T
    std::vector<ClientChallengeModeAttempt> GuildLeaders;                                   ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<ClientChallengeModeAttempt>::MJVTBL
    int32                                   MapID;                                          ///< Offset 0x0020 Type _MJVTBL_INT32
    uint32                                  LastGuildUpdate;                                ///< Offset 0x0028 Type _MJVTBL_TIME_T
    std::vector<ClientChallengeModeAttempt> RealmLeaders;                                   ///< Offset 0x0030 Type MakeMJVTblForArrayOfStruct<ClientChallengeModeAttempt>::MJVTBL
};

///< SMSG_CHALLENGE_MODE_NEW_PLAYER_RECORD
struct ClientChallengeModeNewPlayerRecord
{
    int32 Medal;                         ///< Offset 0x0000 Type _MJVTBL_INT32
    int32 CompletionMilliseconds;        ///< Offset 0x0004 Type _MJVTBL_INT32
    int32 MapID;                         ///< Offset 0x0008 Type _MJVTBL_INT32
};

///< SMSG_RESPEC_WIPE_CONFIRM
struct ClientRespecWipeConfirm
{
    uint64 RespecMaster;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32 Cost;                ///< Offset 0x0008 Type _MJVTBL_UINT32
    int8   RespecType;          ///< Offset 0x000C Type _MJVTBL_INT8
};

///< SMSG_GMCHARACTER_RESTORE_RESPONSE
struct ClientGMCharacterRestoreResponse
{
    struct JamClientGMCharacterRestoreResponseWarning
    {
        std::string Text;               ///< Offset 0x0000 Type _MJVTBL_STRING
    };

    uint32                                                  SrcAccount;                                                     ///< Offset 0x0000 Type _MJVTBL_UINT32
    std::vector<JamClientGMCharacterRestoreResponseWarning> WarningStrings;                                                 ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamClientGMCharacterRestoreResponseWarning>::MJVTBL
    std::string                                             ResultDescription;                                              ///< Offset 0x0020 Type _MJVTBL_STRING
    uint32                                                  DstAccount;                                                     ///< Offset 0x0120 Type _MJVTBL_UINT32
    bool                                                    Success;                                                        ///< Offset 0x0124 Type _MJVTBL_BOOL
    uint32                                                  ResultCode;                                                     ///< Offset 0x0128 Type _MJVTBL_UINT32
    uint32                                                  Token;                                                          ///< Offset 0x012C Type _MJVTBL_UINT32
    uint64                                                  NewCharacterGUID;                                               ///< Offset 0x0130 Type _MJVTBL_UINT64
    uint64                                                  OldCharacterGUID;                                               ///< Offset 0x0138 Type _MJVTBL_UINT64
};

///< SMSG_LOOT_RESPONSE
struct ClientLootResponse
{
    struct JamLootCurrency
    {
        uint32            CurrencyID;               ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32            Quantity;                 ///< Offset 0x0004 Type _MJVTBL_UINT32
        uint8             LootListID;               ///< Offset 0x0008 Type _MJVTBL_UINT8
        LOOT_ITEM_UI_TYPE UiType;                   ///< Offset 0x000C Type _MJVTBL_LOOT_ITEM_UI_TYPE
    };

    struct JamLootItem
    {
        struct Loot_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        LOOT_LIST_ITEM_TYPE Type;                       ///< Offset 0x0000 Type _MJVTBL_LOOT_LIST_ITEM_TYPE
        LOOT_ITEM_UI_TYPE   UiType;                     ///< Offset 0x0004 Type _MJVTBL_LOOT_ITEM_UI_TYPE
        uint32              Quantity;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8               LootItemType;               ///< Offset 0x000C Type _MJVTBL_UINT8
        uint8               LootListID;                 ///< Offset 0x000D Type _MJVTBL_UINT8
        bool                CanTradeToTapList;          ///< Offset 0x000E Type _MJVTBL_BOOL
        Loot_Struct         Loot;                       ///< Offset 0x0010 Type _MJVTBL_STRUCT
    };

    uint32                       Coins;                               ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint8                        LootMethod;                          ///< Offset 0x0004 Type _MJVTBL_UINT8
    uint8                        Threshold;                           ///< Offset 0x0005 Type _MJVTBL_UINT8
    uint64                       LootObj;                             ///< Offset 0x0008 Type _MJVTBL_UINT64
    std::vector<JamLootCurrency> Currencies;                          ///< Offset 0x0010 Type MakeMJVTblForArrayOfStruct<JamLootCurrency>::MJVTBL
    bool                         PersonalLooting;                     ///< Offset 0x0028 Type _MJVTBL_BOOL
    uint8                        AcquireReason;                       ///< Offset 0x0029 Type _MJVTBL_UINT8
    bool                         Acquired;                            ///< Offset 0x002A Type _MJVTBL_BOOL
    bool                         AELooting;                           ///< Offset 0x002B Type _MJVTBL_BOOL
    uint64                       Owner;                               ///< Offset 0x0030 Type _MJVTBL_UINT64
    uint8                        FailureReason;                       ///< Offset 0x0038 Type _MJVTBL_UINT8
    std::vector<JamLootItem>     Items;                               ///< Offset 0x0040 Type MakeMJVTblForArrayOfStruct<JamLootItem>::MJVTBL
};

///< SMSG_LOOT_REMOVED
struct ClientLootRemoved
{
    uint64 LootObj;           ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 Owner;             ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint8  LootListID;        ///< Offset 0x0010 Type _MJVTBL_UINT8
};

///< SMSG_LOOT_UPDATED
struct ClientLootUpdated
{
    struct Item_Struct
    {
        struct Loot_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        LOOT_LIST_ITEM_TYPE Type;                       ///< Offset 0x0000 Type _MJVTBL_LOOT_LIST_ITEM_TYPE
        LOOT_ITEM_UI_TYPE   UiType;                     ///< Offset 0x0004 Type _MJVTBL_LOOT_ITEM_UI_TYPE
        uint32              Quantity;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8               LootItemType;               ///< Offset 0x000C Type _MJVTBL_UINT8
        uint8               LootListID;                 ///< Offset 0x000D Type _MJVTBL_UINT8
        bool                CanTradeToTapList;          ///< Offset 0x000E Type _MJVTBL_BOOL
        Loot_Struct         Loot;                       ///< Offset 0x0010 Type _MJVTBL_STRUCT
    };

    Item_Struct Item;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint64      LootObj;            ///< Offset 0x0070 Type _MJVTBL_UINT64
};

///< SMSG_COIN_REMOVED
struct ClientCoinRemoved
{
    uint64 LootObj;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_AELOOT_TARGETS
struct ClientAELootTargets
{
    uint32 Count;         ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_AELOOT_TARGET_ACK
struct ClientAELootTargetAck
{
};

///< SMSG_LOOT_RELEASE_ALL
struct ClientLootReleaseAll
{
};

///< SMSG_LOOT_RELEASE
struct ClientLootRelease
{
    uint64 LootObj;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 Owner;          ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_LOOT_MONEY_NOTIFY
struct ClientLootMoneyNotify
{
    uint32 Money;             ///< Offset 0x0000 Type _MJVTBL_UINT32
    bool   SoleLooter;        ///< Offset 0x0004 Type _MJVTBL_BOOL
};

///< SMSG_START_LOOT_ROLL
struct ClientStartLootRoll
{
    struct Item_Struct
    {
        struct Loot_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        LOOT_LIST_ITEM_TYPE Type;                       ///< Offset 0x0000 Type _MJVTBL_LOOT_LIST_ITEM_TYPE
        LOOT_ITEM_UI_TYPE   UiType;                     ///< Offset 0x0004 Type _MJVTBL_LOOT_ITEM_UI_TYPE
        uint32              Quantity;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8               LootItemType;               ///< Offset 0x000C Type _MJVTBL_UINT8
        uint8               LootListID;                 ///< Offset 0x000D Type _MJVTBL_UINT8
        bool                CanTradeToTapList;          ///< Offset 0x000E Type _MJVTBL_BOOL
        Loot_Struct         Loot;                       ///< Offset 0x0010 Type _MJVTBL_STRUCT
    };

    uint32      RollTime;           ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint8       Method;             ///< Offset 0x0004 Type _MJVTBL_UINT8
    Item_Struct Item;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
    int32       MapID;              ///< Offset 0x0078 Type _MJVTBL_INT32
    uint64      LootObj;            ///< Offset 0x0080 Type _MJVTBL_UINT64
    uint8       ValidRolls;         ///< Offset 0x0088 Type _MJVTBL_UINT8
};

///< SMSG_LOOT_ROLL
struct ClientLootRoll
{
    struct Item_Struct
    {
        struct Loot_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        LOOT_LIST_ITEM_TYPE Type;                       ///< Offset 0x0000 Type _MJVTBL_LOOT_LIST_ITEM_TYPE
        LOOT_ITEM_UI_TYPE   UiType;                     ///< Offset 0x0004 Type _MJVTBL_LOOT_ITEM_UI_TYPE
        uint32              Quantity;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8               LootItemType;               ///< Offset 0x000C Type _MJVTBL_UINT8
        uint8               LootListID;                 ///< Offset 0x000D Type _MJVTBL_UINT8
        bool                CanTradeToTapList;          ///< Offset 0x000E Type _MJVTBL_BOOL
        Loot_Struct         Loot;                       ///< Offset 0x0010 Type _MJVTBL_STRUCT
    };

    uint64      Player;             ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32       Roll;               ///< Offset 0x0008 Type _MJVTBL_INT32
    Item_Struct Item;               ///< Offset 0x0010 Type _MJVTBL_STRUCT
    uint8       RollType;           ///< Offset 0x0080 Type _MJVTBL_UINT8
    uint64      LootObj;            ///< Offset 0x0088 Type _MJVTBL_UINT64
    bool        Autopassed;         ///< Offset 0x0090 Type _MJVTBL_BOOL
};

///< SMSG_MASTER_LOOT_CANDIDATE_LIST
struct ClientMasterLootCandidateList
{
    std::vector<uint64> Players;                    ///< Offset 0x0000 Type MakeMJVTblForArrayOf<unsignedlonglong,&(MJVTBL_UINT64)>::MJVTBL
    uint64              LootObj;                    ///< Offset 0x0018 Type _MJVTBL_UINT64
};

///< SMSG_LOOT_ITEM_LIST
struct ClientLootItemList
{
    struct JamLootItem
    {
        struct Loot_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        LOOT_LIST_ITEM_TYPE Type;                       ///< Offset 0x0000 Type _MJVTBL_LOOT_LIST_ITEM_TYPE
        LOOT_ITEM_UI_TYPE   UiType;                     ///< Offset 0x0004 Type _MJVTBL_LOOT_ITEM_UI_TYPE
        uint32              Quantity;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8               LootItemType;               ///< Offset 0x000C Type _MJVTBL_UINT8
        uint8               LootListID;                 ///< Offset 0x000D Type _MJVTBL_UINT8
        bool                CanTradeToTapList;          ///< Offset 0x000E Type _MJVTBL_BOOL
        Loot_Struct         Loot;                       ///< Offset 0x0010 Type _MJVTBL_STRUCT
    };

    std::vector<JamLootItem> Items;                           ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamLootItem>::MJVTBL
    uint64                   LootObj;                         ///< Offset 0x0018 Type _MJVTBL_UINT64
};

///< SMSG_LOOT_ROLLS_COMPLETE
struct ClientLootRollsComplete
{
    uint64 LootObj;           ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint8  LootListID;        ///< Offset 0x0008 Type _MJVTBL_UINT8
};

///< SMSG_LOOT_ALL_PASSED
struct ClientLootAllPassed
{
    struct Item_Struct
    {
        struct Loot_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        LOOT_LIST_ITEM_TYPE Type;                       ///< Offset 0x0000 Type _MJVTBL_LOOT_LIST_ITEM_TYPE
        LOOT_ITEM_UI_TYPE   UiType;                     ///< Offset 0x0004 Type _MJVTBL_LOOT_ITEM_UI_TYPE
        uint32              Quantity;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8               LootItemType;               ///< Offset 0x000C Type _MJVTBL_UINT8
        uint8               LootListID;                 ///< Offset 0x000D Type _MJVTBL_UINT8
        bool                CanTradeToTapList;          ///< Offset 0x000E Type _MJVTBL_BOOL
        Loot_Struct         Loot;                       ///< Offset 0x0010 Type _MJVTBL_STRUCT
    };

    uint64      LootObj;            ///< Offset 0x0000 Type _MJVTBL_UINT64
    Item_Struct Item;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
};

///< SMSG_LOOT_ROLL_WON
struct ClientLootRollWon
{
    struct Item_Struct
    {
        struct Loot_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        LOOT_LIST_ITEM_TYPE Type;                       ///< Offset 0x0000 Type _MJVTBL_LOOT_LIST_ITEM_TYPE
        LOOT_ITEM_UI_TYPE   UiType;                     ///< Offset 0x0004 Type _MJVTBL_LOOT_ITEM_UI_TYPE
        uint32              Quantity;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint8               LootItemType;               ///< Offset 0x000C Type _MJVTBL_UINT8
        uint8               LootListID;                 ///< Offset 0x000D Type _MJVTBL_UINT8
        bool                CanTradeToTapList;          ///< Offset 0x000E Type _MJVTBL_BOOL
        Loot_Struct         Loot;                       ///< Offset 0x0010 Type _MJVTBL_STRUCT
    };

    uint64      Winner;             ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64      LootObj;            ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint8       RollType;           ///< Offset 0x0010 Type _MJVTBL_UINT8
    int32       Roll;               ///< Offset 0x0014 Type _MJVTBL_INT32
    Item_Struct Item;               ///< Offset 0x0018 Type _MJVTBL_STRUCT
};

///< SMSG_SET_ITEM_CHALLENGE_MODE_DATA
struct ClientSetItemChallengeModeData
{
    uint64 ItemGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32  Stats[6];        ///< Offset 0x0008 Type MakeMJVTblForFixedArrayOf<int,6,&(MJVTBL_INT32)>::MJVTBL
};

///< SMSG_CLEAR_ITEM_CHALLENGE_MODE_DATA
struct ClientClearItemChallengeModeData
{
    uint64 ItemGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_ITEM_PUSH_RESULT
struct ClientItemPushResult
{
    struct Item_Struct
    {
        struct JamItemBonusInstanceData
        {
            struct Context_Struct
            {
                uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
            };

            struct Bonuses_Struct
            {
                std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
            };

            Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
            Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
        };

        int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
        int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
        int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
        Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
        Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
    };

    uint32      BattlePetBreedQuality;        ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint64      ItemGUID;                     ///< Offset 0x0008 Type _MJVTBL_UINT64
    int32       SlotInBag;                    ///< Offset 0x0010 Type _MJVTBL_INT32
    int32       QuantityInInventory;          ///< Offset 0x0014 Type _MJVTBL_INT32
    int32       Quantity;                     ///< Offset 0x0018 Type _MJVTBL_INT32
    bool        Pushed;                       ///< Offset 0x001C Type _MJVTBL_BOOL
    bool        DisplayText;                  ///< Offset 0x001D Type _MJVTBL_BOOL
    int32       BattlePetLevel;               ///< Offset 0x0020 Type _MJVTBL_INT32
    uint8       Slot;                         ///< Offset 0x0024 Type _MJVTBL_UINT8
    bool        Created;                      ///< Offset 0x0025 Type _MJVTBL_BOOL
    int32       BattlePetBreedID;             ///< Offset 0x0028 Type _MJVTBL_INT32
    bool        IsBonusRoll;                  ///< Offset 0x002C Type _MJVTBL_BOOL
    uint64      PlayerGUID;                   ///< Offset 0x0030 Type _MJVTBL_UINT64
    Item_Struct Item;                         ///< Offset 0x0038 Type _MJVTBL_STRUCT
    int32       BattlePetSpeciesID;           ///< Offset 0x0098 Type _MJVTBL_INT32
};

///< SMSG_DISPLAY_TOAST
struct ClientDisplayToast
{
    struct Item_Struct
    {
        struct JamItemBonusInstanceData
        {
            struct Context_Struct
            {
                uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
            };

            struct Bonuses_Struct
            {
                std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
            };

            Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
            Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
        };

        int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
        int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
        int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
        Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
        Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
    };

    bool        BonusRoll;                 ///< Offset 0x0000 Type _MJVTBL_BOOL
    TOAST_TYPE  Type;                      ///< Offset 0x0004 Type _MJVTBL_TOAST_TYPE
    uint32      CurrencyID;                ///< Offset 0x0008 Type _MJVTBL_UINT32
    uint8       DisplayToastMethod;        ///< Offset 0x000C Type _MJVTBL_UINT8
    bool        Mailed;                    ///< Offset 0x000D Type _MJVTBL_BOOL
    Item_Struct Item;                      ///< Offset 0x0010 Type _MJVTBL_STRUCT
    int32       LootSpec;                  ///< Offset 0x0070 Type _MJVTBL_INT32
    uint32      Quantity;                  ///< Offset 0x0074 Type _MJVTBL_UINT32
};

///< SMSG_AREA_TRIGGER_DEBUG_SWEEP
struct ClientAreaTriggerDebugSweep
{
    uint64 TriggerGUID;              ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32 TimeFromCreation1;        ///< Offset 0x0008 Type _MJVTBL_UINT32
    uint32 TimeFromCreation0;        ///< Offset 0x000C Type _MJVTBL_UINT32
};

///< SMSG_AREA_TRIGGER_DEBUG_PLAYER_INSIDE
struct ClientAreaTriggerDebugPlayerInside
{
    uint64 TriggerGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    bool   Inside;             ///< Offset 0x0008 Type _MJVTBL_BOOL
};

///< SMSG_RESET_AREA_TRIGGER
struct ClientResetAreaTrigger
{
    struct AreaTrigger_Struct
    {
        struct JamCliAreaTriggerSphere
        {
            float Radius;              ///< Offset 0x0000 Type _MJVTBL_FLOAT
            float RadiusTarget;        ///< Offset 0x0004 Type _MJVTBL_FLOAT
        };

        struct JamCliAreaTriggerBox
        {
            G3D::Vector3 Extents;              ///< Offset 0x0000 Type _MJVTBL_V3
            G3D::Vector3 ExtentsTarget;        ///< Offset 0x000C Type _MJVTBL_V3
        };

        struct JamCliAreaTriggerPolygon
        {
            std::vector<G3D::Vector2> Vertices;                         ///< Offset 0x0000 Type MakeMJVTblForArrayOf<C2Vector,&(MJVTBL_V2)>::MJVTBL
            std::vector<G3D::Vector2> VerticesTarget;                   ///< Offset 0x0018 Type MakeMJVTblForArrayOf<C2Vector,&(MJVTBL_V2)>::MJVTBL
            float                     Height;                           ///< Offset 0x0030 Type _MJVTBL_FLOAT
            float                     HeightTarget;                     ///< Offset 0x0034 Type _MJVTBL_FLOAT
        };

        struct JamCliAreaTriggerCylinder
        {
            float Radius;              ///< Offset 0x0000 Type _MJVTBL_FLOAT
            float RadiusTarget;        ///< Offset 0x0004 Type _MJVTBL_FLOAT
            float Height;              ///< Offset 0x0008 Type _MJVTBL_FLOAT
            float HeightTarget;        ///< Offset 0x000C Type _MJVTBL_FLOAT
        };

        struct JamCliAreaTriggerSpline
        {
            uint32                    TimeToTarget;                     ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint32                    ElapsedTimeForMovement;           ///< Offset 0x0004 Type _MJVTBL_UINT32
            std::vector<G3D::Vector3> Points;                           ///< Offset 0x0008 Type MakeMJVTblForArrayOf<C3Vector,&(MJVTBL_V3)>::MJVTBL
        };

        uint32                              ElapsedMs;                                  ///< Offset 0x0000 Type _MJVTBL_UINT32
        bool                                AbsoluteOrientation;                        ///< Offset 0x0004 Type _MJVTBL_BOOL
        bool                                DynamicShape;                               ///< Offset 0x0005 Type _MJVTBL_BOOL
        bool                                Attached;                                   ///< Offset 0x0006 Type _MJVTBL_BOOL
        bool                                FaceMovementDir;                            ///< Offset 0x0007 Type _MJVTBL_BOOL
        bool                                FollowsTerrain;                             ///< Offset 0x0008 Type _MJVTBL_BOOL
        G3D::Vector3                        RollPitchYaw;                               ///< Offset 0x000C Type _MJVTBL_V3
        Optional<G3D::Vector3>              TargetRollPitchYaw;                         ///< Offset 0x0018 Type MakeMJVTblForOptional<C3Vector,&(MJVTBL_V3)>::MJVTBL
        Optional<uint32>                    ScaleCurveID;                               ///< Offset 0x0028 Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
        Optional<uint32>                    MorphCurveID;                               ///< Offset 0x0030 Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
        Optional<uint32>                    FacingCurveID;                              ///< Offset 0x0038 Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
        Optional<uint32>                    MoveCurveID;                                ///< Offset 0x0040 Type MakeMJVTblForOptional<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
        Optional<JamCliAreaTriggerSphere>   AreaTriggerSphere;                          ///< Offset 0x0048 Type MakeMJVTblForOptionalStruct<JamCliAreaTriggerSphere>::MJVTBL
        Optional<JamCliAreaTriggerBox>      AreaTriggerBox;                             ///< Offset 0x0054 Type MakeMJVTblForOptionalStruct<JamCliAreaTriggerBox>::MJVTBL
        Optional<JamCliAreaTriggerPolygon>  AreaTriggerPolygon;                         ///< Offset 0x0070 Type MakeMJVTblForOptionalStruct<JamCliAreaTriggerPolygon>::MJVTBL
        Optional<JamCliAreaTriggerCylinder> AreaTriggerCylinder;                        ///< Offset 0x00B0 Type MakeMJVTblForOptionalStruct<JamCliAreaTriggerCylinder>::MJVTBL
        Optional<JamCliAreaTriggerSpline>   AreaTriggerSpline;                          ///< Offset 0x00C8 Type MakeMJVTblForOptionalStruct<JamCliAreaTriggerSpline>::MJVTBL
    };

    uint64             TriggerGUID;               ///< Offset 0x0000 Type _MJVTBL_UINT64
    AreaTrigger_Struct AreaTrigger;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
};

///< SMSG_AREA_TRIGGER_RE_PATH
struct ClientAreaTriggerRePath
{
    struct AreaTriggerSpline_Struct
    {
        uint32                    TimeToTarget;                     ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32                    ElapsedTimeForMovement;           ///< Offset 0x0004 Type _MJVTBL_UINT32
        std::vector<G3D::Vector3> Points;                           ///< Offset 0x0008 Type MakeMJVTblForArrayOf<C3Vector,&(MJVTBL_V3)>::MJVTBL
    };

    AreaTriggerSpline_Struct AreaTriggerSpline;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint64                   TriggerGUID;                     ///< Offset 0x0020 Type _MJVTBL_UINT64
};

///< SMSG_AREA_TRIGGER_RE_SHAPE
struct ClientAreaTriggerReShape
{
    struct AreaTriggerPolygon_Struct
    {
        std::vector<G3D::Vector2> Vertices;                         ///< Offset 0x0000 Type MakeMJVTblForArrayOf<C2Vector,&(MJVTBL_V2)>::MJVTBL
        std::vector<G3D::Vector2> VerticesTarget;                   ///< Offset 0x0018 Type MakeMJVTblForArrayOf<C2Vector,&(MJVTBL_V2)>::MJVTBL
        float                     Height;                           ///< Offset 0x0030 Type _MJVTBL_FLOAT
        float                     HeightTarget;                     ///< Offset 0x0034 Type _MJVTBL_FLOAT
    };

    AreaTriggerPolygon_Struct AreaTriggerPolygon;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
    uint64                    TriggerGUID;                      ///< Offset 0x0038 Type _MJVTBL_UINT64
};

///< SMSG_SET_PET_SPECIALIZATION
struct ClientSetPetSpecialization
{
    uint16 SpecID;        ///< Offset 0x0000 Type _MJVTBL_UINT16
};

///< SMSG_BLACK_MARKET_OPEN_RESULT
struct ClientBlackMarketOpenResult
{
    uint64 NpcGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    bool   Open;           ///< Offset 0x0008 Type _MJVTBL_BOOL
};

///< SMSG_BLACK_MARKET_REQUEST_ITEMS_RESULT
struct ClientBlackMarketRequestItemsResult
{
    struct ClientBlackMarketItem
    {
        struct Item_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        int32       MarketID;                ///< Offset 0x0000 Type _MJVTBL_INT32
        int32       SellerNPC;               ///< Offset 0x0004 Type _MJVTBL_INT32
        Item_Struct Item;                    ///< Offset 0x0008 Type _MJVTBL_STRUCT
        int32       Quantity;                ///< Offset 0x0068 Type _MJVTBL_INT32
        uint64      MinBid;                  ///< Offset 0x0070 Type _MJVTBL_UINT64
        uint64      MinIncrement;            ///< Offset 0x0078 Type _MJVTBL_UINT64
        uint64      CurrentBid;              ///< Offset 0x0080 Type _MJVTBL_UINT64
        int32       SecondsRemaining;        ///< Offset 0x0088 Type _MJVTBL_INT32
        bool        HighBid;                 ///< Offset 0x008C Type _MJVTBL_BOOL
        int32       NumBids;                 ///< Offset 0x0090 Type _MJVTBL_INT32
    };

    uint32                             LastUpdateID;                              ///< Offset 0x0000 Type _MJVTBL_TIME_T
    std::vector<ClientBlackMarketItem> Items;                                     ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<ClientBlackMarketItem>::MJVTBL
};

///< SMSG_BLACK_MARKET_BID_ON_ITEM_RESULT
struct ClientBlackMarketBidOnItemResult
{
    struct Item_Struct
    {
        struct JamItemBonusInstanceData
        {
            struct Context_Struct
            {
                uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
            };

            struct Bonuses_Struct
            {
                std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
            };

            Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
            Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
        };

        int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
        int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
        int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
        Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
        Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
    };

    int32       MarketID;           ///< Offset 0x0000 Type _MJVTBL_INT32
    Item_Struct Item;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
    int32       Result;             ///< Offset 0x0068 Type _MJVTBL_INT32
};

///< SMSG_BLACK_MARKET_OUTBID
struct ClientBlackMarketOutbid
{
    struct Item_Struct
    {
        struct JamItemBonusInstanceData
        {
            struct Context_Struct
            {
                uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
            };

            struct Bonuses_Struct
            {
                std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
            };

            Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
            Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
        };

        int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
        int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
        int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
        Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
        Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
    };

    Item_Struct Item;                      ///< Offset 0x0000 Type _MJVTBL_STRUCT
    int32       MarketID;                  ///< Offset 0x0060 Type _MJVTBL_INT32
    int32       RandomPropertiesID;        ///< Offset 0x0064 Type _MJVTBL_INT32
};

///< SMSG_BLACK_MARKET_WON
struct ClientBlackMarketWon
{
    struct Item_Struct
    {
        struct JamItemBonusInstanceData
        {
            struct Context_Struct
            {
                uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
            };

            struct Bonuses_Struct
            {
                std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
            };

            Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
            Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
        };

        int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
        int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
        int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
        Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
        Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
    };

    int32       MarketID;                  ///< Offset 0x0000 Type _MJVTBL_INT32
    int32       RandomPropertiesID;        ///< Offset 0x0004 Type _MJVTBL_INT32
    Item_Struct Item;                      ///< Offset 0x0008 Type _MJVTBL_STRUCT
};

///< SMSG_SCENARIO_STATE
struct ClientScenarioState
{
    struct JamBonusObjectiveData
    {
        int32 BonusObjectiveID;         ///< Offset 0x0000 Type _MJVTBL_INT32
        bool  ObjectiveComplete;        ///< Offset 0x0004 Type _MJVTBL_BOOL
    };

    struct JamCriteriaProgress
    {
        int32   Id;                    ///< Offset 0x0000 Type _MJVTBL_INT32
        uint64  Quantity;              ///< Offset 0x0008 Type _MJVTBL_UINT64
        uint64  Player;                ///< Offset 0x0010 Type _MJVTBL_UINT64
        int32   Flags;                 ///< Offset 0x0018 Type _MJVTBL_INT32
        uint8 * Date;                  ///< Offset 0x001C Type _MJVTBL_NOT_IMPLEMENTED
        uint32  TimeFromStart;         ///< Offset 0x0040 Type _MJVTBL_TIME_T
        uint32  TimeFromCreate;        ///< Offset 0x0048 Type _MJVTBL_TIME_T
    };

    std::vector<JamBonusObjectiveData> BonusObjectives;                           ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamBonusObjectiveData>::MJVTBL
    bool                               ScenarioComplete;                          ///< Offset 0x0018 Type _MJVTBL_BOOL
    std::vector<JamCriteriaProgress>   CriteriaProgress;                          ///< Offset 0x0020 Type MakeMJVTblForArrayOfStruct<JamCriteriaProgress>::MJVTBL
    int32                              CurrentStep;                               ///< Offset 0x0038 Type _MJVTBL_INT32
    uint32                             WaveCurrent;                               ///< Offset 0x003C Type _MJVTBL_UINT32
    uint32                             DifficultyID;                              ///< Offset 0x0040 Type _MJVTBL_UINT32
    uint32                             TimerDuration;                             ///< Offset 0x0044 Type _MJVTBL_UINT32
    int32                              ScenarioID;                                ///< Offset 0x0048 Type _MJVTBL_INT32
    uint32                             WaveMax;                                   ///< Offset 0x004C Type _MJVTBL_UINT32
};

///< SMSG_SCENARIO_PROGRESS_UPDATE
struct ClientScenarioProgressUpdate
{
    struct Progress_Struct
    {
        int32   Id;                    ///< Offset 0x0000 Type _MJVTBL_INT32
        uint64  Quantity;              ///< Offset 0x0008 Type _MJVTBL_UINT64
        uint64  Player;                ///< Offset 0x0010 Type _MJVTBL_UINT64
        int32   Flags;                 ///< Offset 0x0018 Type _MJVTBL_INT32
        uint8 * Date;                  ///< Offset 0x001C Type _MJVTBL_NOT_IMPLEMENTED
        uint32  TimeFromStart;         ///< Offset 0x0040 Type _MJVTBL_TIME_T
        uint32  TimeFromCreate;        ///< Offset 0x0048 Type _MJVTBL_TIME_T
    };

    Progress_Struct Progress;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_GROUP_NEW_LEADER
struct ClientGroupNewLeader
{
    uint8       PartyIndex;         ///< Offset 0x0000 Type _MJVTBL_UINT8
    std::string Name;               ///< Offset 0x0001 Type _MJVTBL_STRING
};

///< SMSG_SEND_RAID_TARGET_UPDATE_ALL
struct ClientSendRaidTargetUpdateAll
{
    struct RaidTargetSymbol
    {
        uint64 Target;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint8  Symbol;        ///< Offset 0x0008 Type _MJVTBL_UINT8
    };

    std::vector<RaidTargetSymbol> Targets;                              ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<RaidTargetSymbol>::MJVTBL
    uint8                         PartyIndex;                           ///< Offset 0x0018 Type _MJVTBL_UINT8
};

///< SMSG_SEND_RAID_TARGET_UPDATE_SINGLE
struct ClientSendRaidTargetUpdateSingle
{
    uint64 ChangedBy;         ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 Target;            ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint8  PartyIndex;        ///< Offset 0x0010 Type _MJVTBL_UINT8
    uint8  Symbol;            ///< Offset 0x0011 Type _MJVTBL_UINT8
};

///< SMSG_RANDOM_ROLL
struct ClientRandomRoll
{
    uint64 Roller;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32  Result;        ///< Offset 0x0008 Type _MJVTBL_INT32
    int32  Max;           ///< Offset 0x000C Type _MJVTBL_INT32
    int32  Min;           ///< Offset 0x0010 Type _MJVTBL_INT32
};

///< SMSG_INSPECT_RESULT
struct ClientInspectResult
{
    struct JamCliInspectItemData
    {
        struct Item_Struct
        {
            struct JamItemBonusInstanceData
            {
                struct Context_Struct
                {
                    uint8 Context;        ///< Offset 0x0000 Type _MJVTBL_UINT8
                };

                struct Bonuses_Struct
                {
                    std::vector<int32> BonusListIDs;              ///< Offset 0x0000 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
                };

                Context_Struct Context;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
                Bonuses_Struct Bonuses;               ///< Offset 0x0008 Type _MJVTBL_STRUCT
            };

            int32                              ItemID;                                    ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                              RandomPropertiesSeed;                      ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                              RandomPropertiesID;                        ///< Offset 0x0008 Type _MJVTBL_INT32
            Optional<JamItemBonusInstanceData> ItemBonus;                                 ///< Offset 0x0010 Type MakeMJVTblForOptionalStruct<JamItemBonusInstanceData>::MJVTBL
            Optional<int>                      Modifications;                             ///< Offset 0x0038 Type MakeMJVTblForOptional<CompactArray<int,TSGrowableArray<int>,unsignedint,0>,&(MJVTBL_NOT_IMPLEMENTED)>::MJVTBL
        };

        struct JamCliInspectEnchantData
        {
            uint32 Id;            ///< Offset 0x0000 Type _MJVTBL_UINT32
            uint8  Index;         ///< Offset 0x0004 Type _MJVTBL_UINT8
        };

        uint64                                CreatorGUID;                                  ///< Offset 0x0000 Type _MJVTBL_UINT64
        Item_Struct                           Item;                                         ///< Offset 0x0008 Type _MJVTBL_STRUCT
        uint8                                 Index;                                        ///< Offset 0x0068 Type _MJVTBL_UINT8
        bool                                  Usable;                                       ///< Offset 0x0069 Type _MJVTBL_BOOL
        std::vector<JamCliInspectEnchantData> Enchants;                                     ///< Offset 0x0070 Type MakeMJVTblForArrayOfStruct<JamCliInspectEnchantData>::MJVTBL
    };

    struct JamCliInspectGuildData
    {
        uint64 GuildGUID;              ///< Offset 0x0000 Type _MJVTBL_UINT64
        int64  GuildXP;                ///< Offset 0x0008 Type _MJVTBL_INT64
        int32  GuildLevel;             ///< Offset 0x0010 Type _MJVTBL_INT32
        int32  NumGuildMembers;        ///< Offset 0x0014 Type _MJVTBL_INT32
    };

    std::vector<JamCliInspectItemData> Items;                                     ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamCliInspectItemData>::MJVTBL
    int32                              ClassID;                                   ///< Offset 0x0018 Type _MJVTBL_INT32
    std::vector<uint16>                Talents;                                   ///< Offset 0x0020 Type MakeMJVTblForArrayOf<unsignedshort,&(MJVTBL_UINT16)>::MJVTBL
    std::vector<uint16>                Glyphs;                                    ///< Offset 0x0038 Type MakeMJVTblForArrayOf<unsignedshort,&(MJVTBL_UINT16)>::MJVTBL
    Optional<JamCliInspectGuildData>   GuildData;                                 ///< Offset 0x0050 Type MakeMJVTblForOptionalStruct<JamCliInspectGuildData>::MJVTBL
    uint64                             InspecteeGUID;                             ///< Offset 0x0070 Type _MJVTBL_UINT64
    int32                              SpecializationID;                          ///< Offset 0x0078 Type _MJVTBL_INT32
};

///< SMSG_SCENARIO_POIS
struct ClientScenarioPOIs
{
    struct ScenarioPOIData
    {
        struct ScenarioBlobData
        {
            struct ScenarioPOIPointData
            {
                int32 X;            ///< Offset 0x0000 Type _MJVTBL_INT32
                int32 Y;            ///< Offset 0x0004 Type _MJVTBL_INT32
            };

            int32                             BlobID;                                   ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                             MapID;                                    ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                             WorldMapAreaID;                           ///< Offset 0x0008 Type _MJVTBL_INT32
            int32                             Floor;                                    ///< Offset 0x000C Type _MJVTBL_INT32
            int32                             Priority;                                 ///< Offset 0x0010 Type _MJVTBL_INT32
            int32                             Flags;                                    ///< Offset 0x0014 Type _MJVTBL_INT32
            int32                             WorldEffectID;                            ///< Offset 0x0018 Type _MJVTBL_INT32
            int32                             PlayerConditionID;                        ///< Offset 0x001C Type _MJVTBL_INT32
            std::vector<ScenarioPOIPointData> Points;                                   ///< Offset 0x0020 Type MakeMJVTblForArrayOfStruct<ScenarioPOIPointData>::MJVTBL
        };

        int32                         CriteriaTreeID;                       ///< Offset 0x0000 Type _MJVTBL_INT32
        std::vector<ScenarioBlobData> BlobData;                             ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<ScenarioBlobData>::MJVTBL
    };

    std::vector<ScenarioPOIData> PoiInfo;                             ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ScenarioPOIData>::MJVTBL
};

///< SMSG_INSTANCE_INFO
struct ClientInstanceInfo
{
    struct ClientInstanceLock
    {
        uint32 MapID;                 ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32 DifficultyID;          ///< Offset 0x0004 Type _MJVTBL_UINT32
        uint64 InstanceID;            ///< Offset 0x0008 Type _MJVTBL_UINT64
        bool   Locked;                ///< Offset 0x0010 Type _MJVTBL_BOOL
        bool   Extended;              ///< Offset 0x0011 Type _MJVTBL_BOOL
        uint32 TimeRemaining;         ///< Offset 0x0014 Type _MJVTBL_UINT32
        uint32 Completed_mask;        ///< Offset 0x0018 Type _MJVTBL_UINT32
    };

    std::vector<ClientInstanceLock> Locks;                                  ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ClientInstanceLock>::MJVTBL
};

///< SMSG_CONSOLE_WRITE
struct ClientConsoleWrite
{
    uint32      Color;              ///< Offset 0x0000 Type _MJVTBL_UINT32
    std::string Line;               ///< Offset 0x0004 Type _MJVTBL_STRING
};

///< SMSG_ACCOUNT_CRITERIA_UPDATE
struct ClientAccountCriteriaUpdate
{
    struct Progress_Struct
    {
        int32   Id;                    ///< Offset 0x0000 Type _MJVTBL_INT32
        uint64  Quantity;              ///< Offset 0x0008 Type _MJVTBL_UINT64
        uint64  Player;                ///< Offset 0x0010 Type _MJVTBL_UINT64
        int32   Flags;                 ///< Offset 0x0018 Type _MJVTBL_INT32
        uint8 * Date;                  ///< Offset 0x001C Type _MJVTBL_NOT_IMPLEMENTED
        uint32  TimeFromStart;         ///< Offset 0x0040 Type _MJVTBL_TIME_T
        uint32  TimeFromCreate;        ///< Offset 0x0048 Type _MJVTBL_TIME_T
    };

    Progress_Struct Progress;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_PLAY_SCENE
struct ClientPlayScene
{
    struct PlayData_Struct
    {
        uint64       TransportGUID;               ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32        SceneID;                     ///< Offset 0x0008 Type _MJVTBL_INT32
        uint32       PlaybackFlags;               ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32       SceneInstanceID;             ///< Offset 0x0010 Type _MJVTBL_UINT32
        int32        SceneScriptPackageID;        ///< Offset 0x0014 Type _MJVTBL_INT32
        G3D::Vector3 Pos;                         ///< Offset 0x0018 Type _MJVTBL_V3
        float        Facing;                      ///< Offset 0x0024 Type _MJVTBL_FLOAT
    };

    PlayData_Struct PlayData;               ///< Offset 0x0000 Type _MJVTBL_STRUCT
};

///< SMSG_CANCEL_SCENE
struct ClientCancelScene
{
    uint32 SceneInstanceID;        ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_BATTLE_PET_ERROR
struct ClientBattlePetError
{
    BATTLEPETRESULT BattlePetResult;        ///< Offset 0x0000 Type _MJVTBL_BATTLEPETRESULT
    int32           CreatureID;             ///< Offset 0x0004 Type _MJVTBL_INT32
};

///< SMSG_PET_BATTLE_QUEUE_PROPOSE_MATCH
struct ClientPetBattleQueueProposeMatch
{
};

///< SMSG_PET_BATTLE_QUEUE_STATUS
struct ClientPetBattleQueueStatus
{
    struct Ticket_Struct
    {
        uint64 RequesterGuid;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint32 Id;                   ///< Offset 0x0008 Type _MJVTBL_UINT32
        uint32 Type;                 ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32 Time;                 ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    int32              Status;                    ///< Offset 0x0000 Type _MJVTBL_INT32
    std::vector<int32> SlotResult;                ///< Offset 0x0008 Type MakeMJVTblForArrayOf<int,&(MJVTBL_INT32)>::MJVTBL
    Ticket_Struct      Ticket;                    ///< Offset 0x0020 Type _MJVTBL_STRUCT
    Optional<int32>    AverageWaitTime;           ///< Offset 0x0038 Type MakeMJVTblForOptional<long,&(MJVTBL_TIME_T)>::MJVTBL
    Optional<int32>    ClientWaitTime;            ///< Offset 0x0048 Type MakeMJVTblForOptional<long,&(MJVTBL_TIME_T)>::MJVTBL
};

///< SMSG_MAIL_COMMAND_RESULT
struct ClientMailCommandResult
{
    int32 Command;               ///< Offset 0x0000 Type _MJVTBL_INT32
    int32 MailID;                ///< Offset 0x0004 Type _MJVTBL_INT32
    int32 QtyInInventory;        ///< Offset 0x0008 Type _MJVTBL_INT32
    int32 BagResult;             ///< Offset 0x000C Type _MJVTBL_INT32
    int32 AttachID;              ///< Offset 0x0010 Type _MJVTBL_INT32
    int32 ErrorCode;             ///< Offset 0x0014 Type _MJVTBL_INT32
};

///< SMSG_NOTIFY_RECEIVED_MAIL
struct ClientNotifyReceivedMail
{
    float Delay;        ///< Offset 0x0000 Type _MJVTBL_FLOAT
};

///< SMSG_ADD_BATTLENET_FRIEND_RESPONSE
struct ClientAddBattlenetFriendResponse
{
    Optional<uint16>           BattlenetError;                    ///< Offset 0x0000 Type MakeMJVTblForOptional<unsignedshort,&(MJVTBL_UINT16)>::MJVTBL
    uint64                     ClientToken;                       ///< Offset 0x0008 Type _MJVTBL_UINT64
    JamAddBattlenetFriendError Result;                            ///< Offset 0x0010 Type _MJVTBL_JamAddBattlenetFriendError
};

///< SMSG_ITEM_UPGRADE_RESULT
struct ClientItemUpgradeResult
{
    bool Result;        ///< Offset 0x0000 Type _MJVTBL_BOOL
};

///< SMSG_MOVE_CHARACTER_CHEAT_SUCCESS
struct ClientMoveCharacterCheatSuccess
{
    uint64       CharacterGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    G3D::Vector3 Position;             ///< Offset 0x0008 Type _MJVTBL_V3
    int32        MapID;                ///< Offset 0x0014 Type _MJVTBL_INT32
};

///< SMSG_MOVE_CHARACTER_CHEAT_FAILURE
struct ClientMoveCharacterCheatFailure
{
};

///< SMSG_ACHIEVEMENT_EARNED
struct ClientAchievementEarned
{
    uint32  EarnerNativeRealm;         ///< Offset 0x0000 Type _MJVTBL_UINT32
    bool    Initial;                   ///< Offset 0x0004 Type _MJVTBL_BOOL
    uint64  Earner;                    ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint8 * Time;                      ///< Offset 0x0010 Type _MJVTBL_NOT_IMPLEMENTED
    int32   AchievementID;             ///< Offset 0x0030 Type _MJVTBL_INT32
    uint32  EarnerVirtualRealm;        ///< Offset 0x0034 Type _MJVTBL_UINT32
    uint64  Sender;                    ///< Offset 0x0038 Type _MJVTBL_UINT64
};

///< SMSG_AREA_SHARE_INFO_RESPONSE
struct ClientAreaShareInfoResponse
{
    uint32              AreaShareInfoID;            ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32              CurrentRealm;               ///< Offset 0x0004 Type _MJVTBL_UINT32
    uint32              AreaID;                     ///< Offset 0x0008 Type _MJVTBL_UINT32
    std::vector<uint32> OtherRealms;                ///< Offset 0x0010 Type MakeMJVTblForArrayOf<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
};

///< SMSG_OPEN_LFGDUNGEON_FINDER
struct ClientOpenLFGDungeonFinder
{
    int32 DungeonID;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_LFGTELEPORT_DENIED
struct ClientLFGTeleportDenied
{
    LFG_TELEPORT_RESULT Reason;                     ///< Offset 0x0000 Type _MJVTBL_LFG_TELEPORT_RESULT
};

///< SMSG_AREA_SHARE_MAPPINGS_RESPONSE
struct ClientAreaShareMappingsResponse
{
    struct JamAreaShareMappingInfo
    {
        uint32              AreaShareID;                ///< Offset 0x0000 Type _MJVTBL_UINT32
        std::vector<uint32> AreaIDs;                    ///< Offset 0x0008 Type MakeMJVTblForArrayOf<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
        uint32              HostingRealm;               ///< Offset 0x0020 Type _MJVTBL_UINT32
        std::vector<uint32> OtherRealms;                ///< Offset 0x0028 Type MakeMJVTblForArrayOf<unsignedint,&(MJVTBL_UINT32)>::MJVTBL
    };

    std::vector<JamAreaShareMappingInfo> Mappings;                                    ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamAreaShareMappingInfo>::MJVTBL
};

///< SMSG_BONUS_ROLL_EMPTY
struct ClientBonusRollEmpty
{
};

///< SMSG_UPDATE_EXPANSION_LEVEL
struct ClientUpdateExpansionLevel
{
    struct JamRaceClassAvailability
    {
        uint8 RaceOrClassID;            ///< Offset 0x0000 Type _MJVTBL_UINT8
        uint8 RequiredExpansion;        ///< Offset 0x0001 Type _MJVTBL_UINT8
    };

    std::vector<JamRaceClassAvailability> AvailableClasses;                             ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamRaceClassAvailability>::MJVTBL
    Optional<uint8>                       ActiveExpansionLevel;                         ///< Offset 0x0018 Type MakeMJVTblForOptional<unsignedchar,&(MJVTBL_UINT8)>::MJVTBL
    std::vector<JamRaceClassAvailability> AvailableRaces;                               ///< Offset 0x0020 Type MakeMJVTblForArrayOfStruct<JamRaceClassAvailability>::MJVTBL
};

///< SMSG_CONTROL_UPDATE
struct ClientControlUpdate
{
    bool   On;            ///< Offset 0x0000 Type _MJVTBL_BOOL
    uint64 Guid;          ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_ARENA_PREP_OPPONENT_SPECIALIZATIONS
struct ClientArenaPrepOpponentSpecializations
{
    struct JamClientOpponentSpecData
    {
        uint64 Guid;                    ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32  SpecializationID;        ///< Offset 0x0008 Type _MJVTBL_INT32
    };

    std::vector<JamClientOpponentSpecData> OpponentData;                                  ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamClientOpponentSpecData>::MJVTBL
};

///< SMSG_GMTICKET_GET_TICKET_RESPONSE
struct ClientGMTicketGetTicketResponse
{
    struct JamClientGMTicketInfo
    {
        int32       TicketID;                       ///< Offset 0x0000 Type _MJVTBL_INT32
        std::string TicketDescription;              ///< Offset 0x0004 Type _MJVTBL_STRING
        uint8       Category;                       ///< Offset 0x07D5 Type _MJVTBL_UINT8
        uint32      TicketOpenTime;                 ///< Offset 0x07D8 Type _MJVTBL_TIME_T
        uint32      OldestTicketTime;               ///< Offset 0x07E0 Type _MJVTBL_TIME_T
        uint32      UpdateTime;                     ///< Offset 0x07E8 Type _MJVTBL_TIME_T
        uint8       AssignedToGM;                   ///< Offset 0x07F0 Type _MJVTBL_UINT8
        uint8       OpenedByGM;                     ///< Offset 0x07F1 Type _MJVTBL_UINT8
        std::string WaitTimeOverrideMessage;        ///< Offset 0x07F2 Type _MJVTBL_STRING
        int32       WaitTimeOverrideMinutes;        ///< Offset 0x0BF4 Type _MJVTBL_INT32
    };

    Optional<JamClientGMTicketInfo> Info;                                   ///< Offset 0x0000 Type MakeMJVTblForOptionalStruct<JamClientGMTicketInfo>::MJVTBL
    int32                           Result;                                 ///< Offset 0x0C00 Type _MJVTBL_INT32
};

///< SMSG_NUKE_ALL_OBJECTS_DUE_TO_SEAMLESS_PORT
struct ClientNukeAllObjectsDueToSeamlessPort
{
};

///< SMSG_GMNOTIFY_AREA_CHANGE
struct ClientGMNotifyAreaChange
{
    struct JamRealmName
    {
        std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    };

    struct CurrentRealm_Struct
    {
        std::string Name;               ///< Offset 0x0000 Type _MJVTBL_STRING
    };

    std::vector<JamRealmName> OtherRealms;                      ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamRealmName>::MJVTBL
    std::string               AreaShareInternalName;            ///< Offset 0x0018 Type _MJVTBL_STRING
    CurrentRealm_Struct       CurrentRealm;                     ///< Offset 0x007C Type _MJVTBL_STRUCT
    uint8                     AreaShareID;                      ///< Offset 0x017D Type _MJVTBL_UINT8
    uint32                    AreaID;                           ///< Offset 0x0180 Type _MJVTBL_UINT32
    uint32                    CurrentRealmAddress;              ///< Offset 0x0184 Type _MJVTBL_UINT32
};

///< SMSG_FORCE_OBJECT_RELINK
struct ClientForceObjectRelink
{
    uint64 ObjectGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_DISPLAY_PROMOTION
struct ClientDisplayPromotion
{
    int32 PromotionID;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_SET_PROMOTION_RESPONSE
struct ClientSetPromotionResponse
{
    bool  Success;            ///< Offset 0x0000 Type _MJVTBL_BOOL
    int32 PromotionID;        ///< Offset 0x0004 Type _MJVTBL_INT32
};

///< SMSG_SERVER_FIRST_ACHIEVEMENTS
struct ClientServerFirstAchievements
{
    struct JamServerFirstAchievement
    {
        uint64 PlayerGuid;           ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32  AchievementID;        ///< Offset 0x0008 Type _MJVTBL_INT32
    };

    std::vector<JamServerFirstAchievement> Achievements;                                  ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamServerFirstAchievement>::MJVTBL
};

///< SMSG_CORPSE_LOCATION
struct ClientCorpseLocation
{
    uint64       Transport;           ///< Offset 0x0000 Type _MJVTBL_UINT64
    G3D::Vector3 Position;            ///< Offset 0x0008 Type _MJVTBL_V3
    int32        ActualMapID;         ///< Offset 0x0014 Type _MJVTBL_INT32
    bool         Valid;               ///< Offset 0x0018 Type _MJVTBL_BOOL
    int32        MapID;               ///< Offset 0x001C Type _MJVTBL_INT32
};

///< SMSG_BREAK_TARGET
struct ClientBreakTarget
{
    uint64 UnitGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_ATTACK_START
struct ClientAttackStart
{
    uint64 Attacker;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 Victim;          ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_ATTACK_STOP
struct ClientAttackStop
{
    uint64 Attacker;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 Victim;          ///< Offset 0x0008 Type _MJVTBL_UINT64
    bool   NowDead;         ///< Offset 0x0010 Type _MJVTBL_BOOL
};

///< SMSG_COMBAT_EVENT_FAILED
struct ClientCombatEventFailed
{
    uint64 Victim;          ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 Attacker;        ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_DUEL_REQUESTED
struct ClientDuelRequested
{
    uint64 ArbiterGUID;            ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 RequestedByGUID;        ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_DUEL_OUT_OF_BOUNDS
struct ClientDuelOutOfBounds
{
};

///< SMSG_DUEL_IN_BOUNDS
struct ClientDuelInBounds
{
};

///< SMSG_DUEL_COUNTDOWN
struct ClientDuelCountdown
{
    uint32 Countdown;        ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_DUEL_COMPLETE
struct ClientDuelComplete
{
    bool Started;        ///< Offset 0x0000 Type _MJVTBL_BOOL
};

///< SMSG_DUEL_WINNER
struct ClientDuelWinner
{
    std::string BeatenName;                       ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string WinnerName;                       ///< Offset 0x0031 Type _MJVTBL_STRING
    bool        Fled;                             ///< Offset 0x0062 Type _MJVTBL_BOOL
    uint32      BeatenVirtualRealmAddress;        ///< Offset 0x0064 Type _MJVTBL_UINT32
    uint32      WinnerVirtualRealmAddress;        ///< Offset 0x0068 Type _MJVTBL_UINT32
};

///< SMSG_CAN_DUEL_RESULT
struct ClientCanDuelResult
{
    bool   Result;            ///< Offset 0x0000 Type _MJVTBL_BOOL
    uint64 TargetGUID;        ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_IMMIGRANT_HOST_SEARCH_LOG
struct ClientImmigrantHostSearchLog
{
    struct JamImmigrantHostSearchLog
    {
        uint64            PartyMember;              ///< Offset 0x0000 Type _MJVTBL_UINT64
        bool              IsLeader;                 ///< Offset 0x0008 Type _MJVTBL_BOOL
        uint32            Realm;                    ///< Offset 0x000C Type _MJVTBL_UINT32
        uint32            ImmigrantPop;             ///< Offset 0x0010 Type _MJVTBL_UINT32
        IMMIGRATION_STATE State;                    ///< Offset 0x0014 Type _MJVTBL_IMMIGRATION_STATE
    };

    bool                                   Success;                                       ///< Offset 0x0000 Type _MJVTBL_BOOL
    std::vector<JamImmigrantHostSearchLog> Entries;                                       ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<JamImmigrantHostSearchLog>::MJVTBL
};

///< SMSG_REFRESH_COMPONENT
struct ClientRefreshComponent
{
};

///< SMSG_ACCOUNT_PROFILE
struct ClientAccountProfile
{
    std::string Filename;           ///< Offset 0x0000 Type _MJVTBL_STRING
    uint8 *     Profile;            ///< Offset 0x0040 Type _MJVTBL_NOT_IMPLEMENTED
};

///< SMSG_CHALLENGE_MODE_DUMP_LEADERS_RESULT
struct ClientChallengeModeDumpLeadersResult
{
    struct ClientChallengeModeAttempt
    {
        struct ClientChallengeModeMember
        {
            uint64 Guid;                       ///< Offset 0x0000 Type _MJVTBL_UINT64
            uint32 VirtualRealmAddress;        ///< Offset 0x0008 Type _MJVTBL_UINT32
            uint32 NativeRealmAddress;         ///< Offset 0x000C Type _MJVTBL_UINT32
            int32  SpecializationID;           ///< Offset 0x0010 Type _MJVTBL_INT32
        };

        uint32                                 InstanceRealmAddress;                          ///< Offset 0x0000 Type _MJVTBL_UINT32
        uint32                                 AttemptID;                                     ///< Offset 0x0004 Type _MJVTBL_UINT32
        int32                                  CompletionTime;                                ///< Offset 0x0008 Type _MJVTBL_INT32
        uint8 *                                CompletionDate;                                ///< Offset 0x000C Type _MJVTBL_NOT_IMPLEMENTED
        int32                                  MedalEarned;                                   ///< Offset 0x002C Type _MJVTBL_INT32
        std::vector<ClientChallengeModeMember> Members;                                       ///< Offset 0x0030 Type MakeMJVTblForArrayOfStruct<ClientChallengeModeMember>::MJVTBL
    };

    int32                                   MapID;                                          ///< Offset 0x0000 Type _MJVTBL_INT32
    bool                                    Success;                                        ///< Offset 0x0004 Type _MJVTBL_BOOL
    std::vector<ClientChallengeModeAttempt> Leaders;                                        ///< Offset 0x0008 Type MakeMJVTblForArrayOfStruct<ClientChallengeModeAttempt>::MJVTBL
};

///< SMSG_CHALLENGE_MODE_DELETE_LEADER_RESULT
struct ClientChallengeModeDeleteLeaderResult
{
    int32  MapID;            ///< Offset 0x0000 Type _MJVTBL_INT32
    uint32 AttemptID;        ///< Offset 0x0004 Type _MJVTBL_UINT32
    bool   Success;          ///< Offset 0x0008 Type _MJVTBL_BOOL
};

///< SMSG_DEBUG_DRAW_LINE
struct ClientDebugDrawLine
{
    float        Thickness;           ///< Offset 0x0000 Type _MJVTBL_FLOAT
    G3D::Vector3 A;                   ///< Offset 0x0004 Type _MJVTBL_V3
    G3D::Vector3 B;                   ///< Offset 0x0010 Type _MJVTBL_V3
    uint32       Colora;              ///< Offset 0x001C Type _MJVTBL_UINT32
    uint32       Colorb;              ///< Offset 0x0020 Type _MJVTBL_UINT32
    uint32       Id;                  ///< Offset 0x0024 Type _MJVTBL_UINT32
    uint32       Settings;            ///< Offset 0x0028 Type _MJVTBL_UINT32
    float        Lifetime;            ///< Offset 0x002C Type _MJVTBL_FLOAT
};

///< SMSG_DEBUG_DRAW_QUAD
struct ClientDebugDrawQuad
{
    G3D::Vector2 Size;                ///< Offset 0x0000 Type _MJVTBL_V2
    float        Lifetime;            ///< Offset 0x0008 Type _MJVTBL_FLOAT
    uint32       Settings;            ///< Offset 0x000C Type _MJVTBL_UINT32
    std::string  Texture;             ///< Offset 0x0010 Type _MJVTBL_STRING
    uint32       Id;                  ///< Offset 0x0114 Type _MJVTBL_UINT32
    G3D::Vector2 TopLeft;             ///< Offset 0x0118 Type _MJVTBL_V2
    uint32       Flags;               ///< Offset 0x0120 Type _MJVTBL_UINT32
    G3D::Vector2 Uv_max;              ///< Offset 0x0124 Type _MJVTBL_V2
    uint32       Color;               ///< Offset 0x012C Type _MJVTBL_UINT32
    G3D::Vector2 Uv_min;              ///< Offset 0x0130 Type _MJVTBL_V2
};

///< SMSG_DEBUG_DRAW_TRIANGLE
struct ClientDebugDrawTriangle
{
    uint32       Colorb;              ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32       Colora;              ///< Offset 0x0004 Type _MJVTBL_UINT32
    uint32       Settings;            ///< Offset 0x0008 Type _MJVTBL_UINT32
    G3D::Vector3 A;                   ///< Offset 0x000C Type _MJVTBL_V3
    G3D::Vector3 C;                   ///< Offset 0x0018 Type _MJVTBL_V3
    uint32       Colorc;              ///< Offset 0x0024 Type _MJVTBL_UINT32
    G3D::Vector3 B;                   ///< Offset 0x0028 Type _MJVTBL_V3
    uint32       Id;                  ///< Offset 0x0034 Type _MJVTBL_UINT32
    float        Lifetime;            ///< Offset 0x0038 Type _MJVTBL_FLOAT
};

///< SMSG_DEBUG_DRAW_SPHERE
struct ClientDebugDrawSphere
{
    float        Lifetime;            ///< Offset 0x0000 Type _MJVTBL_FLOAT
    uint32       Settings;            ///< Offset 0x0004 Type _MJVTBL_UINT32
    float        Radius;              ///< Offset 0x0008 Type _MJVTBL_FLOAT
    G3D::Vector3 Center;              ///< Offset 0x000C Type _MJVTBL_V3
    uint32       Id;                  ///< Offset 0x0018 Type _MJVTBL_UINT32
    uint32       Color;               ///< Offset 0x001C Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_BOX
struct ClientDebugDrawBox
{
    uint32       Id;                  ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32       Color;               ///< Offset 0x0004 Type _MJVTBL_UINT32
    float        Lifetime;            ///< Offset 0x0008 Type _MJVTBL_FLOAT
    G3D::Vector3 Extents;             ///< Offset 0x000C Type _MJVTBL_V3
    G3D::Vector4 Matrix30;            ///< Offset 0x0018 Type _MJVTBL_V4
    uint32       Settings;            ///< Offset 0x0028 Type _MJVTBL_UINT32
    G3D::Vector4 Matrix10;            ///< Offset 0x002C Type _MJVTBL_V4
    G3D::Vector4 Matrix20;            ///< Offset 0x003C Type _MJVTBL_V4
    G3D::Vector4 Matrix00;            ///< Offset 0x004C Type _MJVTBL_V4
};

///< SMSG_DEBUG_DRAW_CONE
struct ClientDebugDrawCone
{
    G3D::Vector3 Base;                ///< Offset 0x0000 Type _MJVTBL_V3
    float        Baseradius;          ///< Offset 0x000C Type _MJVTBL_FLOAT
    uint32       Id;                  ///< Offset 0x0010 Type _MJVTBL_UINT32
    G3D::Vector3 Direction;           ///< Offset 0x0014 Type _MJVTBL_V3
    float        Height;              ///< Offset 0x0020 Type _MJVTBL_FLOAT
    uint32       Color;               ///< Offset 0x0024 Type _MJVTBL_UINT32
    float        Lifetime;            ///< Offset 0x0028 Type _MJVTBL_FLOAT
    uint32       Settings;            ///< Offset 0x002C Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_CYLINDER
struct ClientDebugDrawCylinder
{
    uint32       Id;                  ///< Offset 0x0000 Type _MJVTBL_UINT32
    float        Height;              ///< Offset 0x0004 Type _MJVTBL_FLOAT
    G3D::Vector3 Base;                ///< Offset 0x0008 Type _MJVTBL_V3
    float        Lifetime;            ///< Offset 0x0014 Type _MJVTBL_FLOAT
    uint32       Settings;            ///< Offset 0x0018 Type _MJVTBL_UINT32
    G3D::Vector3 Direction;           ///< Offset 0x001C Type _MJVTBL_V3
    float        Radius;              ///< Offset 0x0028 Type _MJVTBL_FLOAT
    uint32       Color;               ///< Offset 0x002C Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_DISK
struct ClientDebugDrawDisk
{
    float        Lifetime;            ///< Offset 0x0000 Type _MJVTBL_FLOAT
    G3D::Vector3 Normal;              ///< Offset 0x0004 Type _MJVTBL_V3
    float        Outterradius;        ///< Offset 0x0010 Type _MJVTBL_FLOAT
    G3D::Vector3 Center;              ///< Offset 0x0014 Type _MJVTBL_V3
    uint32       Settings;            ///< Offset 0x0020 Type _MJVTBL_UINT32
    uint32       Color;               ///< Offset 0x0024 Type _MJVTBL_UINT32
    float        Innerradius;         ///< Offset 0x0028 Type _MJVTBL_FLOAT
    uint32       Id;                  ///< Offset 0x002C Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_SLICE
struct ClientDebugDrawSlice
{
    G3D::Vector3 Direction;           ///< Offset 0x0000 Type _MJVTBL_V3
    G3D::Vector3 Center;              ///< Offset 0x000C Type _MJVTBL_V3
    float        EndAngle;            ///< Offset 0x0018 Type _MJVTBL_FLOAT
    uint32       Color;               ///< Offset 0x001C Type _MJVTBL_UINT32
    float        Outterradius;        ///< Offset 0x0020 Type _MJVTBL_FLOAT
    float        Innerradius;         ///< Offset 0x0024 Type _MJVTBL_FLOAT
    float        StartAngle;          ///< Offset 0x0028 Type _MJVTBL_FLOAT
    float        Lifetime;            ///< Offset 0x002C Type _MJVTBL_FLOAT
    uint32       Id;                  ///< Offset 0x0030 Type _MJVTBL_UINT32
    G3D::Vector3 Normal;              ///< Offset 0x0034 Type _MJVTBL_V3
    uint32       Settings;            ///< Offset 0x0040 Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_ARROW
struct ClientDebugDrawArrow
{
    float        Headscale;           ///< Offset 0x0000 Type _MJVTBL_FLOAT
    uint32       Settings;            ///< Offset 0x0004 Type _MJVTBL_UINT32
    float        Lifetime;            ///< Offset 0x0008 Type _MJVTBL_FLOAT
    G3D::Vector3 Location;            ///< Offset 0x000C Type _MJVTBL_V3
    uint32       Color;               ///< Offset 0x0018 Type _MJVTBL_UINT32
    G3D::Vector3 Direction;           ///< Offset 0x001C Type _MJVTBL_V3
    uint32       Id;                  ///< Offset 0x0028 Type _MJVTBL_UINT32
    float        Length;              ///< Offset 0x002C Type _MJVTBL_FLOAT
};

///< SMSG_DEBUG_DRAW_MATRIX
struct ClientDebugDrawMatrix
{
    float        Lifetime;            ///< Offset 0x0000 Type _MJVTBL_FLOAT
    G3D::Vector4 Matrix00;            ///< Offset 0x0004 Type _MJVTBL_V4
    uint32       Colory;              ///< Offset 0x0014 Type _MJVTBL_UINT32
    G3D::Vector4 Matrix30;            ///< Offset 0x0018 Type _MJVTBL_V4
    uint32       Id;                  ///< Offset 0x0028 Type _MJVTBL_UINT32
    uint32       Colorz;              ///< Offset 0x002C Type _MJVTBL_UINT32
    G3D::Vector4 Matrix20;            ///< Offset 0x0030 Type _MJVTBL_V4
    uint32       Settings;            ///< Offset 0x0040 Type _MJVTBL_UINT32
    G3D::Vector4 Matrix10;            ///< Offset 0x0044 Type _MJVTBL_V4
    float        Axisscale;           ///< Offset 0x0054 Type _MJVTBL_FLOAT
    uint32       Colorx;              ///< Offset 0x0058 Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_TEXT
struct ClientDebugDrawText
{
    uint8        Alignment;           ///< Offset 0x0000 Type _MJVTBL_UINT8
    uint32       Id;                  ///< Offset 0x0004 Type _MJVTBL_UINT32
    uint32       Color;               ///< Offset 0x0008 Type _MJVTBL_UINT32
    uint32       Settings;            ///< Offset 0x000C Type _MJVTBL_UINT32
    float        Lifetime;            ///< Offset 0x0010 Type _MJVTBL_FLOAT
    float        Height;              ///< Offset 0x0014 Type _MJVTBL_FLOAT
    G3D::Vector2 Location;            ///< Offset 0x0018 Type _MJVTBL_V2
    std::string  Text;                ///< Offset 0x0020 Type _MJVTBL_STRING
};

///< SMSG_DEBUG_DRAW_TEXT3_D
struct ClientDebugDrawText3D
{
    uint32       Settings;            ///< Offset 0x0000 Type _MJVTBL_UINT32
    std::string  Text;                ///< Offset 0x0004 Type _MJVTBL_STRING
    uint32       Id;                  ///< Offset 0x0804 Type _MJVTBL_UINT32
    uint32       Color;               ///< Offset 0x0808 Type _MJVTBL_UINT32
    uint8        Alignment;           ///< Offset 0x080C Type _MJVTBL_UINT8
    G3D::Vector3 Location;            ///< Offset 0x0810 Type _MJVTBL_V3
    float        Height;              ///< Offset 0x081C Type _MJVTBL_FLOAT
    float        Lifetime;            ///< Offset 0x0820 Type _MJVTBL_FLOAT
};

///< SMSG_DEBUG_DRAW_CANCEL
struct ClientDebugDrawCancel
{
    uint32 Id;            ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_ADD_GRAPH
struct ClientDebugDrawAddGraph
{
    std::string  Label;                     ///< Offset 0x0000 Type _MJVTBL_STRING
    G3D::Vector2 Bounds_min;                ///< Offset 0x0080 Type _MJVTBL_V2
    uint32       Height;                    ///< Offset 0x0088 Type _MJVTBL_UINT32
    uint32       Flags;                     ///< Offset 0x008C Type _MJVTBL_UINT32
    uint32       DefaultSampleColor;        ///< Offset 0x0090 Type _MJVTBL_UINT32
    uint32       SampleCapacity;            ///< Offset 0x0094 Type _MJVTBL_UINT32
    uint32       Id;                        ///< Offset 0x0098 Type _MJVTBL_UINT32
    G3D::Vector2 Bounds_max;                ///< Offset 0x009C Type _MJVTBL_V2
    uint32       Width;                     ///< Offset 0x00A4 Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_ADD_GRAPH_AT
struct ClientDebugDrawAddGraphAt
{
    std::string  Label;                     ///< Offset 0x0000 Type _MJVTBL_STRING
    uint32       DefaultSampleColor;        ///< Offset 0x0080 Type _MJVTBL_UINT32
    G3D::Vector2 Bounds_min;                ///< Offset 0x0084 Type _MJVTBL_V2
    G3D::Vector2 Bounds_max;                ///< Offset 0x008C Type _MJVTBL_V2
    uint32       Width;                     ///< Offset 0x0094 Type _MJVTBL_UINT32
    int32        X;                         ///< Offset 0x0098 Type _MJVTBL_INT32
    uint32       Height;                    ///< Offset 0x009C Type _MJVTBL_UINT32
    int32        Y;                         ///< Offset 0x00A0 Type _MJVTBL_INT32
    uint32       SampleCapacity;            ///< Offset 0x00A4 Type _MJVTBL_UINT32
    uint32       Flags;                     ///< Offset 0x00A8 Type _MJVTBL_UINT32
    uint32       Id;                        ///< Offset 0x00AC Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_HIDE_GRAPH
struct ClientDebugDrawHideGraph
{
    bool   Hide;          ///< Offset 0x0000 Type _MJVTBL_BOOL
    uint32 Id;            ///< Offset 0x0004 Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_RESET_GRAPH
struct ClientDebugDrawResetGraph
{
    uint32 Id;            ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_DESTROY_GRAPH
struct ClientDebugDrawDestroyGraph
{
    uint32 Id;            ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_SET_GRAPH_BOUNDS
struct ClientDebugDrawSetGraphBounds
{
    G3D::Vector2 Bounds_max;          ///< Offset 0x0000 Type _MJVTBL_V2
    uint32       Id;                  ///< Offset 0x0008 Type _MJVTBL_UINT32
    G3D::Vector2 Bounds_min;          ///< Offset 0x000C Type _MJVTBL_V2
};

///< SMSG_DEBUG_DRAW_SET_GRAPH_FRAME
struct ClientDebugDrawSetGraphFrame
{
    uint32 Height;        ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32 Width;         ///< Offset 0x0004 Type _MJVTBL_UINT32
    uint32 Id;            ///< Offset 0x0008 Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_SET_GRAPH_FRAME_AT
struct ClientDebugDrawSetGraphFrameAt
{
    int32  Y;             ///< Offset 0x0000 Type _MJVTBL_INT32
    uint32 Id;            ///< Offset 0x0004 Type _MJVTBL_UINT32
    int32  X;             ///< Offset 0x0008 Type _MJVTBL_INT32
    uint32 Height;        ///< Offset 0x000C Type _MJVTBL_UINT32
    uint32 Width;         ///< Offset 0x0010 Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_ADD_SAMPLE
struct ClientDebugDrawAddSample
{
    uint32 Id;              ///< Offset 0x0000 Type _MJVTBL_UINT32
    float  X;               ///< Offset 0x0004 Type _MJVTBL_FLOAT
    float  Y;               ///< Offset 0x0008 Type _MJVTBL_FLOAT
    uint32 SourceID;        ///< Offset 0x000C Type _MJVTBL_UINT32
};

///< SMSG_DEBUG_DRAW_SET_SOURCE_COLOR
struct ClientDebugDrawSetSourceColor
{
    uint32 Color;           ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32 Id;              ///< Offset 0x0004 Type _MJVTBL_UINT32
    uint32 SourceID;        ///< Offset 0x0008 Type _MJVTBL_UINT32
};

///< SMSG_LOSS_OF_CONTROL_AURA_UPDATE
struct ClientLossOfControlAuraUpdate
{
    struct JamLossOfControlInfo
    {
        uint8 AuraSlot;           ///< Offset 0x0000 Type _MJVTBL_UINT8
        uint8 EffectIndex;        ///< Offset 0x0001 Type _MJVTBL_UINT8
        int32 Type;               ///< Offset 0x0004 Type _MJVTBL_INT32
        int32 Mechanic;           ///< Offset 0x0008 Type _MJVTBL_INT32
    };

    std::vector<JamLossOfControlInfo> LossOfControlInfo;                        ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<JamLossOfControlInfo>::MJVTBL
};

///< SMSG_ADD_LOSS_OF_CONTROL
struct ClientAddLossOfControl
{
    uint32 DurationRemaining;        ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint64 Caster;                   ///< Offset 0x0008 Type _MJVTBL_UINT64
    uint32 Duration;                 ///< Offset 0x0010 Type _MJVTBL_UINT32
    uint32 LockoutSchoolMask;        ///< Offset 0x0014 Type _MJVTBL_UINT32
    int32  SpellID;                  ///< Offset 0x0018 Type _MJVTBL_INT32
    int32  Type;                     ///< Offset 0x001C Type _MJVTBL_INT32
    int32  Mechanic;                 ///< Offset 0x0020 Type _MJVTBL_INT32
};

///< SMSG_REMOVE_LOSS_OF_CONTROL
struct ClientRemoveLossOfControl
{
    int32  SpellID;        ///< Offset 0x0000 Type _MJVTBL_INT32
    uint64 Caster;         ///< Offset 0x0008 Type _MJVTBL_UINT64
    int32  Type;           ///< Offset 0x0010 Type _MJVTBL_INT32
};

///< SMSG_CLEAR_LOSS_OF_CONTROL
struct ClientClearLossOfControl
{
};

///< SMSG_DEBUG_DRAW_AURA
struct ClientDebugDrawAura
{
    uint64       Caster;              ///< Offset 0x0000 Type _MJVTBL_UINT64
    int32        SpellID;             ///< Offset 0x0008 Type _MJVTBL_INT32
    G3D::Vector3 Position;            ///< Offset 0x000C Type _MJVTBL_V3
};

///< SMSG_QUERY_OBJ_POSITION
struct ClientQueryObjPosition
{
    float        Facing;              ///< Offset 0x0000 Type _MJVTBL_FLOAT
    G3D::Vector3 Position;            ///< Offset 0x0004 Type _MJVTBL_V3
    uint32       MapID;               ///< Offset 0x0010 Type _MJVTBL_UINT32
    bool         ToClipboard;         ///< Offset 0x0014 Type _MJVTBL_BOOL
};

///< SMSG_QUERY_OBJ_ROTATION
struct ClientQueryObjRotation
{
    float AnchorFacing;        ///< Offset 0x0000 Type _MJVTBL_FLOAT
    float Facing;              ///< Offset 0x0004 Type _MJVTBL_FLOAT
};

///< SMSG_PET_BATTLE_DEBUG_QUEUE_DUMP_RESPONSE
struct ClientPetBattleDebugQueueDumpResponse
{
    struct PBQueueDumpMember
    {
        uint64 MemberGUID;               ///< Offset 0x0000 Type _MJVTBL_UINT64
        float  AverageTeamRating;        ///< Offset 0x0008 Type _MJVTBL_FLOAT
        float  CurrentTolerance;         ///< Offset 0x000C Type _MJVTBL_FLOAT
        uint32 SecondsInQueue;           ///< Offset 0x0010 Type _MJVTBL_TIME_T
    };

    std::vector<PBQueueDumpMember> Members;                               ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<PBQueueDumpMember>::MJVTBL
    uint32                         AverageQueueTime;                      ///< Offset 0x0018 Type _MJVTBL_TIME_T
};

///< SMSG_AREA_TRIGGER_DENIED
struct ClientAreaTriggerDenied
{
    bool  Entered;              ///< Offset 0x0000 Type _MJVTBL_BOOL
    int32 AreaTriggerID;        ///< Offset 0x0004 Type _MJVTBL_INT32
};

///< SMSG_SET_SERVER_WOW_TIME
struct ClientSetServerWowTime
{
    uint32 EncodedTime;          ///< Offset 0x0000 Type _MJVTBL_UINT32
    int32  HolidayOffset;        ///< Offset 0x0004 Type _MJVTBL_INT32
};

///< SMSG_SET_TIME_ZONE_INFORMATION
struct ClientSetTimeZoneInformation
{
    std::string ServerTimeTZ;        ///< Offset 0x0000 Type _MJVTBL_STRING
    std::string GameTimeTZ;          ///< Offset 0x0080 Type _MJVTBL_STRING
};

///< SMSG_BATTLE_PET_CAGE_DATE_ERROR
struct ClientBattlePetCageDateError
{
    int32 SecondsUntilCanCage;        ///< Offset 0x0000 Type _MJVTBL_INT32
};

///< SMSG_DISPLAY_PLAYER_CHOICE
struct ClientDisplayPlayerChoice
{
    struct PlayerChoiceResponse
    {
        struct PlayerChoiceResponseReward
        {
            struct PlayerChoiceResponseRewardEntry
            {
                int32 Id;               ///< Offset 0x0000 Type _MJVTBL_INT32
                int32 DisplayID;        ///< Offset 0x0004 Type _MJVTBL_INT32
                int32 Quantity;         ///< Offset 0x0008 Type _MJVTBL_INT32
            };

            int32                                        TitleID;                                             ///< Offset 0x0000 Type _MJVTBL_INT32
            int32                                        PackageID;                                           ///< Offset 0x0004 Type _MJVTBL_INT32
            int32                                        SkillLineID;                                         ///< Offset 0x0008 Type _MJVTBL_INT32
            uint32                                       SkillPointCount;                                     ///< Offset 0x000C Type _MJVTBL_UINT32
            uint32                                       ArenaPointCount;                                     ///< Offset 0x0010 Type _MJVTBL_UINT32
            uint32                                       HonorPointCount;                                     ///< Offset 0x0014 Type _MJVTBL_UINT32
            uint64                                       Money;                                               ///< Offset 0x0018 Type _MJVTBL_UINT64
            uint32                                       Xp;                                                  ///< Offset 0x0020 Type _MJVTBL_UINT32
            std::vector<PlayerChoiceResponseRewardEntry> Items;                                               ///< Offset 0x0028 Type MakeMJVTblForArrayOfStruct<PlayerChoiceResponseRewardEntry>::MJVTBL
            std::vector<PlayerChoiceResponseRewardEntry> Currencies;                                          ///< Offset 0x0040 Type MakeMJVTblForArrayOfStruct<PlayerChoiceResponseRewardEntry>::MJVTBL
            std::vector<PlayerChoiceResponseRewardEntry> Factions;                                            ///< Offset 0x0058 Type MakeMJVTblForArrayOfStruct<PlayerChoiceResponseRewardEntry>::MJVTBL
            std::vector<PlayerChoiceResponseRewardEntry> ItemChoices;                                         ///< Offset 0x0070 Type MakeMJVTblForArrayOfStruct<PlayerChoiceResponseRewardEntry>::MJVTBL
        };

        int32                                ResponseID;                                  ///< Offset 0x0000 Type _MJVTBL_INT32
        std::string                          Answer;                                      ///< Offset 0x0004 Type _MJVTBL_STRING
        std::string                          Description;                                 ///< Offset 0x0194 Type _MJVTBL_STRING
        int32                                ChoiceArtFileID;                             ///< Offset 0x07D4 Type _MJVTBL_INT32
        Optional<PlayerChoiceResponseReward> Reward;                                      ///< Offset 0x07D8 Type MakeMJVTblForOptionalStruct<PlayerChoiceResponseReward>::MJVTBL
    };

    int32                             ChoiceID;                                 ///< Offset 0x0000 Type _MJVTBL_INT32
    std::string                       Question;                                 ///< Offset 0x0004 Type _MJVTBL_STRING
    std::vector<PlayerChoiceResponse> Responses;                                ///< Offset 0x0108 Type MakeMJVTblForArrayOfStruct<PlayerChoiceResponse>::MJVTBL
};

///< SMSG_SHOW_ZONES_CHEAT_RESULT
struct ClientShowZonesCheatResult
{
    struct ShowZoneRLE
    {
        int32 Run;          ///< Offset 0x0000 Type _MJVTBL_INT32
        uint8 CurID;        ///< Offset 0x0004 Type _MJVTBL_UINT8
    };

    std::vector<ShowZoneRLE> Run;                             ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ShowZoneRLE>::MJVTBL
};

///< SMSG_TEXT_EMOTE
struct ClientTextEmote
{
    uint64 SourceGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint64 TargetGUID;        ///< Offset 0x0008 Type _MJVTBL_UINT64
    int32  SoundIndex;        ///< Offset 0x0010 Type _MJVTBL_INT32
    int32  EmoteID;           ///< Offset 0x0014 Type _MJVTBL_INT32
};

///< SMSG_PET_GOD_MODE
struct ClientPetGodMode
{
    bool Enabled;        ///< Offset 0x0000 Type _MJVTBL_BOOL
};

///< SMSG_TAXI_NODE_STATUS
struct ClientTaxiNodeStatus
{
    TAXISTATUS Status;            ///< Offset 0x0000 Type _MJVTBL_TAXISTATUS
    uint64     Unit;              ///< Offset 0x0008 Type _MJVTBL_UINT64
};

///< SMSG_ACTIVATE_TAXI_REPLY
struct ClientActivateTaxiReply
{
    TAXIREPLY Error;            ///< Offset 0x0000 Type _MJVTBL_TAXIREPLY
};

///< SMSG_NEW_TAXI_PATH
struct ClientNewTaxiPath
{
};

///< SMSG_SHOW_BANK
struct ClientShowBank
{
    uint64 Banker;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_DBLOOKUP_RESULTS
struct ClientDBLookupResults
{
    uint32             NumResults;                ///< Offset 0x0000 Type _MJVTBL_UINT32
    std::vector<uint8> Results;                   ///< Offset 0x0008 Type MakeMJVTblForArrayOf<unsignedchar,&(MJVTBL_UINT8)>::MJVTBL
};

///< SMSG_GAME_SPEED_SET
struct ClientGameSpeedSet
{
    float NewSpeed;        ///< Offset 0x0000 Type _MJVTBL_FLOAT
};

///< SMSG_SERVER_TIME
struct ClientServerTime
{
    uint32 LastTick;        ///< Offset 0x0000 Type _MJVTBL_UINT32
    uint32 GameTime;        ///< Offset 0x0004 Type _MJVTBL_UINT32
};

///< SMSG_LOGOUT_RESPONSE
struct ClientLogoutResponse
{
    int32 LogoutResult;        ///< Offset 0x0000 Type _MJVTBL_INT32
    bool  Instant;             ///< Offset 0x0004 Type _MJVTBL_BOOL
};

///< SMSG_LOGOUT_COMPLETE
struct ClientLogoutComplete
{
    uint64 SwitchToCharacter;        ///< Offset 0x0000 Type _MJVTBL_UINT64
};

///< SMSG_LOGOUT_CANCEL_ACK
struct ClientLogoutCancelAck
{
};

///< SMSG_INSTANCE_RESET
struct ClientInstanceReset
{
    uint32 MapID;         ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_INSTANCE_RESET_FAILED
struct ClientInstanceResetFailed
{
    RESET_FAILED_REASON ResetFailedReason;          ///< Offset 0x0000 Type _MJVTBL_RESET_FAILED_REASON
    uint32              MapID;                      ///< Offset 0x0004 Type _MJVTBL_UINT32
};

///< SMSG_UPDATE_LAST_INSTANCE
struct ClientUpdateLastInstance
{
    uint32 MapID;         ///< Offset 0x0000 Type _MJVTBL_UINT32
};

///< SMSG_KICK_REASON
struct ClientKickReason
{
    uint8 Reason;        ///< Offset 0x0000 Type _MJVTBL_UINT8
};

///< SMSG_GMCHANGE_PVPRATING
struct ClientGMChangePVPRating
{
    bool Success;        ///< Offset 0x0000 Type _MJVTBL_BOOL
};

///< SMSG_CALENDAR_SEND_CALENDAR
struct ClientCalendarSendCalendar
{
    struct ClientCalendarSendCalendarEventInfo
    {
        uint64      EventID;             ///< Offset 0x0000 Type _MJVTBL_UINT64
        std::string EventName;           ///< Offset 0x0008 Type _MJVTBL_STRING
        uint8       EventType;           ///< Offset 0x0089 Type _MJVTBL_UINT8
        uint32      Date;                ///< Offset 0x008C Type _MJVTBL_UINT32
        uint32      Flags;               ///< Offset 0x0090 Type _MJVTBL_UINT32
        int32       TextureID;           ///< Offset 0x0094 Type _MJVTBL_INT32
        uint64      EventGuildID;        ///< Offset 0x0098 Type _MJVTBL_UINT64
        uint64      OwnerGUID;           ///< Offset 0x00A0 Type _MJVTBL_UINT64
    };

    struct ClientCalendarSendCalendarRaidResetInfo
    {
        int32  MapID;           ///< Offset 0x0000 Type _MJVTBL_INT32
        uint32 Duration;        ///< Offset 0x0004 Type _MJVTBL_UINT32
        int32  Offset;          ///< Offset 0x0008 Type _MJVTBL_INT32
    };

    struct ClientCalendarSendCalendarRaidLockoutInfo
    {
        uint64 InstanceID;          ///< Offset 0x0000 Type _MJVTBL_UINT64
        int32  MapID;               ///< Offset 0x0008 Type _MJVTBL_INT32
        uint32 DifficultyID;        ///< Offset 0x000C Type _MJVTBL_UINT32
        int32  ExpireTime;          ///< Offset 0x0010 Type _MJVTBL_INT32
    };

    struct ClientCalendarSendCalendarHolidayInfo
    {
        int32       HolidayID;                ///< Offset 0x0000 Type _MJVTBL_INT32
        int32       Region;                   ///< Offset 0x0004 Type _MJVTBL_INT32
        int32       Looping;                  ///< Offset 0x0008 Type _MJVTBL_INT32
        int32       Priority;                 ///< Offset 0x000C Type _MJVTBL_INT32
        int32       FilterType;               ///< Offset 0x0010 Type _MJVTBL_INT32
        std::string TextureFilename;          ///< Offset 0x0014 Type _MJVTBL_STRING
        int32       Date[26];                 ///< Offset 0x0054 Type MakeMJVTblForFixedArrayOf<int,26,&(MJVTBL_INT32)>::MJVTBL
        int32       Duration[10];             ///< Offset 0x00BC Type MakeMJVTblForFixedArrayOf<int,10,&(MJVTBL_INT32)>::MJVTBL
        int32       CalendarFlags[10];        ///< Offset 0x00E4 Type MakeMJVTblForFixedArrayOf<int,10,&(MJVTBL_INT32)>::MJVTBL
    };

    struct ClientCalendarSendCalendarInviteInfo
    {
        uint64 EventID;            ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint64 InviteID;           ///< Offset 0x0008 Type _MJVTBL_UINT64
        uint64 InviterGUID;        ///< Offset 0x0010 Type _MJVTBL_UINT64
        uint8  Status;             ///< Offset 0x0018 Type _MJVTBL_UINT8
        uint8  Moderator;          ///< Offset 0x0019 Type _MJVTBL_UINT8
        uint8  InviteType;         ///< Offset 0x001A Type _MJVTBL_UINT8
    };

    std::vector<ClientCalendarSendCalendarEventInfo>       Events;                                                        ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<ClientCalendarSendCalendarEventInfo>::MJVTBL
    std::vector<ClientCalendarSendCalendarRaidResetInfo>   RaidResets;                                                    ///< Offset 0x0018 Type MakeMJVTblForArrayOfStruct<ClientCalendarSendCalendarRaidResetInfo>::MJVTBL
    std::vector<ClientCalendarSendCalendarRaidLockoutInfo> RaidLockouts;                                                  ///< Offset 0x0030 Type MakeMJVTblForArrayOfStruct<ClientCalendarSendCalendarRaidLockoutInfo>::MJVTBL
    std::vector<ClientCalendarSendCalendarHolidayInfo>     Holidays;                                                      ///< Offset 0x0048 Type MakeMJVTblForArrayOfStruct<ClientCalendarSendCalendarHolidayInfo>::MJVTBL
    uint32                                                 RaidOrigin;                                                    ///< Offset 0x0060 Type _MJVTBL_TIME_T
    std::vector<ClientCalendarSendCalendarInviteInfo>      Invites;                                                       ///< Offset 0x0068 Type MakeMJVTblForArrayOfStruct<ClientCalendarSendCalendarInviteInfo>::MJVTBL
    uint32                                                 ServerTime;                                                    ///< Offset 0x0080 Type _MJVTBL_UINT32
    uint32                                                 ServerNow;                                                     ///< Offset 0x0088 Type _MJVTBL_TIME_T
};

///< SMSG_CALENDAR_SEND_EVENT
struct ClientCalendarSendEvent
{
    struct ClientCalendarEventInviteInfo
    {
        uint64      Guid;                ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint64      InviteID;            ///< Offset 0x0008 Type _MJVTBL_UINT64
        uint8       Level;               ///< Offset 0x0010 Type _MJVTBL_UINT8
        uint8       Status;              ///< Offset 0x0011 Type _MJVTBL_UINT8
        uint8       Moderator;           ///< Offset 0x0012 Type _MJVTBL_UINT8
        uint8       InviteType;          ///< Offset 0x0013 Type _MJVTBL_UINT8
        uint32      ResponseTime;        ///< Offset 0x0014 Type _MJVTBL_UINT32
        std::string Notes;               ///< Offset 0x0018 Type _MJVTBL_STRING
    };

    uint64                                     OwnerGUID;                                         ///< Offset 0x0000 Type _MJVTBL_UINT64
    uint32                                     Date;                                              ///< Offset 0x0008 Type _MJVTBL_UINT32
    uint32                                     LockDate;                                          ///< Offset 0x000C Type _MJVTBL_UINT32
    uint8                                      GetEventType;                                      ///< Offset 0x0010 Type _MJVTBL_UINT8
    std::string                                Description;                                       ///< Offset 0x0011 Type _MJVTBL_STRING
    std::string                                EventName;                                         ///< Offset 0x0412 Type _MJVTBL_STRING
    int32                                      TextureID;                                         ///< Offset 0x0494 Type _MJVTBL_INT32
    uint32                                     Flags;                                             ///< Offset 0x0498 Type _MJVTBL_UINT32
    uint8                                      EventType;                                         ///< Offset 0x049C Type _MJVTBL_UINT8
    std::vector<ClientCalendarEventInviteInfo> Invites;                                           ///< Offset 0x04A0 Type MakeMJVTblForArrayOfStruct<ClientCalendarEventInviteInfo>::MJVTBL
    uint64                                     EventGuildID;                                      ///< Offset 0x04B8 Type _MJVTBL_UINT64
    uint64                                     EventID;                                           ///< Offset 0x04C0 Type _MJVTBL_UINT64
};

///< SMSG_CALENDAR_EVENT_INITIAL_INVITES
struct ClientCalendarEventInitialInvites
{
    struct CalendarEventInitialInviteInfo
    {
        uint64 InviteGUID;        ///< Offset 0x0000 Type _MJVTBL_UINT64
        uint8  Level;             ///< Offset 0x0008 Type _MJVTBL_UINT8
    };

    std::vector<CalendarEventInitialInviteInfo> Invites;                                            ///< Offset 0x0000 Type MakeMJVTblForArrayOfStruct<CalendarEventInitialInviteInfo>::MJVTBL
};

///< SMSG_CALENDAR_EVENT_INVITE
struct ClientCalendarEventInvite
{
    uint64 InviteID;            ///< Offset 0x0000 Type _MJVTBL_UINT64
